{
  "feeling": "الغضب",
  "verses": [
    {
      "title": "آل عمران ١٣٤ / Aal-Imran 134",
      "verse_text": "يقول الله تعالى",
      "content": "لكن القرآن لا يقف عند مجرد كظم الغيظ، بل يرفعك إلى مقام أعلى: ﴿وَٱلۡعَافِينَ عَنِ ٱلنَّاسِ﴾. ليس فقط أن تكتم غضبك، بل أن تسامح من أغضبك. أن يكون قلبك أكبر من الأذى الذي أصابك. هذا أصعب على النفس، لكنه طريق المحسنين.\n\nثم يأتي الخاتمة التي تجعل القلب يلين: ﴿وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ﴾. كأن الله يقول: إذا استطعت أن تتحكم بغضبك، وتعفو عمن أخطأ في حقك، فأنت قد ارتقيت إلى مقام المحسنين الذين يحبهم الله. وأي كرامة أعظم من أن تكون محبوبًا عند الله؟\n\nابن كثير قال: الكاظمين الغيظ: أي لا يعملون به، بل يكظمونه في قلوبهم، ويعفون عمّن ظلمهم، ثم يحب الله من أحسن منهم بعد ذلك. والطبري قال: يكظمون غيظهم أي يحبِسون غضبهم عند القدرة على إنفاذه. والقرطبي قال: هذه الآية أصل في فضل كظم الغيظ والعفو عن الناس، وفيها مدح عظيم لهذه الأخلاق. والسعدي قال: هذا من عزم الأمور، وهو سبب لمحبة الله للعبد.\n\nفتأمل يا عزيزي القارئ: الغضب شعور بشري طبيعي، لكن الله لا يريد منك أن تلغيه، بل أن تروضه. أن تكظمه حين يشتعل، ثم تعفو حين تقدر، فتتحول نار الغضب إلى نور إحسان يرفعك عند الله.",
      "english_content": "Allah says: \"Those who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people – and Allah loves the doers of good.\" [Aal-Imran: 134]\n\nListen, dear reader, this verse is like a roadmap for dealing with the feeling of anger. Allah praises the people of piety and describes them with noble traits, and among the greatest of these is: “who restrain anger.” The word “restrain” here means to hold something back, to seal it inside as if closing a full container tightly. So, the true believer is the one who, when his heart fills with anger, does not let it spill into insults, injustice, or revenge. Instead, he suppresses it, controls it, and keeps it locked within until it fades away.\n\nBut the Qur’an doesn’t stop at just restraining anger—it elevates you to a higher station: “and who pardon the people.” It is not enough to simply hold your anger inside; the greater virtue is to forgive the one who hurt you. To make your heart bigger than the offense. This is harder on the soul, but it is the path of excellence.\n\nAnd then comes the conclusion that softens the heart: “And Allah loves the doers of good.” It is as if Allah is telling you: if you manage to control your anger, and go beyond that by forgiving those who wronged you, then you have risen to the level of ihsan—excellence—and you become among those whom Allah Himself loves. And what greater honor can there be than being loved by Allah?\n\nIbn Kathir said: “Those who restrain their anger do not act upon it, but hold it in their hearts and forgive those who wronged them. Then Allah loves those who go further and act with ihsan.” Al-Tabari explained: “They restrain their anger when they have the power to release it.” Al-Qurtubi said: “This verse is a foundation for the virtue of restraining anger and forgiving people, and it contains a great praise for these qualities.” And Al-Sa’di added: “This is one of the firmest matters of character, and it is a cause for Allah’s love.”\n\nSo reflect, dear reader: anger is a natural human feeling. Allah does not ask you to erase it, but to discipline it. To restrain it when it flares, then to forgive when you have the power to retaliate. In that way, the fire of anger turns into the light of goodness, raising you in rank until you are counted among those Allah loves.",
      "id": 1
    },
    {
      "title": "آل عمران ٢٠٠ / Aal-Imran 200",
      "verse_text": "يقول الله تعالى",
      "content": "ثم يرفعك إلى درجة أعلى: ﴿وَصَابِرُواْ﴾، أي صابروا غيركم، اصبروا على أذى الناس، وتحمّلوا جهلهم وظلمهم دون أن تفقدوا توازكم. الصبر الأول داخلي، أما المصابرة فهي في التعامل مع الآخرين.\n\nثم يقول: ﴿وَرَابِطُواْ﴾. والمُرابطة في أصلها تعني الثبات في مواقع الجهاد، لكنها تشمل كل موقف يحتاج صبرًا طويلًا ويقظةً دائمة. يعني: اربط قلبك على طاعة الله، الزم ثغور نفسك حتى لا ينفذ منها الشيطان وقت الغضب، واثبت على خط الجهاد الأكبر، جهاد النفس.\n\nويختم بقوله: ﴿وَٱتَّقُواْ ٱللَّهَ﴾، أي اجعلوا تقوى الله هي البوصلة، تذكّروه عند كل اندفاع وغضب، فهي التي تحفظكم من الزلل. والنتيجة: ﴿لَعَلَّكُمۡ تُفۡلِحُونَ﴾، أي لعلكم تفوزون بالسعادة الحقيقية والنجاة يوم القيامة.\n\nابن كثير قال: اصبروا على دينكم، وصابروا أعداءكم، ورابطوا في سبيل الله، واتقوا الله في جميع أموركم. والطبري قال: اصبروا على أمر الله، وصابروا المشركين على عداوتهم، ورابطوا على الجهاد، واتقوا الله بطاعته. والسعدي قال: هذا أمر عام يشمل الصبر على الطاعات، وعن المعاصي، وعلى أقدار الله، والمصابرة للعدو، والمرابطة على الثغور، وتقوى الله في السر والعلن.\n\nفتأمل يا عزيزي القارئ: هذه الآية ليست مجرد أوامر متفرقة، بل هي منهج في ضبط النفس عند الغضب والشدائد: صبر داخلي يروّض نفسك، مصابرة خارجية تصبر بها على الناس، مرابطة تربط قلبك بالله وتثبّت موقفك، وتقوى تجعل كل ذلك في ميزان الفلاح.",
      "english_content": "Allah says: \"O you who have believed, be patient and endure and remain stationed and fear Allah that you may be successful.\" [Aal-Imran: 200]\n\nListen, dear reader, this verse feels like a comprehensive will from Allah to His believing servants, especially in moments of anger and hardship, when the heart flares and the soul trembles. Allah begins by addressing you: “Be patient”—that means be patient with yourself, with your inner struggles, with your anger, with your grief, and with your temptations.\n\nThen He raises you to a higher station: “and endure.” Endure others—their harm, their ignorance, their injustices—without losing your balance or dignity. The first patience is inward; this endurance is outward in your dealings with people.\n\nThen He says: “and remain stationed.” In its original meaning, this referred to standing firm in the frontlines of battle, but its sense extends to every position in life that requires perseverance and vigilance. It means: tie your heart firmly to Allah, remain steadfast in guarding your soul, and don’t allow anger or the whisperings of Satan to break your resolve.\n\nFinally, He commands: “and fear Allah.” Let God-consciousness be your compass. Remember Him when you feel your emotions boiling, when your strength urges you to retaliate. It is taqwa—mindfulness of Allah—that will protect you from slipping into sin.\n\nAnd the promise is: “that you may be successful.” True success, true happiness, true victory is not found in giving in to anger or overpowering others, but in mastering yourself with patience, endurance, steadfastness, and taqwa.\n\nIbn Kathir explained: “Be patient with your religion, endure against your enemies, remain stationed in the cause of Allah, and fear Allah in all your affairs.” Al-Tabari said: “Be patient with Allah’s commands, endure against the disbelievers, remain stationed in jihad, and fear Allah through obedience.” And Al-Sa’di added: “This is a general command covering patience in obedience, patience in avoiding sin, patience in facing divine decrees, endurance against the enemy, remaining stationed on the frontiers, and fearing Allah in both private and public.”\n\nSo reflect, dear reader: this verse is not just a list of commands—it is a complete method for controlling the self in times of anger and trial. Inner patience, outward endurance, steadfast stationing, and God-consciousness—all together forming the path to true success.",
      "id": 2
    },
    {
      "title": "الشورى ٣٧ / Ash-Shura 37",
      "verse_text": "يقول الله تعالى",
      "content": "لكن الآية لا تتوقف عند ذلك، بل تذهب إلى نقطة دقيقة جدًا من حياة القلب: ﴿وَإِذَا مَا غَضِبُواْ هُمۡ يَغۡفِرُونَ﴾. لم تقل: \"وإذا غضبوا لا يغضبون\"، فالغضب طبيعة بشرية لا تُلغى. بل قالت: إذا غضبوا، يغفرون. أي أن رد فعلهم أمام الغضب ليس انفجارًا أو انتقامًا، بل عفوًا ومغفرة. هذه درجة عالية من التحكم في النفس، أن تحول لحظة الانفعال إلى فرصة للصفح.\n\nابن كثير قال: أي إذا ثار غضبهم كظموه، ولم ينفذوا فيه شيئًا مما حُرّم عليهم، بل يعفون ويصفحون. والطبري قال: أي أنهم لا يعاقبون من أساء إليهم إذا غضبوا، بل يغفرون زلاته. والقرطبي قال: الغضب جمرة في القلب، ودواؤه العفو، فمن غفر عند غضبه فقد أطفأ نارها. والسعدي قال: هذا من عزم الأمور، وهو دليل على سعة الصدر، وحسن الخلق، ومحبة الله لهم.\n\nفتأمل يا عزيزي القارئ: القرآن يقرّ أن الغضب جزء منك، لكنه لا يرضى أن تتحول أسيره. بل يدعوك أن تكون سيد نفسك، فإذا اشتعل الغضب في قلبك، اختر أن تطفئه بالمغفرة. هذا الموقف لا يذهب هباءً، بل يرفعك عند الله إلى مصافّ الذين مدحهم في كتابه، ويجعل قلبك أنقى وأقرب إلى الطمأنينة.",
      "english_content": "Allah says: \"And those who avoid the major sins and immoralities, and when they are angry, they forgive.\" [Ash-Shura: 37]\n\nListen, dear reader, this verse describes a group of believers with lofty qualities and sets a refined standard for handling anger. First: “they avoid the major sins and immoralities.” They keep themselves far from the gravest of sins and the ugliest of acts, guarding their souls with a shield of purity so that they do not fall into what destroys hearts and ruins lives.\n\nBut the verse doesn’t stop there—it moves to something more subtle, something that touches the life of the heart: “and when they are angry, they forgive.” Notice, it doesn’t say “they do not get angry.” Anger is a natural part of being human; Allah does not ask us to erase it. Instead, He asks us to shape it, to elevate it. The true believer is not the one who never feels anger, but the one who, when anger rises within him, transforms it into forgiveness.\n\nIbn Kathir said: “When their anger is stirred, they suppress it, and they do not carry it out in forbidden ways, but rather they forgive and pardon.” Al-Tabari explained: “They do not punish those who wronged them when they are angry; instead, they forgive their slips.” Al-Qurtubi said: “Anger is like a fire in the heart, and its cure is forgiveness. Whoever forgives at the time of anger has extinguished its flame.” And Al-Sa’di added: “This is among the firmest traits of character, showing broadness of heart, good manners, and Allah’s love for them.”\n\nSo reflect, dear reader: the Qur’an acknowledges that anger lives within you, but it does not want you to be its prisoner. It calls you to mastery over yourself. When anger sparks in your heart, you are invited to extinguish it with forgiveness. This act is not weakness—it is strength, it is nobility, it is the mark of those honored by Allah. And every time you forgive in anger, you polish your heart and draw nearer to peace.",
      "id": 3
    },
    {
      "title": "الشورى ٤٠ / Ash-Shura 40",
      "verse_text": "يقول الله تعالى",
      "content": "لكن القرآن لا يقف عند حد العدل، بل يفتح لك بابًا أوسع وأجمل: ﴿فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِ﴾. أي أن من اختار أن يعفو بدل أن ينتقم، لا يضيع حقه، بل يتولى الله نفسه أن يكافئه. لاحظ قوله: \"فأجره على الله\"—لم يحدد الأجر، تركه مطلقًا، وكأن الله يقول: أنا الذي أتكفل بمكافأتك، وجزائي أعظم مما تتخيل.\n\nثم يأتي التحذير: ﴿إِنَّهُۥ لَا يُحِبُّ ٱلظَّـٰلِمِينَ﴾، أي لا يجوز أن تتجاوز في ردك فتظلم، لأنك حينها تنتقل من مظلوم إلى ظالم، وتخرج من محبة الله.\n\nابن كثير قال: من انتصر فاقتصر على قدر حقه، فليس عليه جناح، ومن عفا وأصلح كان له عند الله أجر عظيم. والطبري قال: العفو مع الإصلاح أفضل من الاقتصاص، وأجره عند الله مضمون. والقرطبي قال: أجر العافين موكول إلى الله، يدل على عظم الجزاء وسعته. والسعدي قال: هذا وعد عظيم، حيث جعل أجر العفو والإصلاح على نفسه الكريمة.\n\nفتأمل يا عزيزي القارئ: الغضب قد يدفعك إلى رد الإساءة، وهذا حقك، لكن الأعظم أن تعفو وتصلح. وحين تختار هذا الطريق، فأنت تسلّم أجرك بيد الله مباشرة. تخيّل أن الله نفسه يتكفل بمكافأتك، أي طمأنينة وأي سعادة أعظم من ذلك؟",
      "english_content": "Allah says: \"And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation – his reward is [due] from Allah. Indeed, He does not like wrongdoers.\" [Ash-Shura: 40]\n\nListen, dear reader, this verse lays out a precise balance for dealing with harm and anger. Allah first affirms the rule of justice: “And the retribution for an evil act is an evil one like it.” This means if someone wrongs you or harms you, you have the right to respond in kind—no more, no less. This is justice, and no one can blame you for it.\n\nBut the Qur’an doesn’t stop at justice. It opens a greater and more beautiful door: “but whoever pardons and makes reconciliation – his reward is [due] from Allah.” This means if you choose not to retaliate, but instead forgive and even mend the relationship, your right is not lost. Rather, Allah Himself takes responsibility for rewarding you. Notice how the verse phrases it: “his reward is from Allah.” It is left undefined, unrestricted—as if Allah is saying: leave it to Me, I will reward you beyond anything you could imagine.\n\nThen comes the warning: “Indeed, He does not like wrongdoers.” Meaning: while you are permitted to defend yourself, you must never go beyond limits. If you overstep in retaliation, you turn from being the wronged into the wrongdoer, and you fall out of Allah’s love.\n\nIbn Kathir said: “Whoever retaliates within the limits, there is no blame upon him. But whoever forgives and makes things right, his reward is great with Allah.” Al-Tabari explained: “Forgiveness with reconciliation is better than taking retaliation, and its reward is guaranteed by Allah.” Al-Qurtubi said: “The reward of those who forgive is entrusted to Allah Himself, which shows the greatness of their recompense.” And Al-Sa’di added: “This is a mighty promise, that Allah has made the reward of forgiveness and reconciliation a responsibility upon His noble self.”\n\nSo reflect, dear reader: anger may urge you to repay harm, and justice allows it—but greatness lies in forgiveness. When you choose to pardon and seek reconciliation, you are placing your reward directly in Allah’s hands. Imagine: the Lord of the Worlds Himself promises to repay you. What peace, what strength, what happiness could be greater than that?",
      "id": 4
    },
    {
      "title": "الشورى ٤٣ / Ash-Shura 43",
      "verse_text": "يقول الله تعالى",
      "content": "الصبر وحده صعب، والغفران وحده أصعب، فكيف إذا اجتمعا؟ أن تُظلم ثم تصبر فلا تنفجر، وأن تغفر فلا تحمل في قلبك ضغينة، هذا مقام عالٍ من مقامات الإيمان. هو ليس استسلامًا، بل قوة داخلية تمكّنك من السيطرة على نفسك بدل أن تسيطر عليك أهواؤك.\n\nابن كثير قال: أي من صبر على الأذى وغفر لمن أساء، فإن ذلك من مشروعات الأمور ومعالي الأخلاق. والطبري قال: العزم: الحزم والجدّ في الأمور، أي هذا من أشرف ما يعزم عليه أهل الدين. والقرطبي قال: جعل الصبر مع العفو من عزم الأمور، أي من محاسنها ومعاليها، لا من ضعف النفس. والسعدي قال: لأن النفوس مجبولة على الانتقام، فمن صبر وغفر فقد غلب نفسه، وكان من عزم الأمور.\n\nفتأمل يا عزيزي القارئ: الغضب يدفعك للانتقام، والانتقام سهل على النفس، لكن الله يرفعك إلى طريق أصعب وأشرف: أن تصبر وتغفر. هذا الطريق قد يراه الناس ضعفًا، لكن الله يصفه بأنه من \"عزم الأمور\"، أي من أعلى مراتب القوة والإيمان.",
      "english_content": "Allah says: \"And whoever is patient and forgives – indeed, that is of the matters [worthy] of resolve.\" [Ash-Shura: 43]\n\nListen, dear reader, this verse continues the path Allah has drawn for us in moments of anger and injustice. It shows that patience and forgiveness are not weakness, nor are they a retreat. Rather, Allah describes them as “of the matters worthy of resolve”—meaning, they are among the greatest, noblest qualities that only people of strong will and high character can reach.\n\nPatience by itself is difficult, and forgiveness by itself is even harder. But when both come together—when you are wronged and you choose to endure without exploding, and then you forgive without keeping resentment in your heart—that is a station of true strength. It is not surrender, but mastery. It means you control yourself instead of letting anger control you.\n\nIbn Kathir said: “Whoever is patient with harm and forgives the one who wronged him, this is among the prescribed matters and the loftiest of morals.” Al-Tabari explained: “Resolve means firmness and seriousness in affairs—this is among the highest things people of religion commit themselves to.” Al-Qurtubi added: “Allah made patience with forgiveness of the matters of resolve, meaning of the finest and most elevated traits, not a sign of weakness.” And Al-Sa’di said: “Because souls are naturally inclined to revenge, the one who is patient and forgives has overcome himself, and that is of the matters of resolve.”\n\nSo reflect, dear reader: anger urges you to retaliate, and retaliation is the easy path. But Allah calls you to something higher—the difficult yet honorable path of patience and forgiveness. People may see it as weakness, but Allah declares it strength: it is ‘azm al-umoor—the essence of firm resolve, the mark of true greatness in faith and character.",
      "id": 5
    },
    {
      "title": "البقرة ١٠٩ / Al-Baqarah 109",
      "verse_text": "يقول الله تعالى",
      "content": "في مثل هذا الموقف، كان طبيعيًا أن يتحرك الغضب في قلوب المؤمنين، وأن يرغبوا بالرد والانتقام. لكن الله علّمهم درسًا عظيمًا في ضبط الغضب: ﴿فَٱعۡفُواْ وَٱصۡفَحُواْ﴾. العفو: أن تسامح، والصفح: أن تُعرض وتُهمل الأذى فلا تلتفت إليه. ليس الأمر استسلامًا، بل حكمة ربانية تقتضي ضبط النفس في مرحلة معينة، حتى يأتي أمر الله بالنصر والتمكين.\n\nثم يختم بقوله: ﴿إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ﴾، أي أن الله هو القادر على نصركم، فلا تحملوا أنتم العبء كله باندفاع غضبكم. كأن الآية تقول: سلّموا الأمر لله، واسعوا بالصبر والعفو، وسيأتيكم أمر الله في الوقت الذي يريده.\n\nابن كثير قال: أمر الله المؤمنين بالعفو والصفح في بداية الأمر، ثم نسخ ذلك بآيات القتال. والطبري قال: المعنى: تجاوزوا عن أذاهم، ولا تجازوهم حتى يأذن الله لكم. والقرطبي قال: هذا من الحِلم، وهو دواء الغضب في أول الإسلام حتى قويت شوكة المسلمين. والسعدي قال: فيها درس عظيم أن العفو والصفح من أخلاق المؤمنين، وهو سبب لنصر الله وعلو شأنهم.\n\nفتأمل يا عزيزي القارئ: الآية تُعطيك منهجًا في مواجهة الأذى والعداء. أحيانًا يكون الغضب حاضرًا بقوة، لكن الطريق ليس في الانفجار والانتقام، بل في العفو والصفح وانتظار أمر الله. هذا يعلّمك أن ضبط النفس ليس ضعفًا، بل قوة وحكمة، وأن النصر الحقيقي بيد الله القادر على كل شيء.",
      "english_content": "Allah says: \"Many of the People of the Scripture wish they could turn you back to disbelief after you have believed, out of envy from themselves, even after the truth has become clear to them. So pardon and overlook until Allah delivers His command. Indeed, Allah is over all things competent.\" [Al-Baqarah: 109]\n\nListen, dear reader, this verse was revealed in a very sensitive context: when some of the People of the Scripture harbored hostility toward the Muslims even after the truth had become clear to them. Their motive was not ignorance alone, but envy rooted deep within themselves. That envy drove them to wish that the believers would abandon their faith and return to disbelief.\n\nIn such a situation, it was natural for anger to rise in the hearts of the believers, to feel the urge to respond or to retaliate. But Allah taught them a profound lesson in controlling anger: “So pardon and overlook.” Pardon means to forgive, and overlook means to turn away from the offense, to disregard it and not let it consume you. This was not surrender, but divine wisdom: at that stage, Muslims were instructed to restrain themselves until Allah’s command of justice and retribution would come.\n\nThe verse then closes with reassurance: “Indeed, Allah is over all things competent.” In other words, Allah is fully capable of granting victory and delivering justice. You do not have to carry the burden of vengeance through your own anger. Leave it to Allah; He will send His command at the right time.\n\nIbn Kathir explained: “Allah commanded the believers to pardon and overlook in the beginning, then this was later replaced by the verses of fighting.” Al-Tabari said: “The meaning is: overlook their harm, and do not repay them until Allah permits you.” Al-Qurtubi commented: “This was an order of patience and forbearance in the early days of Islam, until the Muslims grew strong.” And Al-Sa’di added: “It is a great lesson: pardon and overlooking are among the traits of believers, and a reason for Allah’s support and their eventual victory.”\n\nSo reflect, dear reader: this verse gives you a method for dealing with hostility and anger. Sometimes the impulse to retaliate feels overwhelming, but the higher path is to forgive, overlook, and wait for Allah’s command. This teaches you that true strength is not in unleashing anger, but in restraining it with wisdom—and entrusting the final outcome to Allah, the One who is competent over all things.",
      "id": 6
    },
    {
      "title": "الحجر ٨٥ / Al-Hijr 85",
      "verse_text": "يقول الله تعالى",
      "content": "ثم يذكّرك بيقين المصير: ﴿وَإِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞ﴾، القيامة قادمة لا محالة، وسيقف كل إنسان ليحاسَب على ما فعل. هذه الحقيقة وحدها كافية لتسكّن غضبك، لأنك تدرك أن الحكم العادل مؤجَّل ليوم لا يظلم الله فيه أحدًا.\n\nبعد هذا التمهيد يأتي التوجيه المباشر: ﴿فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِيلَ﴾. ليس أي صفح، بل الصفح الجميل، وهو العفو الخالص من الحقد، الصفح الذي لا يعقبه منّ ولا أذى، الصفح الذي يجمع بين ضبط الغضب ونقاء القلب. كأن الله يقول: إذا تذكرت أن الكون لم يُخلق باطلًا، وأن الساعة قادمة، فدواؤك في مواجهة الغضب والظلم أن تعفو عفوًا جميلاً يليق بكرامة المؤمن.\n\nابن كثير قال: هذا تسلية للنبي ﷺ فيما يلقاه من أذى المشركين، يأمره أن يصفح عنهم صفحًا جميلاً حتى يأتي أمر الله. والطبري قال: الصفح الجميل: أن تعفو بغير عتاب ولا منّ. والقرطبي قال: الصفح الجميل هو الذي لا أذى معه في القول ولا في الفعل. والسعدي قال: أي أعرض عنهم إعراضًا جميلاً، لا يعقبه عقوبة ولا تأنيب، فهذا من مكارم الأخلاق.\n\nفتأمل يا عزيزي القارئ: القرآن يربط علاج الغضب بعمق الإيمان. إذا علمت أن الله خلق بالحق، وأن الساعة آتية، لن يشتعل غضبك طلبًا للانتقام العاجل، بل ستطمئن نفسك لتصفح الصفح الجميل، وتترك الحساب لله العادل الذي لا ينسى شيئًا.",
      "english_content": "Allah says: \"And We did not create the heavens and the earth and what is between them except in truth. And indeed, the Hour is coming; so forgive with gracious forgiveness.\" [Al-Hijr: 85]\n\nListen, dear reader, this verse weaves together the grandeur of creation, the certainty of destiny, and the remedy for anger. Allah begins by reminding you: “And We did not create the heavens and the earth and what is between them except in truth.” Meaning, this universe was not created in vain. It was built upon justice, wisdom, and truth. So never think that the harm of the wrongdoer or the cruelty of the oppressor will pass unnoticed.\n\nThen He grounds your heart in certainty: “And indeed, the Hour is coming.” The Day of Judgment is inevitable. Every soul will stand before Allah, and justice will be served perfectly. This reality alone is enough to calm your anger, because you know that ultimate fairness is guaranteed—if not today, then on that day when no one is wronged.\n\nAfter laying down this foundation, Allah directs you: “So forgive with gracious forgiveness.” Not just any forgiveness, but gracious forgiveness—a forgiveness free of resentment, without bitterness or reproach. It is the kind of forgiveness that springs from strength and dignity, not from weakness. It is a way of restraining anger while keeping your heart pure. It means to forgive and move on, leaving the matter in Allah’s hands.\n\nIbn Kathir said: “This was consolation for the Prophet ﷺ in facing the harm of the disbelievers, instructing him to forgive them with gracious forgiveness until Allah’s command came.” Al-Tabari explained: “Gracious forgiveness is to pardon without reproach or harm.” Al-Qurtubi said: “It is forgiveness that carries no blame, neither in word nor in deed.” And Al-Sa’di added: “It means to turn away from them with a beautiful turning, free of punishment or scolding—this is among the noble traits of character.”\n\nSo reflect, dear reader: the Qur’an ties the cure for anger to the depth of faith. When you realize that creation itself is grounded in truth, and that the Hour is inevitably approaching, you no longer need to let anger consume you with the thirst for immediate revenge. Instead, you find peace in forgiving with gracious forgiveness—leaving the final judgment to Allah, the Just, who forgets nothing and wrongs no one.",
      "id": 7
    },
    {
      "title": "الأعراف ١٩٩ / Al-A‘raf 199",
      "verse_text": "يقول الله تعالى",
      "content": "ثم قال: ﴿وَأۡمُرۡ بِٱلۡعُرۡفِ﴾، أي اجعل دعوتك وأمرك للناس بما هو معروف ومستحسن في الشرع والعقل والفطرة، ادعُ إلى الخير باللين والحكمة، لا بالفظاظة والغضب.\n\nثم ختم بقوله: ﴿وَأَعۡرِضۡ عَنِ ٱلۡجَـٰهِلِينَ﴾. والجهال هم الذين يُثيرون غضبك بسفههم أو بجهلهم، فدواؤك معهم أن تُعرض عنهم، لا أن تنزل إلى مستواهم، ولا أن تُشعل قلبك بجدالهم.\n\nابن كثير قال: هذه الآية جامعة لمكارم الأخلاق، أمر الله فيها بالعفو، والصفح عن المسيء، وفعل المعروف، والإعراض عن الجاهل الغليظ الطبع. والطبري قال: خذ العفو: خذ ما عفا لك من أخلاق الناس، وما سهل، ولا تكلفهم ما يشق عليهم. والقرطبي قال: هي من ثلاث كلمات جمعت الأخلاق كلها: خذ العفو، وأمر بالعرف، وأعرض عن الجاهلين. والسعدي قال: هذه الآية فيها جماع حسن الخلق مع الناس: العفو عمن ظلمك، وفعل الخير، والإعراض عن من سفه عليك.\n\nفتأمل يا عزيزي القارئ: الآية تجعل لك ثلاثة مفاتيح حين يهيج الغضب في قلبك: خذ العفو فلا تشدد على الناس، وأمر بالعرف فليكن لسانك بالخير، وأعرض عن الجاهلين فلا تنشغل بردودهم. بهذا تُطفئ نار الغضب، وتعيش صفاء القلب الذي يحبه الله.",
      "english_content": "Allah says: \"Show forgiveness, enjoin what is good, and turn away from the ignorant.\" [Al-A‘raf: 199]\n\nListen, dear reader, this verse is one of the most comprehensive pieces of advice Allah revealed to His Prophet ﷺ, and in truth, it is a complete code of conduct for dealing with people—and a healing remedy for anger. Allah says first: “Show forgiveness”—meaning, make forgiveness your habit. Do not burden people by demanding perfection from them. Accept what is easy from their manners and actions, and let go of their slips. Here, forgiveness is not only pardoning someone when they wrong you, but also widening your heart, being lenient, and embracing people as they are.\n\nThen Allah says: “Enjoin what is good.” This means to direct people toward what is recognized as good in the law, in reason, and in pure human nature. Call them to righteousness with kindness, wisdom, and gentleness—not with harshness or anger.\n\nAnd finally: “Turn away from the ignorant.” The ignorant are those who provoke you with their foolishness, mockery, or arrogance. The divine command here is not to lower yourself to their level, nor to let your heart burn with their provocations. Instead, turn away gracefully, without wasting your energy in pointless quarrels.\n\nIbn Kathir said: “This verse gathers together the finest manners: Allah commands forgiveness, doing good, and turning away from the foolish and harsh.” Al-Tabari explained: “Take what comes easily from people’s character and dealings, and do not make things hard for them.” Al-Qurtubi said: “In just three words, Allah gathered all of good character: take forgiveness, command what is right, and turn away from the ignorant.” And Al-Sa’di added: “This verse contains the foundation of good conduct: forgive those who wrong you, do good to others, and turn away from those who treat you with foolishness.”\n\nSo reflect, dear reader: this verse gives you three keys to extinguishing anger. First, forgive and don’t be severe with people. Second, keep your tongue busy with what is good. And third, ignore the ignorant and do not let their behavior disturb your peace. By doing so, you disarm your anger and live with a heart at ease—exactly the kind of character that Allah loves.",
      "id": 8
    },
    {
      "title": "الرعد ٢٨ / Ar-Ra‘ad 28",
      "verse_text": "يقول الله تعالى",
      "content": "ثم يؤكد المعنى بأداة تنبيه قوية: ﴿أَلَا﴾، كأنه يقول انتبه جيدًا، هذه هي الحقيقة الكبرى: ﴿بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ﴾. القلوب بطبيعتها مضطربة، سريعة الانفعال، مشتعلة بالغضب أو القلق أو الحزن، ولا شيء يسكّنها بحق إلا ذكر الله. الذكر هنا أوسع من التسبيح والتهليل، هو كل تواصل حي مع الله: قراءة القرآن، الصلاة، الدعاء، الاستغفار.\n\nابن كثير قال: أي لا يطمئن أحد بغير ذكر الله، وهو الذي يشرح الصدور وينير القلوب. والطبري قال: المراد بذكر الله: القرآن، والقلوب لا تهدأ إلا به. والقرطبي قال: الطمأنينة: السكون وزوال الاضطراب، ولا يسكن القلب إلا بالإيمان بالله وذكره. والسعدي قال: ذكر الله يطمئن القلب من الخوف، ويملؤه سرورًا، ويزيل عنه القلق والاضطراب.\n\nفتأمل يا عزيزي القارئ: كم مرة حاولت أن تهدّئ غضبك بكلمة أو بفعل ولم ينجح؟ هنا يقول لك الله: العلاج الحقيقي هو أن تذكره. حين يشتعل صدرك غضبًا، اذكر الله، وسترى كيف يسكن قلبك. لأنك تعود إلى مصدر القوة والرحمة في الكون كله.",
      "english_content": "Allah says: \"Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured.\" [Ar-Ra‘ad: 28]\n\nListen, dear reader, this verse is one of the deepest revelations about inner peace when anger flares inside you or when your heart trembles with anxiety. Allah describes the believers: “Those who have believed”—they trusted in Him and followed His guidance. Then He explains the fruit of that faith: “and whose hearts are assured by the remembrance of Allah.” This assurance is not just a passing calm, but a profound inner stability, a serenity that extinguishes the fire of anger and quiets the storms of the soul.\n\nThen the verse emphasizes with a powerful call to attention: “Unquestionably, by the remembrance of Allah hearts are assured.” The nature of the human heart is restlessness—it is quick to anger, easily shaken by fear, stirred by grief. Nothing can truly soothe it except the remembrance of Allah. And remembrance here is broader than repeating words of praise—it is every living connection with Allah: reciting the Qur’an, prayer, supplication, seeking forgiveness, turning to Him with your heart.\n\nIbn Kathir said: “No one finds assurance except through the remembrance of Allah; it is what expands the chest and enlightens the heart.” Al-Tabari explained: “The remembrance of Allah here is the Qur’an, and hearts cannot find rest except through it.” Al-Qurtubi said: “Assurance means calmness and the removal of disturbance, and the heart cannot be calmed except by faith in Allah and His remembrance.” And Al-Sa’di added: “The remembrance of Allah soothes the heart from fear, fills it with joy, and removes anxiety and agitation.”\n\nSo reflect, dear reader: how many times have you tried to calm your anger with words or distractions and found no relief? Here Allah tells you the true cure: remember Him. When your chest burns with rage, when your mind is restless, call upon Allah—and you will see how your heart settles, because you are returning to the Source of all strength, mercy, and peace.",
      "id": 9
    },
    {
      "title": "الفرقان ٦٣ / Al-Furqan 63",
      "verse_text": "يقول الله تعالى",
      "content": "لكن الأجمل هو موقفهم عند الاحتكاك بالناس: ﴿وَإِذَا خَاطَبَهُمُ ٱلۡجَـٰهِلُونَ قَالُواْ سَلَـٰمٗا﴾. يعني حين يواجهون سفاهة الجاهل، أو يستفزهم بجهله وكلماته الجارحة، لا يردون عليه بغلظة، ولا ينزلون إلى مستواه، بل يردون بكلمة سلام، إما قولًا: \"سلام عليكم\"، أو فعلًا: بالسكوت والإعراض. أي أنهم يختارون السلام طريقًا، بدل أن يسمحوا للغضب أن يسيطر عليهم.\n\nابن كثير قال: يمشون هونًا أي بسكينة ووقار، وإذا خاطبهم الجاهلون قالوا قولًا يسلمون فيه من الإثم. والطبري قال: سلامًا: قولًا معروفًا لا جهل فيه ولا فحش. والقرطبي قال: المعنى أنهم لا يكافئون السفهاء بسفههم، بل يعفون ويصفحون. والسعدي قال: هذه أعلى مراتب كظم الغيظ، أن يقابل العبد السفه بالصفح، والإساءة بالإحسان.\n\nفتأمل يا عزيزي القارئ: الغضب عادةً يُشعل فيك الرغبة في الردّ والمجادلة، لكن عباد الرحمن عندهم خيار آخر: أن يردّوا بالسلام، أو أن يكتفوا بالإعراض. هذه ليست ضعفًا، بل قوة حقيقية، لأنها تعني أنك سيد نفسك، لا أسير استفزاز الآخرين.",
      "english_content": "Allah says: \"And the servants of the Most Merciful are those who walk upon the earth humbly, and when the ignorant address them, they say [words of] peace.\" [Al-Furqan: 63]\n\nListen, dear reader, this verse describes a class of people whom Allah has honored by attributing them directly to Himself: “the servants of the Most Merciful.” This is a title of the highest nobility. Their first quality is that they “walk upon the earth humbly.” It means with modesty and calmness—not with arrogance, pride, or harshness. Even their outward movement reflects the serenity of their hearts.\n\nBut the most beautiful quality is how they deal with provocation: “and when the ignorant address them, they say [words of] peace.” When confronted by the foolish, when insulted or provoked, they do not respond with harshness or descend to the same level. Instead, they choose peace—either by literally saying, “Peace be upon you,” or by keeping silent and turning away. Their answer is not anger but dignity, not retaliation but self-control.\n\nIbn Kathir said: “They walk with tranquility and dignity, and when addressed by the ignorant, they reply with words that keep them safe from sin.” Al-Tabari explained: “Peace means words of goodness, free of ignorance or abuse.” Al-Qurtubi added: “They do not repay foolishness with foolishness, but rather they forgive and overlook.” And Al-Sa’di said: “This is the highest form of restraining anger—that a person responds to foolishness with forgiveness and to harm with kindness.”\n\nSo reflect, dear reader: anger usually pushes you to reply, to fight back, to defend your pride. But the servants of the Most Merciful have a different choice: they respond with peace. This is not weakness, but true strength—because it means you are the master of your own self, not a prisoner of others’ provocations.",
      "id": 10
    },
    {
      "title": "الأعراف ٢٠٠ / Al-A‘raf 200",
      "verse_text": "يقول الله تعالى",
      "content": "والله سبحانه يعطيك العلاج المباشر: ﴿فَٱسۡتَعِذۡ بِٱللَّهِ﴾. أي التجئ إلى الله فورًا، قل: \"أعوذ بالله من الشيطان الرجيم\"، استحضر معية الله ورعايته. لأنك لو واجهت نزغ الشيطان بقوتك وحدك ضعفت، أما إذا احتميت بالله، فقد احتميت بالقوي العزيز.\n\nثم طمأن قلبك بقوله: ﴿إِنَّهُۥ سَمِيعٌ عَلِيمٌ﴾. يسمع دعاءك واستعاذتك، ويعلم ما في قلبك من اضطراب وغضب. فاستعانتك به ليست كلمات فارغة، بل استجابة مضمونة من رب يسمعك ويعلم حالك.\n\nابن كثير قال: إذا أحسست بوسوسة الشيطان ووساوسه فأقبل على الله واستعذ به، فإنه سميع عليم. والطبري قال: النزغ: الوسوسة والإغراء بالغضب، فأمر الله نبيه بالاستعاذة عنده. والقرطبي قال: هذا دليل على أن دواء الغضب ذكر الله والاستعاذة به. والسعدي قال: من أعظم ما يدفع وساوس الشيطان ونزغاته الاستعاذة بالله، فهي حرز حصين.\n\nفتأمل يا عزيزي القارئ: الغضب حين يشتعل قد تظنه من نفسك، لكنه في حقيقته سهم من الشيطان يريد أن يوقعك في كلمة أو فعل تندم عليه. والدواء ليس أن تكتمه فقط، بل أن ترفع رأسك إلى السماء وتقول: أعوذ بالله من الشيطان الرجيم. عندها ينطفئ النزغ، ويعود قلبك إلى سكينته.",
      "english_content": "Allah says: \"And if an evil suggestion comes to you from Satan, then seek refuge in Allah. Indeed, He is Hearing and Knowing.\" [Al-A‘raf: 200]\n\nListen, dear reader, this verse pinpoints the deep root of anger: much of it is a provocation from Satan. The word “suggestion” (نزغ) means a prick, a push, a sudden stirring. Satan cannot force you, but he whispers, he nudges, he provokes a spark of rage inside you—and if you give in, that spark can become a fire.\n\nAllah gives you the direct cure: “then seek refuge in Allah.” The moment you feel that surge, turn immediately to Allah. Say: “I seek refuge in Allah from the accursed Satan.” This is not just a phrase—it is taking shelter under the protection of the Almighty. On your own, your defenses are weak; but when you take refuge in Allah, you stand under the guard of the All-Powerful.\n\nThen Allah reassures your heart: “Indeed, He is Hearing and Knowing.” He hears your words of refuge, and He knows the turmoil in your heart, the fire that is trying to consume you. So your plea is not lost—it is met with the care of a Lord who hears and knows everything.\n\nIbn Kathir said: “When you sense Satan’s whispering and provocations, turn to Allah and seek refuge in Him, for He is Hearing and Knowing.” Al-Tabari explained: “The suggestion is Satan’s incitement to anger; Allah commanded His Prophet to seek refuge when it comes.” Al-Qurtubi said: “This verse shows that the cure for anger is the remembrance of Allah and seeking refuge in Him.” And Al-Sa’di added: “Among the greatest means to repel Satan’s whispers and provocations is seeking refuge in Allah—it is a fortified shield.”\n\nSo reflect, dear reader: when anger rises, you may think it is just your own emotion, but often it is a dart from Satan, aiming to make you speak or act in regret. The cure is not only to hold it back, but to lift your heart and tongue to Allah, saying: “I seek refuge in Allah from Satan.” At that moment, the whisper dies down, the spark is extinguished, and your heart regains its peace.",
      "id": 11
    },
    {
      "title": "فصلت ٣٤ / Fussilat 34",
      "verse_text": "يقول الله تعالى",
      "content": "ثم يعطيك المنهج: ﴿ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ﴾. يعني إذا واجهك أحد بالسيئة، لا تردها بمثلها، بل ادفعها بما هو أحسن: بكلمة طيبة، بعفو، بحلم، بمعاملة أرقى من مستوى الإساءة. هذه ليست سهلًا على النفس، لكنها أقوى سلاح يطفئ نار الغضب ويحوّل العداوة إلى محبة.\n\nثم تأتي البشارة: ﴿فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَاوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ﴾. أي أنك إذا التزمت هذا النهج، سيحدث انقلاب في العلاقة. قد يتحول خصمك الذي كان يثير غضبك إلى صديق مقرّب، كأن العداوة ذابت وانقلبت إلى مودة. وهذا لا يحصل إلا حين يرتقي الإنسان فوق ردود أفعال الغضب، ويختار الحلم والإحسان.\n\nابن كثير قال: أي إذا أحسنت إلى من أساء إليك، قادته المحبة إليك حتى يصير كأنه قريب حميم. والطبري قال: ادفع بالتي هي أحسن: ادفع إساءته إليك بإحسانك إليه. والقرطبي قال: هذا من أشرف أخلاق المؤمنين: مقابلة الشر بالخير، والجهل بالحلم. والسعدي قال: هذه أعظم وسيلة لدفع العداوة، وهو أن تحسن إلى من أساء إليك، وتعفو عمّن ظلمك.\n\nفتأمل يا عزيزي القارئ: الغضب عادةً يدفعك أن ترد بالمثل، لكن القرآن يرفعك إلى مقام أعلى: أن ترد بالإحسان. ليس فقط لتكسب قلب من أمامك، بل لتربّي قلبك أنت، وتطهّره من ثقل الغضب والحقد. هذا هو الطريق الذي يحوّل الأعداء إلى أصدقاء، ويحوّل نفسك من الانفعال إلى الطمأنينة.",
      "english_content": "Allah says: \"And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he were a devoted friend.\" [Fussilat: 34]\n\nListen, dear reader, this verse offers you an extraordinary remedy for anger and hostility. Allah begins with a clear truth: “And not equal are the good deed and the bad.” Good and evil can never be the same—not in worth, not in outcome, not in the effect they leave behind.\n\nThen Allah gives you a method: “Repel [evil] by that [deed] which is better.” Meaning, when someone confronts you with harm or insult, don’t reply with the same. Instead, respond with something better: a kind word, forgiveness, patience, or an act of goodness. This is not easy on the soul, but it is the strongest weapon to extinguish the fire of anger and to dissolve enmity.\n\nAnd then comes the promise: “and thereupon the one whom between you and him is enmity [will become] as though he were a devoted friend.” When you choose the higher path, you might witness a transformation. The very person who was your enemy, who provoked your anger, may soften and turn into a close companion. This is the power of goodness—it flips hearts and breaks down the walls of hostility.\n\nIbn Kathir said: “If you show goodness to the one who wronged you, it will draw him closer until he becomes like a dear friend.” Al-Tabari explained: “Repel his harm against you by showing him kindness.” Al-Qurtubi said: “This is among the noblest traits of the believers: to counter evil with good, and ignorance with patience.” And Al-Sa’di added: “This is the greatest way to end enmity: to do good to the one who harmed you and to forgive the one who wronged you.”\n\nSo reflect, dear reader: anger tells you to strike back, to retaliate equally. But the Qur’an lifts you to a higher station: respond with what is better. Not only will this purify your own heart from resentment, it may even turn your enemy into a friend. This is the secret path from conflict to peace, from anger to tranquility.",
      "id": 12
    },
    {
      "title": "الإسراء ٥٣ / Al-Isra 53",
      "verse_text": "يقول الله تعالى",
      "content": "ثم يوضح السبب: ﴿إِنَّ ٱلشَّيۡطَـٰنَ يَنزَغُ بَيۡنَهُمۡ﴾. الشيطان دائمًا يتربص بكلماتنا لينفخ فيها نزغًا، يحرّك الغضب والعداوة بين القلوب. ربما كلمة عابرة تُفسَّر بسوء، فتتحول إلى شقاق وبغضاء. لذلك كان الحل أن ننتقي دائمًا \"التي هي أحسن\"، أي أطيب وأصلح ما نستطيع من الكلام.\n\nويختم الآية بالتحذير: ﴿إِنَّ ٱلشَّيۡطَـٰنَ كَانَ لِلۡإِنسَـٰنِ عَدُوّٗا مُّبِينٗا﴾. الشيطان ليس مجرد عدو خفي، بل عدو ظاهر العداوة، همه الأكبر أن يوقع بين الناس بالخصام والبغضاء، وأسرع طريق لذلك هو الكلمة في ساعة غضب.\n\nابن كثير قال: يأمر تعالى عباده المؤمنين أن يقولوا الأحسن من الكلام، فإذا واجههم الجاهل بجهله قابلوه بالحلم واللين. والطبري قال: المعنى قولوا القول الطيب، فإن الشيطان يحرّك الشر بالكلام الرديء. والقرطبي قال: هذه الآية أصل في وجوب حفظ اللسان من فحش القول في حال الغضب. والسعدي قال: الله أمر بانتقاء الألفاظ الطيبة، لأن الشيطان يستغل الكلام السيئ لإيقاع العداوة.\n\nفتأمل يا عزيزي القارئ: كم مرة كان الغضب يشتعل بسبب كلمة، ولو كانت صغيرة؟ هنا يعطيك الله المفتاح: إذا أردت أن تحمي نفسك من نزغ الشيطان، اجعل لسانك لا ينطق إلا بالتي هي أحسن. فهي صمام الأمان للقلب، ودواء الغضب، وسبب الألفة بينك وبين الناس.",
      "english_content": "Allah says: \"And tell My servants to say that which is best. Indeed, Satan induces discord among them. Indeed Satan is ever, to mankind, a clear enemy.\" [Al-Isra: 53]\n\nListen, dear reader, this verse speaks directly about controlling the tongue in moments of anger, for words are often the spark that ignites enmity. Allah commands His Prophet ﷺ: “Tell My servants to say that which is best.” Meaning: when they speak, they should choose the finest words, the gentlest phrases, the kindest expressions. A word can either fuel the fire of anger or act like water to extinguish it.\n\nThen Allah explains the reason: “Indeed, Satan induces discord among them.” Satan constantly lurks around human speech, looking for an opportunity to inject his provocation. He takes a careless word, a sharp reply, or a harsh tone, and magnifies it until it becomes a quarrel, resentment, or a broken bond. That is why Allah urges us to always say what is best, so that we cut off Satan’s path before he can stir division.\n\nThe verse closes with a warning: “Indeed Satan is ever, to mankind, a clear enemy.” He is not a neutral force but a sworn enemy, obvious in his intent, with one of his strongest tools being words exchanged in anger. Through them, he plants hatred and discord.\n\nIbn Kathir said: “Allah commands His believing servants to speak with the best words; if a foolish one addresses them harshly, they respond with gentleness and patience.” Al-Tabari explained: “Say what is good, for Satan stirs up evil through bad speech.” Al-Qurtubi added: “This verse is a foundation for guarding the tongue against foul words, especially in anger.” And Al-Sa’di said: “Allah commanded the choosing of the best words, because Satan exploits bad speech to spread enmity.”\n\nSo reflect, dear reader: how many times has anger been fueled by just a word, even a small one? Allah gives you the key here: protect your heart from Satan’s whisper by guarding your tongue. Make your words always the best—they are the shield against anger, the medicine for discord, and the bond of peace between you and others.",
      "id": 13
    },
    {
      "title": "الأنبياء ٨٧ / Al-Anbiya 87",
      "verse_text": "يقول الله تعالى",
      "content": "قال الله: ﴿فَظَنَّ أَن لَّن نَّقۡدِرَ عَلَيۡهِ﴾، أي حسب أن الله لن يضيّق عليه، وليس بمعنى أنه أنكر قدرة الله، حاشاه، بل المعنى ظن أن الله لن يحاسبه على استعجاله.\n\nفلما وقع في بطن الحوت، ونزلت عليه الظلمات: ظلمة الليل، وظلمة البحر، وظلمة بطن الحوت، أدرك حقيقة ضعفه، وصرخ من أعماق قلبه: ﴿أَن لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبۡحَـٰنَكَ إِنِّي كُنتُ مِنَ ٱلظَّـٰلِمِينَ﴾. هذا الدعاء العظيم جمع التوحيد والتنزيه والاعتراف بالذنب.\n\nابن كثير قال: ذهب مغاضبًا أي غضب على قومه لعدم استجابتهم، وظن أن لن نقدر عليه أي لن نضيّق عليه، فنادى في الظلمات بهذا الدعاء، ففرّج الله عنه. والطبري قال: معنى نقدر: نضيّق، وليس من القدرة، بل من القدر بمعنى التضييق. والقرطبي قال: هذا الدعاء من أنجى الأدعية، فيه توحيد وإخلاص واعتراف بالخطأ. والسعدي قال: هذه الكلمات هي مفتاح الفرج، وهي أعظم ما يدعو به المكروب.\n\nفتأمل يا عزيزي القارئ: الغضب قد يقود حتى نبيًّا كريمًا إلى استعجال الأمر، لكن المخرج دائمًا هو الرجوع إلى الله، بكلمة التوحيد والاستسلام: \"لا إله إلا أنت، سبحانك، إني كنت من الظالمين\". فإذا اشتعل غضبك أو أحاط بك كربك، فاذكر دعاء يونس، فهو مفتاح الفرج ودواء الغضب والهم.",
      "english_content": "Allah says: “And [mention] the man of the fish (Jonah), when he went off in anger and thought that We would not decree [anything] upon him. And he called out within the darknesses, ‘There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.’” [Al-Anbiya: 87]\n\nListen, my dear reader, this verse tells the story of the Prophet of Allah, Yunus (Jonah), peace be upon him, who is called “the man of the fish.” He left his people in anger—not anger for himself, but because they rejected the truth he brought and insisted on denial. His heart became heavy with their stubbornness, and he went out before Allah gave him permission to do so.\n\nAllah then says: “and thought that We would not decree upon him”—this does not mean he denied Allah’s power, far from that. Rather, it means he thought Allah would not restrict or hold him accountable for leaving early. But Allah wanted to teach him, and through him to teach us, a great lesson.\n\nSo when Yunus found himself swallowed by the whale, wrapped in layers of darkness—the darkness of the night, the darkness of the sea, and the darkness of the whale’s belly—he realized his weakness. From the depths of that darkness, he raised his voice with one of the greatest supplications ever uttered: “There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.”\n\nIbn Kathir said: “He left in anger at his people’s disbelief, and thought Allah would not restrict him for this. So he called out in the darknesses, and Allah relieved him through this supplication.” Al-Tabari explained: “‘We would not decree’ means We would not restrict, not that he denied Allah’s power.” Al-Qurtubi added: “This supplication is among the most effective for relief; it combines pure monotheism, glorification, and admission of fault.” And Al-Sa‘di said: “These words are the key to relief, and among the greatest calls of the distressed.”\n\nSo reflect, dear reader: anger, even when it comes from zeal for truth, can push a person—even a noble prophet—to act in haste. But the way back is always through humility, confession, and remembrance of Allah. Whenever your anger flares or troubles surround you, hold onto the words of Yunus: “La ilaha illa Anta, Subhanaka, inni kuntu min al-zalimin.” They are a rope of light in the darkness of anger and hardship.",
      "id": 14
    },
    {
      "title": "القصص ٥٤ / Al-Qasas 54",
      "verse_text": "يقول الله تعالى",
      "content": "قال ابن عباس: “يعني يؤتون أجرهم مرتين: بإيمانهم بالإنجيل وبمحمد ﷺ.” وقال مجاهد: “هم قوم من أهل الكتاب آمنوا بنبيهم ثم آمنوا بمحمد ﷺ.” وهذا المعنى يفتح لك بابًا لفهمٍ واسع: أن من صبر على اتباع الحق في كل زمان، وصدق الرسل جميعًا، فإن الله يضاعف له الجزاء.\n\nثم بيّن الله صفاتهم: ﴿وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ﴾، أي أنهم إذا قابلوا أذًى أو إساءة، لا يردّونها بمثلها، بل يقابلونها بالإحسان، بالصفح والعفو، بالكلمة الطيبة والفعل الجميل. وهذه صفة عظيمة لا يقدر عليها إلا من امتلأ قلبه نورًا ورضا. قال السعدي: “يدفعون السيئة بالتي هي أحسن، من العفو عن المسيء، والإحسان إلى من أساء، واللين مع الغليظ.”\n\nوزادهم الله شرفًا بقوله: ﴿وَمِمَّا رَزَقۡنَـٰهُمۡ يُنفِقُونَ﴾، فهم لا يكتفون بالإيمان والصبر وكظم الغيظ، بل ينفقون مما أعطاهم الله في سبيل الخير، يجمعون بين صلاح القلب وصلاح العمل وصلاح المال.\n\nتأمل يا عزيزي القارئ: الله يعدهم بالأجر مضاعفًا، لا لأنهم عبدوه فقط، بل لأنهم صبروا. الصبر على الإيمان، الصبر على الأذى، الصبر على مقابلة الإساءة بالإحسان، والصبر على بذل المال. وكأن الآية تقول لك: إن أردت أجرًا عظيمًا وسعادة حقيقية، فاملك نفسك عند الغضب، وادفع الشر بالخير، ولا تبخل بما رزقك الله.",
      "english_content": "Allah says: “Those will be given their reward twice for what they patiently endured, and they repel evil with good, and spend from what We have provided them.” [Al-Qasas: 54]\n\nListen, dear reader, this verse describes a noble group of people whom Allah has honored. They are those who believed in the truth when it came to them. They first believed in the revelation that was sent to them, then when a new revelation came, they believed again. Their faith was not bound to time or place, but to the truth itself. For this reason, Allah says: “They will be given their reward twice”—because they carried two burdens of faith, and endured two kinds of patience.\n\nIbn Abbas said: “They are given their reward twice: for believing in the Gospel and for believing in Muhammad ﷺ.” Mujahid explained: “They are the People of the Book who believed in their prophet, then believed in Muhammad ﷺ.” So the meaning is vast: whoever embraces truth when it comes, and does not close his heart to new light, Allah will multiply his reward.\n\nThen Allah highlights their character: “and they repel evil with good.” When they face harm or insult, they do not respond with anger or revenge. Instead, they respond with patience, forgiveness, and kindness. This is not weakness but strength, for only a heart filled with light and tranquility can rise above anger. As Al-Sa‘di said: “They repel the evil with that which is better: forgiving the wrongdoer, showing kindness to the offender, and meeting harshness with gentleness.”\n\nAnd Allah adds: “and spend from what We have provided them.” Their goodness is not limited to faith and patience, but extends to generosity. They share their wealth, recognizing it as a trust from Allah, and use it to support others and spread goodness.\n\nSo, dear reader, see how Allah praises them: faith that renews with every truth, patience that endures every trial, mercy that answers anger with kindness, and generosity that turns blessings into charity. For such people, Allah promises a double reward and a life filled with dignity and honor.\n\nWould you like me to continue in this same heartfelt tone for the next verses of anger-related feelings, just like we did here?",
      "id": 15
    },
    {
      "title": "طه ١٣٠ / Taha 130",
      "verse_text": "يقول الله تعالى",
      "content": "ثم وجّه الله إلى الدواء الروحي: ﴿وَسَبِّحۡ بِحَمۡدِ رَبِّكَ﴾. التسبيح والحمد ليسا مجرد ألفاظ، بل هما شفاء للقلب من ثقل الغضب والحزن. فإذا أُسيء إليك، سبح الله واحمده، فإن ذلك يملأ قلبك طمأنينة ويغسله من آثار الكلمة المؤذية.\n\nوجعل الله لذلك أوقاتًا محددة: ﴿قَبۡلَ طُلُوعِ ٱلشَّمۡسِ﴾ أي صلاة الفجر وما قبلها من ذكر، ﴿وَقَبۡلَ غُرُوبِهَا﴾ أي صلاة العصر وما يقاربها، ﴿وَمِنۡ ءَانَآءِ ٱلَّيۡلِ﴾ أي ساعاته، خصوصًا صلاة الليل التي تُنقي القلب وتمنحه نورًا، ﴿وَأَطۡرَافَ ٱلنَّهَارِ﴾ أي أوائله وأواخره. الذكر موزع على اليوم ليبقى قلب المؤمن متوازنًا، محاطًا بسياج من السكينة.\n\nأما الخاتمة فهي بلسـم: ﴿لَعَلَّكَ تَرۡضَىٰ﴾. أي أن ثمرة هذا الصبر والتسبيح ليست فقط النجاة من الغضب، بل أن يرضى قلبك رضا عميقًا بما قسم الله، فلا يعود يضطرب من أقوال الناس ولا يستفزّه الباطل.\n\nقال ابن كثير: “أي اصبر على أذى قومك، وأكثر من التسبيح والعبادة، لعلك ترضى في الدنيا والآخرة.” وقال الطبري: “معنى لعلّك ترضى: ترضى بثواب الله لك وكرامته إياك.” وقال السعدي: “أي اجعل رضاك في ذكر ربك وتسبيحه، ففيه راحة قلبك وسكون نفسك.”\n\nفتأمل يا عزيزي القارئ، كيف أن هذه الآية تعلّمك أن الغضب والضيق لا يُعالَجان بالانتقام أو الجدال، بل باللجوء إلى الله، بالصبر والتسبيح. فإذا امتلأ قلبك بحمد الله، صغرت عندك كلمات الناس، وزال عنك الغضب، وحلّ محله الرضا والطمأنينة.",
      "english_content": "Allah says: “So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting; and [also] glorify Him during periods of the night and at the ends of the day, that you may be satisfied.” [Taha: 130]\n\nListen, dear reader. This verse was revealed to console and strengthen the Prophet ﷺ in the face of the words of the deniers and mockers. Allah tells him: “So be patient over what they say”—do not let their harsh words wound your heart or shake your soul, for words cannot harm a believer whose heart is anchored to his Lord. The remedy here is patience, a patience born of certainty that truth will triumph and falsehood will perish.\n\nThen Allah directs him to the real cure: “and exalt [Allah] with praise of your Lord.” Glorifying and praising Allah is not just uttering words; it is a cleansing of the heart from the weight of anger and grief. When people offend you, glorify Allah and thank Him. This fills your heart with serenity and washes away the sting of hurtful speech.\n\nAllah also appointed specific times for this: “before the rising of the sun”—the dawn prayer and its remembrance, “and before its setting”—the afternoon prayer and its time, “during periods of the night”—the hours of the night, especially the night prayer that purifies the heart, and “at the ends of the day”—its beginnings and endings. Spreading remembrance across the day ensures the believer’s heart remains balanced, wrapped in tranquility.\n\nAnd the verse concludes with a balm: “that you may be satisfied.” The outcome of patience and glorification is not merely freedom from anger, but deep contentment—your heart finding rest in God’s decree, untouched by people’s words, and free from the grip of anger.\n\nIbn Kathir said: “Be patient with the harm of your people, and increase in glorification and worship, so that you may be pleased in this life and the Hereafter.” Al-Tabari said: “That you may be satisfied means: satisfied with God’s reward and His honor for you.” Al-Sa‘di said: “Let your satisfaction be found in the remembrance and glorification of your Lord, for in it lies the comfort of your heart and the peace of your soul.”\n\nSo reflect, dear reader, how this verse teaches you that anger and distress are not cured by retaliation or endless debate, but by turning to Allah with patience and remembrance. When your heart is filled with His praise, people’s words become small, anger fades away, and in its place comes contentment and peace.",
      "id": 16
    },
    {
      "title": "النور ٢٢ / An-Noor 22",
      "verse_text": "يقول الله تعالى",
      "content": "الله يقول: ﴿وَلۡيَعۡفُواْ وَلۡيَصۡفَحُوٓاْ﴾. ليس المطلوب فقط أن تعفو بلسانك، بل أن تصفح بصدرك، أي تزيل الأثر من قلبك، وكأن الإساءة لم تكن. ثم يخاطب قلبك مباشرة: ﴿أَلَا تُحِبُّونَ أَن يَغۡفِرَ ٱللَّهُ لَكُمۡ﴾. كأنه يقول: تذكّر خطاياك، أليس قلبك يتمنى أن يعفو الله عنك؟ إذا كنت تحب أن يغفر الله لك، فابدأ أنت بالصفح عن عباده.\n\nابن كثير قال: “هذا حضّ من الله لعباده على العفو والصفح، مع وعد لهم بالمغفرة إن هم فعلوا ذلك.” والطبري قال: “ألا تحبون أن يغفر الله لكم، أي فاعفوا أنتم ليعفو الله عنكم.” والقرطبي أضاف: “هذه الآية أصل عظيم في إسقاط حقوق الناس رجاء أن يسقط الله عنا حقوقه.” والسعدي قال: “هذا فيه ترغيب عظيم للعفو عن الناس، فإنه جالب لمغفرة الله للعبد.”\n\nفتأمل يا عزيزي القارئ: الآية لا تخاطب عقلك فقط، بل قلبك. حين يغضب قلبك على من أساء إليك، حين تشعر أن الإساءة كبيرة لا تُغتفر، اسمع هذا النداء: ألا تحب أن يغفر الله لك؟ فإذا امتلأ قلبك برغبة المغفرة، سهل عليك أن تعفو. إنها معادلة عجيبة: عفوك عن الناس طريق لمغفرة الله لك.\n\nAllah says: “And let them pardon and overlook. Would you not like that Allah should forgive you? And Allah is Forgiving and Merciful.” [An-Noor: 22]\n\nListen, my dear reader, this verse was revealed in a very sensitive moment, during the incident of slander against our mother ʿAishah (may Allah be pleased with her). Among those who fell into that sin was Mistah, a poor man whom Abu Bakr (may Allah be pleased with him) used to financially support. When Mistah participated in spreading the false rumor, Abu Bakr swore that he would stop giving him aid. Then Allah revealed this verse, teaching Abu Bakr—and through him, all of us—a timeless lesson in forgiveness.",
      "english_content": "Allah says: “And let them pardon and overlook.” It’s not just about saying “I forgive you.” It’s about letting go from within, erasing the resentment from the heart, as if the harm never occurred. Then Allah turns directly to your heart: “Would you not like that Allah should forgive you?” It’s as if He is saying: think of your own sins, your own slips—don’t you long for His mercy? If you want Allah’s forgiveness, then begin by forgiving others.\n\nIbn Kathir explained: “This is Allah encouraging His servants to pardon and overlook, with the promise of forgiveness if they do so.” Al-Tabari said: “Would you not like Allah to forgive you? So forgive others so that Allah may forgive you.” Al-Qurtubi added: “This verse is a great foundation for waiving our rights over others, hoping Allah will waive His rights over us.” And Al-Saʿdi said: “This is a powerful encouragement to forgive others, for it brings Allah’s forgiveness to the servant.”\n\nSo reflect, dear reader: this verse is not speaking only to your reason, but to your heart. When anger surges against someone who wronged you, when you feel the wound is too deep to forgive, listen to this call: Would you not love that Allah forgives you? If your heart yearns for His forgiveness, then forgiveness toward others becomes lighter. It’s a divine exchange: your pardon of people becomes the path to Allah’s pardon of you.",
      "id": 17
    },
    {
      "title": "النحل ١٢٦ / An-Nahl 126",
      "verse_text": "الله تعالى يقول",
      "content": "لكن الله لا يقف عند العدل فقط، بل يرفعك إلى مقام أعظم: ﴿وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّـٰبِرِينَ﴾. أي إن اخترت طريق الصبر، وكظمت الغيظ، وتركت العقوبة لله، فهذا خير لك عند الله، وأعظم أجرًا وأرفع مقامًا. لأن الصبر ليس ضعفًا، بل قوة ضبط للنفس، وسيطرة على الغضب، وثقة بأن الله سيكفيك حقك.\n\nابن كثير قال: “إن أخذتم حقكم فاقتصروا على قدر المظلمة، وإن صبرتم وغفرتم فهو أفضل لكم.” والطبري قال: “هذا إرشاد من الله إلى الفضل، مع إباحته للعدل.” والقرطبي قال: “الصبر على الأذى وترك المقابلة خير عند الله، لأنه أدعى إلى الثواب وأرفع في الدرجات.” والسعدي قال: “هذه المرتبة أعلى المراتب، أن يعفو العبد عمن ظلمه محتسبًا الأجر عند الله.”\n\nفتأمل يا عزيزي القارئ: الآية تخاطب قلبك الغاضب، تقول لك: إن أردت العدل فلك ذلك، لكن إن أردت الفضل فاختر الصبر. ردّك بالمثل قد يُطفئ نار غضبك لحظة، لكن صبرك يفتح لك أبواب رضوان الله ونصره.",
      "english_content": "Allah says: “And if you punish [an enemy, O believers], punish with an equivalent of that with which you were harmed. But if you are patient – it is better for those who are patient.” [An-Nahl: 126]\n\nListen, my dear reader, this verse sets a remarkable balance in how to deal with injustice and harm. Allah permits the wronged person to respond, but only within limits: “punish with an equivalent of that with which you were harmed.” This is justice—taking no more than what was taken from you, not falling into excess or oppression.\n\nBut Allah doesn’t stop at justice. He elevates you to a higher station: “But if you are patient – it is better for those who are patient.” Meaning, if you choose restraint, if you master your anger and leave the matter to Allah, this is greater for you in His sight. Patience here is not weakness, but strength: the strength of self-control, the strength of trusting that Allah will handle what you cannot.\n\nIbn Kathir explained: “If you take your right, then restrict yourselves to the measure of the harm; but if you are patient and forgive, that is better for you.” Al-Tabari said: “This is Allah’s guidance to the higher virtue, while permitting justice.” Al-Qurtubi noted: “Patience with harm and leaving retaliation is better with Allah, for it leads to greater reward and higher ranks.” And Al-Saʿdi said: “This is the loftiest level, when the servant forgives the one who wronged him, seeking his reward with Allah.”\n\nSo reflect, dear reader: the verse speaks to your heart in the heat of anger. It tells you—justice is allowed, but virtue lies in patience. Retaliation might ease your anger for a moment, but patience opens for you the gates of Allah’s pleasure, His aid, and His higher reward.",
      "id": 18
    }
  ]
}