{
  "feeling": "حزن",
  "verses": [
    {
      "id": 1,
      "title": "البقرة ٣٨",
      "verse_text": "يقول الله تعالى: ﴿قُلۡنَا ٱهۡبِطُواْ مِنۡهَا جَمِيعٗاۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَن تَبِعَ هُدَايَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾ [البقرة: ٣٨]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية نزلت في سياق قصة آدم عليه السلام حين أهبطه الله من الجنة إلى الأرض، لكنه لم يُنزله مجرد إنزال عقوبة أو حرمان، بل إنزال تعليم ورحمة وبشارة. جاء في هذا النص وعدٌ عظيم يعانق قلب كل حزين: أن الحزن والخوف يمكن أن يُرفع إذا ارتبط العبد بهدى الله.\nالآية تبدأ بالأمر الإلهي: ﴿ٱهۡبِطُواْ مِنۡهَا جَمِيعٗا﴾. كلمة الهبوط هنا توحي بالانتقال من حال عالٍ إلى حال أدنى، وكأنها بداية رحلة مليئة بالتعب والمشقة. والإنسان بطبيعته قد يشعر بالضياع في هذه الرحلة، بين هموم الدنيا وخساراتها وأحزانها. لكن الله لم يترك عباده بلا دليل، بل قال: ﴿فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى﴾. هذا الهدى هو القرآن، والشرائع، والنور الذي يخرج الناس من التيه.\nثم جاءت البشارة التي تُسقط كل أثقال الحزن: ﴿فَمَن تَبِعَ هُدَايَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾. لاحظ أن الله لم يقل \"فلا يحزنون\" فقط، بل قدّم نفي الخوف أيضًا. الخوف يتعلق بالمستقبل، والحزن يتعلق بالماضي والحاضر. فكأن الله يعدك أنك إذا اتبعت هداه، فلن يسيطر عليك لا قلق المستقبل ولا وجع الماضي.\nابن كثير قال: \"هذا إخبار من الله تعالى بأن من اتبع ما أنزله على رسوله، فإنه لا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من أمور الدنيا.\" والطبري قال: \"من أخذ بكتابي واهتدى به، فلا خوف عليهم مما أمامهم من أمر الآخرة، ولا يحزنون على ما خلفوا وراءهم من الدنيا.\" أما القرطبي فأكد أن هذا وعد شامل، وأن الحزن والخوف ملازمان لابن آدم، لكن الهدى هو الذي ينقذه منهما.\nفتأمل يا عزيزي القارئ: الحزن في الدنيا أمر لا مفر منه، لكنه لا يسيطر على قلب من جعل القرآن والهدى رفيقًا له. بل إن النبي ﷺ نفسه مرّ بأحزان عظيمة: فقدَ أحب الناس إليه، عانى من تكذيب قومه، عاش \"عام الحزن\"، ومع ذلك كانت آيات مثل هذه تسقي قلبه باليقين. وقد روي أنه ﷺ كان يردد: «اللهم اجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي وغمي» (رواه أحمد).\nكأن الله يقول لك هنا: أيها الإنسان الحزين، الطريق ليس أن تُغلق على نفسك أبواب الدنيا، بل أن تفتح قلبك على هداه. عندها سترى أن كل ألم صار خفيفًا، وكل دمعة صارت مطهرة، وكل لحظة انكسار صارت قربًا. من تبع الهدى، لا خوف عليه مما ينتظره، ولا حزن عليه مما فقده.",
      "english_content": "\"We said, 'Go down from it, all of you. And when guidance comes to you from Me, then whoever follows My guidance - no fear will there be concerning them, nor will they grieve.'\" [Al-Baqarah: 38]\nListen, dear reader, this verse comes in the context of the story of Adam, peace be upon him, when Allah sent him down from Paradise to earth. Yet, it was not a descent of pure punishment or abandonment—it was a descent marked by teaching, mercy, and promise. Within these words lies a message that embraces the heart of every sorrowful soul: fear and grief can be lifted when a person clings to the guidance of Allah.\nThe verse begins: “Go down from it, all of you.” The word descend itself suggests a fall from a lofty place to a lower one, the start of a journey filled with trials and hardships. By nature, man feels lost in such a journey—overwhelmed by the burdens of life, by losses, and by grief. But Allah does not abandon His creation; He assures them: “And when guidance comes to you from Me.” This guidance is the Qur’an, the laws, and the divine light that leads people out of confusion.\nThen comes the promise that dissolves every weight of sadness: “Then whoever follows My guidance - no fear will there be concerning them, nor will they grieve.” Notice how Allah did not only mention grief. He also promised the removal of fear. Fear is tied to the unknown future, while grief is tied to the past and the present. Allah guarantees that those who follow His guidance will be freed from both—the anxiety of what is to come and the sorrow of what has passed.\nIbn Kathir explained: “This is Allah’s news that whoever follows what He revealed to His Messenger, will have no fear in what comes in the Hereafter, nor will they grieve over what they missed of worldly matters.” Al-Tabari said: “Whoever holds to My Book and is guided by it, they shall have no fear about what lies ahead, nor will they grieve over what they left behind.” Al-Qurtubi affirmed that fear and grief are natural companions of mankind, but divine guidance is the shield that saves the heart from being consumed by them.\nNow reflect, dear reader: sorrow in this world is inevitable, but it does not dominate the heart of one who has made the Qur’an and Allah’s guidance his companion. Even the Prophet ﷺ himself faced immense grief—he lost his loved ones, was rejected by his people, and endured what came to be called the “Year of Sadness.” Yet verses like this poured certainty into his heart. It is narrated that he would supplicate: “O Allah, make the Qur’an the spring of my heart, the light of my chest, the remover of my sorrow, and the reliever of my distress” (Ahmad).\nIt is as though Allah is speaking directly to you here: O sorrowful soul, the way is not to shut yourself off from the world, but to open your heart to My guidance. Then you will find that every pain becomes lighter, every tear becomes a means of purification, and every moment of brokenness becomes closeness. Whoever follows the guidance—there is no fear awaiting them, nor grief binding them."
    },
    {
      "id": 2,
      "title": "البقرة ١١٢",
      "verse_text": "يقول الله تعالى: ﴿بَلَىٰ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦۖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾",
      "content": "اسمع يا عزيزي القارئ، هذه الآية العظيمة جاءت في خضم نقاشات بين أهل الأديان وأهل الكتاب، حين كان كل طرف يدّعي أن النجاة والسعادة في الآخرة حكرٌ على طائفته وحدها. اليهود يقولون: لن يدخل الجنة إلا من كان هودًا. والنصارى يقولون: لن يدخلها إلا من كان نصارى. فجاء القرآن يفصل في القضية بميزان عادل لا يعرف العصبيات ولا الأهواء: الميزان هو الإسلام الحق لله، والإحسان في العمل.\nالله يقول: ﴿بَلَىٰ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ﴾. تأمل التعبير \"أسلم وجهه\". الوجه هو أعز ما في الإنسان، به يُعرف، وهو موضع شرفه وكرامته. فإذا أسلم وجهه لله، فقد أسلم قلبه وجوارحه وحياته كلها، أي سلّم قياده لله تعالى طاعةً وخضوعًا. ليس مجرد كلام باللسان، ولا نسب إلى طائفة، بل تسليم كامل.\nثم قال: ﴿وَهُوَ مُحۡسِنٞ﴾. أي أنه لم يكتفِ بالإسلام الظاهر، بل أحسن في العمل، وأتقن عبادته، وصدق في معاملته. فالإحسان أن تعبد الله كأنك تراه، وأن تحسن للخلق كما تحب أن يحسن الله إليك.\nالجزاء؟ ﴿فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦ﴾. أجر محفوظ مضمون عند الله، لا يُنقص، ولا يضيع. ليس مرتبطًا بعرق ولا نسب ولا انتماء لطائفة، بل بصدق التوجه لله وحسن العمل.\nثم تأتي البشرى التي تُزيل عن القلب كل خوف وكل حزن: ﴿وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾. لا خوف مما سيأتي في المستقبل: لا من الموت، ولا من الحساب، ولا من النار. ولا حزن على ما فات في الدنيا: لا على مال ضاع، ولا أهل فُقدوا، ولا أيام انقضت. كأن الآية تقول: من أسلم وجهه لله وأحسن عمله، فإن الله يرفعه فوق الخوف والحزن، وهما أثقل ما يثقل قلب الإنسان.\nابن كثير قال: \"أي من أخلص العمل لله وحده لا شريك له، وأحسن متابعته رسله، فله جزاؤه عند ربه يوم القيامة، ولا خوف عليهم مما يستقبلونه، ولا هم يحزنون على ما خلّفوه.\" والطبري قال: \"معناه من أخلص دينه لله فعمل بطاعته، وهو محسن فيها، فله ثواب عمله عند ربه، آمنًا مما يخاف، سالمًا مما يحزن.\"\nفتأمل يا عزيزي القارئ: كم من إنسان أثقله الحزن على الماضي، وأرّقه الخوف من المستقبل. هذه الآية تعطيك الوصفة: سلّم وجهك لله، وأحسن في عملك، وسيكفيك الله. سيعطيك أجرًا عنده، ويرفع عنك غمّ الماضي وقلق المستقبل. إنها معادلة النجاة، طريق الخلاص، وباب الطمأنينة.",
      "english_content": "\"Yes, whoever submits his face in Islam to Allah while being a doer of good will have his reward with his Lord. And no fear will there be concerning them, nor will they grieve.\" [Al-Baqarah: 112]\nListen, my dear reader, this verse comes as a response to the claims of those who argued that salvation is confined to their group alone. The Jews said: “None will enter Paradise except those who are Jews.” The Christians said: “None will enter except those who are Christians.” But here Allah sets down the true measure of success, a universal standard not bound by tribe or title: submission to Him and righteous action.\nAllah says: “Whoever submits his face to Allah…” Notice the depth of this expression. The face is the noblest part of a human being, the sign of their honor and identity. To submit your face to Allah means to surrender your whole being, your heart, your will, your pride—everything. It is complete devotion, without condition, without arrogance.\nThen He adds: “…while being a doer of good.” It is not enough to just claim belief; it must be lived through action. Righteous deeds, kindness, truthfulness, prayer, patience, sincerity—these are the signs of one who truly surrenders to God. It is Islam in practice, not only in name.\nThe promise follows: “He will have his reward with his Lord.” A reward kept safe, never lost, never diminished. Not in the hands of men, not dependent on heritage or labels, but preserved with Allah Himself.\nAnd the greatest gift: “No fear will there be concerning them, nor will they grieve.” They will not fear the future—no terror of death, no dread of the Day of Judgment, no worry of punishment. Nor will they grieve over the past—no sorrow for lost wealth, no regret over missed chances, no pain over what once was. Allah lifts from them the two heaviest burdens on the human heart: fear of what is to come, and grief for what has passed.\nIbn Kathir explained: “Whoever devotes his work sincerely for Allah and follows His messengers, then his reward is secure with his Lord, and he will be safe from fear and sorrow.” Al-Tabari said: “It means whoever makes his religion purely for Allah, obeys Him, and does good, then his recompense is preserved with Allah, without fear of the future or grief of the past.”\nSo reflect, dear reader: how many nights are heavy with fear of tomorrow, how many days are consumed by sorrow of yesterday? This verse hands you the key: surrender sincerely to Allah, adorn your life with good deeds, and Allah Himself promises to carry away your fears and sorrows. It is a divine assurance that the one who truly turns to Him will find peace beyond imagination."
    },
    {
      "id": 3,
      "title": "البقرة ٢٧٧",
      "verse_text": "يقول الله تعالى: ﴿إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَـٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡۖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾ [البقرة: ٢٧٧]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية كأنها ملاذٌ للأرواح المتعبة. الله يضع أمامك وصفًا بديهيًا وبسيطًا لأهل السعادة في الدنيا والآخرة: إيمان صادق، عمل صالح، صلاة قائمة، وزكاة معطاة. ليست الشروط معقدة، بل خطوات واضحة، من سار فيها وجد الطمأنينة في الدنيا والنجاة في الآخرة.\nقال الله: ﴿إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَـٰتِ﴾، الإيمان الذي يملأ القلب ويظهر أثره في العمل، لا مجرد كلمات على اللسان. ثم أكد الشرطين الأعظم: إقامة الصلاة التي تصل العبد بربه، وإيتاء الزكاة التي تصل العبد بالخلق. فمن جمع بين حق الله وحق العباد فقد حقق أساس الدين.\nوالبشارة: ﴿لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ﴾. لاحظ، الأجر ليس عند الناس ولا عند الدنيا، بل عند الله، محفوظ لا يضيع، مضمون لا يُنقص. ثم تأتي أعظم هدية: ﴿وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾. لا خوف من المستقبل، ولا حزن على الماضي. تخيل قلبًا منقّى من هذه الآلام الثقيلة، يعيش حاضرًا طيبًا مطمئنًا.\nابن كثير قال: “أخبر الله تعالى أن الذين آمنوا بالله ورسوله وعملوا الصالحات من إقامة الصلاة وإيتاء الزكاة، لهم الأجر الجزيل عند الله يوم القيامة، ولا خوف عليهم مما يستقبلونه، ولا هم يحزنون على ما مضى.” والطبري قال: “أي لا يخافون مما أمامهم، ولا يحزنون على ما وراءهم.” والقرطبي قال: “جمع الله لهم بين نعيم الدنيا من الطمأنينة، ونعيم الآخرة من الأمن التام.”\nتأمل يا عزيزي القارئ: كل همّك اليوم، كل حزنك الذي يثقل قلبك، كل خوف يتربص بمستقبلك، الله يعدك أن يرفعه عنك إذا صدقت بالإيمان، وأقمت الصلاة، وأخرجت حق المال. ليست الوعود هنا بشرية قابلة للنقص، بل وعد إلهي محكم: لا خوف ولا حزن.\nكأن الآية تخاطبك مباشرة: إن أردت قلبًا مطمئنًا لا يحزنه ماضٍ ولا يخيفه مستقبل، فالطريق ليس بالركض وراء الدنيا، بل بالثبات على الإيمان، الصلاة، والزكاة. هذا هو طريق الطمأنينة الذي لا يخذلك.",
      "english_content": "\"Indeed, those who believe and do righteous deeds and establish prayer and give zakah will have their reward with their Lord, and no fear will there be concerning them, nor will they grieve.\" [Al-Baqarah: 277]\nListen, my dear reader, this verse feels like a shelter for weary hearts. Allah lays down a simple, clear path for those who wish for true peace: sincere faith, righteous action, maintaining prayer, and giving zakah. These aren’t impossible demands but steps of light — whoever follows them will find serenity in this world and eternal joy in the Hereafter.\nAllah says: “Indeed, those who believe and do righteous deeds.” That is, faith that fills the heart and flows into action, not empty claims. Then He highlights two pillars: establishing prayer, which connects you to your Lord, and giving zakah, which connects you to people. Whoever fulfills the right of Allah and the right of creation completes the essence of faith.\nThen comes the promise: “they will have their reward with their Lord.” Notice — their reward is not stored with people or fleeting worldly gains but with Allah Himself: preserved, guaranteed, never diminished. And the greatest gift follows: “and no fear will there be concerning them, nor will they grieve.” No fear of what lies ahead, no grief for what is left behind. Imagine a heart stripped of the weight of fear and sorrow, living in present peace.\nIbn Kathir said: “Allah informs that those who believe in Him and His Messenger and act righteously — by establishing prayer and giving zakah — will have a great reward with Allah on the Day of Judgment. They will not fear what is to come, nor grieve over what has passed.” Al-Tabari said: “They shall have no fear of what awaits them, nor sorrow over what they leave behind.” Al-Qurtubi added: “Allah combined for them the blessing of tranquility in this life and the blessing of complete security in the Hereafter.”\nReflect, my dear reader: whatever burden weighs you down, whatever grief clings to your heart, whatever fear shadows your future — Allah promises to remove it, if only you cling to faith, prayer, and generosity. These are not just acts, but lifelines to peace.\nIt is as if the verse speaks directly to you: if you want a heart free from sorrow and fear, the path is not in chasing worldly illusions, but in grounding yourself in faith, prayer, and zakah. This is the road to serenity that never betrays."
    },
    {
      "id": 4,
      "title": "آل عمران ١٣٩",
      "verse_text": "يقول الله تعالى: ﴿وَلَا تَهِنُوا۟ وَلَا تَحۡزَنُوا۟ وَأَنتُمُ ٱلۡأَعۡلَوۡنَ إِن كُنتُم مُّؤۡمِنِينَ﴾ [آل عمران: ١٣٩]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية نزلت في وقتٍ عصيب على المسلمين، بعد غزوة أُحد حين تكالبت عليهم الهموم، ورأوا جراحهم ودماءهم، وخيّم الحزن على قلوبهم. فجاءهم الخطاب من الله، لا من بشر، ليأخذ بأيديهم من وادي الانكسار إلى قمم العزة: ﴿وَلَا تَهِنُوا۟ وَلَا تَحۡزَنُوا۟﴾. كأن الله يقول: لا تضعفوا أمام المحن، ولا تستسلموا للحزن مهما أثقل قلوبكم، فإن عزتكم باقية ورفعتكم محفوظة.\nثم يطمئنهم بقوله: ﴿وَأَنتُمُ ٱلۡأَعۡلَوۡنَ﴾. تأمل! هم كانوا مكسورين في نظر أنفسهم، لكن الله يخبرهم بحقيقة لم يروها: أنتم الأعلون بالإيمان، أنتم الأرفع بالحق، حتى لو جُرحتم أو تعثرتم، فإن نهايتكم النصر، وعاقبتكم الفلاح. العلو هنا ليس بالقوة المادية فقط، بل بالكرامة المعنوية التي لا تنكسر أمام الهزائم.\nابن كثير قال: “أي لا تضعفوا عن أعدائكم ولا تحزنوا بما أصابكم، فأنتم الأعلون بالنصرة في الدنيا وبالجنة في الآخرة.” والطبري قال: “أنتم الأعلون: أي أنكم الغالبون بإيمانكم بالله وصدقكم في طاعته.” والقرطبي أضاف: “الأعلون بالحجة واليد، فالغلبة لكم وإن أصابكم يومًا ما أصابكم.”\nفتأمل يا عزيزي القارئ، كيف يخاطبك الله في حزنك: لا تدع الهزيمة اللحظية تسرق منك روحك، ولا تجعل الهم يغطي على كرامتك. إن كنت مؤمنًا، فأنت الأعلى، حتى في أصعب لحظاتك. الحزن سيزول، والضعف سيتحول إلى قوة، لأن الله وعدك أن العاقبة للمتقين.\nهذه الآية لا تُقرأ فقط في كتب التاريخ عن غزوة أُحد، بل هي دواء لكل قلب منكسر اليوم. فإذا شعرت بالخذلان أو الغلبة أو ثِقَل الهموم، اسمع نداء الله لك: لا تهن ولا تحزن، فأنت الأعلى بإيمانك.",
      "english_content": "“So do not weaken and do not grieve, and you will be superior if you are [true] believers.” [Aal-Imran: 139]\nListen, dear reader, this verse was revealed in one of the most painful moments for the early Muslims — after the Battle of Uhud, when wounds bled, companions were martyred, and sadness overwhelmed hearts. At that very moment, the voice of Allah Himself descended, not through human comfort, but through divine words that carried strength: “Do not weaken and do not grieve.” It is as if Allah is telling them: do not surrender to despair, do not allow sorrow to paralyze your soul, because your worth does not diminish with a momentary setback.\nThen comes the divine promise: “and you will be superior.” Think about this! They were crushed in their own eyes, feeling defeated, yet Allah reminded them of a deeper truth — that with faith, they remain the higher ones. Superiority here is not measured only by material victory but by the dignity of faith, by holding the truth even in the face of loss. It is the kind of superiority that no wound, no defeat, no grief can erase.\nIbn Kathir explained: “Do not weaken before your enemies, and do not grieve over what befell you, for you are the superior ones — with victory in this life and with Paradise in the Hereafter.” Al-Tabari said: “You are superior through your faith in Allah and your steadfastness in obeying Him.” Al-Qurtubi added: “Superior in proof and in destiny; even if hardship strikes you today, the final triumph belongs to you.”\nSo reflect, dear reader: this verse is not locked in history; it is alive for you in your own moments of pain. When you feel crushed by life, when defeat weighs heavy on your shoulders, hear Allah’s words as if they are spoken to you: Do not weaken, do not grieve. You are higher, you are stronger, if only you hold to your faith.\nThis is the secret of healing grief in Islam: not denying the pain, but placing it within the horizon of divine promise — that sorrow will pass, but the dignity of belief remains, and the end belongs to those who stay true."
    },
    {
      "id": 5,
      "title": "آل عمران ١٧٠",
      "verse_text": "يقول الله تعالى: ﴿فَرِحِينَ بِمَآ ءَاتَاهُمُ ٱللَّهُ مِن فَضۡلِهِۦ وَيَسۡتَبۡشِرُونَ بِٱلَّذِينَ لَمۡ يَلۡحَقُواْ بِهِم مِّنۡ خَلۡفِهِمۡ أَلَّا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾ [آل عمران: ١٧٠]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية نزلت تسكب الطمأنينة في قلوب الصحابة بعد ما أصابهم الحزن الشديد في أحد، حين فقدوا أحبابهم ورأوا دماء الشهداء تسيل في الأرض. المشهد كان ثقيلاً، والقلوب امتلأت بالأسى، فجاءهم هذا الوحي ليكشف لهم عن حال أحبائهم الذين سبقوهم إلى الجنة.\nيقول الله: ﴿فَرِحِينَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦ﴾. الشهداء الآن ليسوا في ألم ولا فقد، بل في فرح غامر بما أعطاهم الله من النعيم والكرامة. والآية لا تصف فرحًا عاديًا، بل فرحًا ممتدًا، ثابتًا، نابعًا من فضل الله العظيم الذي لا يُقاس.\nثم يرسم الله مشهدًا أعظم: ﴿وَيَسۡتَبۡشِرُونَ بِٱلَّذِينَ لَمۡ يَلۡحَقُواْ بِهِم مِّنۡ خَلۡفِهِمۡ﴾. هم في الجنة، ومع ذلك قلوبهم معلّقة بمن خلفهم، ينتظرون إخوانهم من المؤمنين، يبشرونهم بأنهم حين يلحقون لن يخافوا ولن يحزنوا. وكأن الشهداء أنفسهم يتحولون إلى مصدر أمل وطمأنينة للأحياء، يقولون لهم: لا تخافوا، لا تحزنوا، أنتم على الطريق إلينا.\nابن كثير قال: \"المراد أن الشهداء يستبشرون بمن يلحق بهم من إخوانهم المؤمنين، بأنهم سيلقون مثل ما لقوا من النعيم والكرامة.\" والطبري قال: \"يفرحون بمن يأتي بعدهم على ما مضوا عليه من الإيمان والطاعة، أنه لا خوف عليهم في الآخرة ولا هم يحزنون على ما خلّفوا.\" والقرطبي ذكر: \"هذه البشارة تسلية للمؤمنين، وتطمين لقلوبهم، بأن أحبابهم لم يضيعوا، بل هم في نعيم مقيم ينتظرونهم.\"\nتأمل يا عزيزي القارئ، كيف تحوّل مشهد الحزن إلى مشهد أمل. بدل أن يظل القلب معلّقًا بالبكاء على من فقد، الله يرفع الحجاب ويُريك حالهم: فرحين، مطمئنين، لا خوف عليهم ولا هم يحزنون. هذه الآية ليست فقط للصحابة في أحد، بل لكل مؤمن فقد عزيزًا في سبيل الله، ولكل قلب يئنّ من ألم الفقد. الرسالة واحدة: من مضى قد فاز، وهو الآن في فرح، ومن بقي فموعده أن يلحق، فلا خوف ولا حزن في نهاية الطريق.",
      "english_content": "“Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them – that there will be no fear concerning them, nor will they grieve.” [Aal-Imran: 170]\nDear reader, this verse was revealed to soothe the wounded hearts of the believers after the grief of Uhud, when loved ones were lost, and the pain of separation pressed heavily on their souls. It came as a divine unveiling, showing the true state of the martyrs whom people thought were gone. Allah paints for us a living picture: they are not lost, they are not in sorrow — they are rejoicing.\n“Rejoicing in what Allah has bestowed upon them of His bounty.” Their joy is not shallow, not temporary like worldly pleasures; it is joy rooted in divine favor, joy that overflows because of the honor Allah has given them. This is the kind of happiness that nothing can taint, not even the memory of death itself.\nThen Allah shows us something even more moving: “and they receive good tidings about those after them who have not yet joined them.” Imagine it, dear reader: the martyrs in Paradise, yet their hearts still turn toward those left behind in the world, yearning for their brothers and sisters in faith. They are given the glad tidings to pass on — that when those believers arrive, they too will have no fear, nor will they grieve. It is as if the martyrs themselves become messengers of hope, telling the living: stay firm, walk the path, and you will join us in joy, untouched by sorrow.\nIbn Kathir explained: “The martyrs rejoice for their own reward, and also for those who will follow them, that they too will attain what they attained of bliss.” Al-Tabari wrote: “They are happy for their companions left behind, that they will not fear the Hereafter nor grieve what they left in the world.” Al-Qurtubi added: “This verse is a comfort for the believers, showing that their loved ones are not lost, but alive in eternal delight, waiting to be joined by them.”\nSo reflect, dear reader: the verse speaks directly to your heart if you have ever lost someone dear in the path of Allah. It tells you: they are not in pain, they are rejoicing, and they await you with glad tidings. And for you who remain, the message is this: do not let grief crush you, for the end of this road is reunion in a place where no fear can touch you, and no grief can weigh you down."
    },
    {
      "id": 6,
      "title": "آل عمران ١٧٦",
      "verse_text": "يقول الله تعالى: ﴿وَلَا يَحۡزُنكَ ٱلَّذِينَ يُسَـٰرِعُونَ فِي ٱلۡكُفۡرِۚ إِنَّهُمۡ لَن يَضُرُّواْ ٱللَّهَ شَيۡـٔٗاۗ يُرِيدُ ٱللَّهُ أَلَّا يَجۡعَلَ لَهُمۡ حَظّٗا فِي ٱلۡأٓخِرَةِۖ وَلَهُمۡ عَذَابٌ عَظِيمٌ﴾ [آل عمران: ١٧٦]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية نزلت لتداوي قلب النبي ﷺ، الذي كان يحزن أشد الحزن حين يرى أناسًا من حوله يُسارعون في الكفر، يختارون الضلال على الهداية، ويبتعدون عن النور الذي جاء به. تخيل حال قلب النبي الرحيم، الذي بعثه الله رحمة للعالمين، كيف كان يتألم لرؤية الناس يصدّون عن الحق، وكأنه يحمل همّ مصيرهم بين جنبيه. فجاءه هذا الخطاب من ربه: لا يحزنك الذين يسارعون في الكفر.\nهنا، الله يرفع عن قلب حبيبه ثِقَل الحزن، كأنه يقول له: يا محمد، لا تجعل صدودهم يحطّمك، ولا تسمح لكفرهم أن يثقل قلبك، فإنهم في الحقيقة لا يضرون الله شيئًا، ولا يطفئون نوره، ولا يغيّرون قدره.\nثم يبيّن سبحانه الحقيقة الكبرى: يُريد الله ألا يجعل لهم حظًا في الآخرة. أي أن مسارهم هذا لن ينتهي بنجاح، بل هو اختيارهم الذي جرّهم إلى أن يُحرَموا نصيب النجاة. أما الله، فلا ينقص ملكه كفرهم، ولا يزداد بإيمانهم، هو الغني عن العالمين، وإنما وبالهم على أنفسهم.\nابن كثير قال: “يُسَلّي الله تعالى نبيه ﷺ عن حزنه بسبب إعراض قومه، ويخبره أن من اختار الكفر فلن يضر إلا نفسه، وأن الله أراد لهم الخيبة في الآخرة.” والطبري قال: “لا يحزنك إسراعهم في الكفر، فإن ذلك بإرادتهم، والله لم يرد لهم الخير، بل أراد أن يحرمهم الثواب.” والقرطبي أضاف: “فيها تسلية عظيمة لكل داعية إلى الله، أن لا يضيق صدره إذا رأى الناس يعرضون، فإنما الأمر كله إلى الله.”\nفتأمل يا عزيزي القارئ، كأن هذه الآية تخاطبك أنت أيضًا. كم مرة دعوت قريبًا أو صديقًا، ورجوته أن يستقيم أو يرجع إلى الله، لكنه أعرض؟ كم مرة تألمت لحال الناس، ورأيتهم يركضون وراء الضلال، فحزنت؟ هنا الله يقول لك: لا تدع ذلك يحزنك حتى يُطفئ نور قلبك. دورك أن تبلّغ وتبذل وتنصح، أما القلوب فهي بيد الله، يهدي من يشاء ويضل من يشاء.\nالرسالة التي تحمِلها لك الآية: لا تجعل حزن قلبك على الناس يثنيك عن الطريق، ولا تظن أن الحق ضعيف لأن الكثرة أعرضت عنه. فالله وعد أن نوره سيبقى، وأن الكافرين مهما سعوا فلن يضرّوا الله شيئًا.",
      "english_content": "“And do not be grieved by those who rush into disbelief. Indeed, they will never harm Allah at all. Allah intends to give them no share in the Hereafter, and for them is a great punishment.” [Aal-Imran: 176]\nDear reader, this verse was revealed as a balm to the Prophet’s ﷺ heart, who would be deeply saddened when he saw people hastening into disbelief, turning away from the truth he brought with such sincerity. Imagine his compassionate soul, carrying concern for the fate of every human being, aching whenever someone chose misguidance over guidance. Allah, in His mercy, addressed him directly: “Do not be grieved.”\nIt is as if Allah is saying: O Muhammad, their disbelief does not lessen your worth, nor does it dim the light of what you have brought. Their rushing into denial and rebellion does not harm Allah in the least, nor can it hinder His plan. Rather, their loss is their own.\nAllah then unveils the reality: “Allah intends to give them no share in the Hereafter.” That is the true outcome of their choice. They have traded eternal reward for fleeting pleasures, and thus they will find themselves bankrupt on the Day when it matters most. The “great punishment” is not an act of arbitrary wrath, but the natural result of their rejection of truth after it came to them.\nIbn Kathir explained: “Allah comforts His Messenger regarding the hastening of his people into disbelief, and tells him that those who choose disbelief will only harm themselves, for Allah has willed to deprive them of any share in the Hereafter.” Al-Tabari said: “Do not let their racing into denial grieve you, for it is their will and Allah has sealed that they have no reward with Him.” Al-Qurtubi added: “This is a great consolation to every caller to Allah: do not let the turning away of people break your spirit, for guidance is not in your hands but Allah’s.”\nSo reflect, dear reader: this verse is not only for the Prophet ﷺ, it is also for every heart that feels sorrow when seeing loved ones or society drift away from faith. Allah is telling you: do not let their rejection darken your soul or burden you with despair. Your role is to convey, to stand firm, to keep your light shining. The hearts are in the hand of Allah, and though people may rush into disbelief, they cannot harm Him nor extinguish His light. Their race is only toward their own loss."
    },
    {
      "id": 7,
      "title": "المائدة ١٢٠",
      "verse_text": "يقول الله تعالى: ﴿لِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا فِيهِنَّ ۚ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ﴾ [المائدة: ١٢٠]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية العظيمة جاءت ختامًا لسورة المائدة، وكأنها ختم مهيب يربط قلب المؤمن بحقيقة كونية لا تتغير: أن الملك كله لله. كل ما تراه عيناك في السماوات، من شموس وأقمار ونجوم وكواكب، وكل ما في الأرض من بشر وأشجار وبحار وجبال، وما فيهنّ من أسرار وعجائب، كله مِلك لله وحده.\nهذه الآية تُذكّرك، يا من يثقل قلبه الحزن، أن الدنيا بكل ما فيها ليست بيد الناس، ولا بيد قوى الأرض، إنما هي بيد مالك السماوات والأرض. فلا تُحزن إذا خسرت شيئًا من متاع الدنيا، فإنها ليست ملكك أصلًا، إنما هي وديعة عندك، وصاحب الملك الحقيقي هو الله، وهو الذي يقسم الأرزاق ويُقدّر الأقدار.\nثم جاء الوصف: وهو على كل شيء قدير. ليست قدرته محدودة بزمان أو مكان، وليست سلطته ناقصة أو مقيدة، بل هو القادر على أن يغيّر حالك من ضيق إلى فرج، ومن حزن إلى سعادة، ومن انكسار إلى قوة. فإذا علمت هذا، هان عليك كل ما يثقل صدرك من هموم، لأنك تعلم أن الأمر كله بيد القادر الذي لا يعجزه شيء.\nابن كثير قال: “يخبر تعالى أن له ملك السموات والأرض وما فيهن، يتصرف في جميع ذلك بحكمه وقدره وقهره، وهو على كل شيء قدير، لا يعجزه شيء.” والطبري قال: “أي له سلطان ما فيهن، لا يملك أحد مع الله شيئًا، وهو القادر على كل ما يشاء.” والسعدي قال: “هذا تقرير لتوحيده وربوبيته، ليطمئن العبد أن رزقه وأمره كله إلى الله، فلا يتعلق بغيره.”\nفتأمل يا عزيزي القارئ، كيف تختم هذه السورة خطابها بهذه الحقيقة: أن الملك كله لله. كأنها تقول لك: لا تحمل همًّا فوق طاقتك، ولا تحزن على شيء فاتك، فالذي يملك أمر الدنيا والآخرة هو الله، وهو قدير على أن يُبدل حالك في لحظة. هذه الكلمات وحدها تكفي لتزرع في القلب طمأنينة تُذيب الهموم.",
      "english_content": "“To Allah belongs the dominion of the heavens and the earth and whatever is within them. And He is over all things competent.” [Al-Maeda: 120]\nDear reader, this majestic verse comes as the closing of Surah Al-Maeda, almost like a divine seal that ties your heart to an eternal truth: all dominion belongs to Allah. Everything you see in the skies — the suns, the moons, the stars, the galaxies — and everything upon the earth — humans, mountains, oceans, trees, creatures — all of it is owned solely by Him.\nThis verse reminds you, you who carry sorrow in your chest, that nothing in this life truly belongs to you or to anyone else. Wealth, people, positions, health — all of it is entrusted to us for a time, but the real Owner is Allah. So if you lose something, do not let grief consume you. It was never truly yours to begin with; it always belonged to Allah, and He is the One who apportions provisions and decrees destinies with perfect wisdom.\nThen Allah seals the verse with: “And He is over all things competent.” His power is limitless, unrestricted by time or place. He is able to transform your state from constriction to ease, from sadness to joy, from weakness to strength. When you know that the One who owns everything also has complete power over everything, the burdens on your heart become lighter, for you realize your affairs rest in the hands of the One who never fails.\nIbn Kathir said: “Allah informs us that the dominion of the heavens and the earth and what is within them belongs to Him, He disposes of them by His decree and wisdom, and He is capable of everything, nothing renders Him powerless.” Al-Tabari wrote: “It means the sovereignty of everything is His, none shares with Him in dominion, and He is capable of all He wills.” Al-Sa‘di explained: “This is an affirmation of His oneness and lordship, to bring tranquility to the servant that his provision and affairs are all in Allah’s hands, so he should not attach himself to anyone else.”\nSo reflect, dear reader: this verse is like a soft hand wiping away your grief, telling you that no loss in this life is permanent, and no sorrow is beyond healing, because everything belongs to Allah, and He is fully able to restore, replace, or transform it in a moment. Hold on to this truth, and you will find peace even in the midst of pain."
    },
    {
      "id": 8,
      "title": "يونس ٦٢",
      "verse_text": "يقول الله تعالى: ﴿أَلَا إِنَّ أَوْلِيَاءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ﴾ [يونس: ٦٢]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية من أعظم ما يسكب الطمأنينة في القلوب الحزينة، هي وعد إلهي صريح لا يقبل الشك ولا التأويل: أن أولياء الله لا خوف عليهم ولا هم يحزنون. كلمة \"أولياء الله\" تشمل كل عبد آمن بربه وصدق في اتباعه، حتى لو لم يكن معروفًا في الأرض أو مشهورًا بين الناس. وليّ الله هو من والى ربَّه بالمحبة والطاعة، ووالى عباده بالخير والإحسان.\nلاحظ كيف عبّر الله هنا: لا خوف عليهم أي لا ينتظرهم مستقبل يثير قلقًا أو رعبًا، لا في الدنيا ولا في الآخرة. ولا هم يحزنون أي لا يحملون هموم الماضي، لا يندمون على ما فاتهم ولا ينوءون تحت ثقل الخسائر والأحزان. إنها طمأنة شاملة: أمان من المستقبل، وسلام من ذكريات الأمس.\nابن كثير قال: “أولياء الله هم الذين آمنوا وكانوا يتقون، لا خوف عليهم فيما يستقبلونه من الأمور ولا يحزنون على ما مضى.” والطبري قال: “أي لا خوف عليهم من عذاب الله، ولا يحزنون على ما فاتهم من الدنيا.” والقرطبي أضاف: “فيها تسلية عظيمة للمؤمنين، لأن الله وعدهم بالأمن من كل مكروه.” والسعدي قال: “كل من اتقى الله فهو وليّه، وهذه بشارة لهم بالأمن التام من كل ما يخافونه والحزن التام على كل ما يحزنون عليه.”\nفتأمل يا عزيزي القارئ: هذه الآية ليست مجرد وعد عام، بل هي خطاب شخصي لك إذا سعيت لتكون من أولياء الله، بالإيمان والتقوى. كأن الله يقول لك: إن صدقت معي، فأنا أضمن لك أن تعيش مطمئنًا، لا خوف يطاردك ولا حزن يكسرك. إنها دعوة لأن تُسلم قلبك لله، فتذوق لذة الأمان الحقيقي التي لا يمنحها مال ولا سلطان، بل يمنحها القرب من الله.",
      "english_content": "“Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve.” [Younus: 62]\nDear reader, this verse is one of the greatest promises of peace to sorrowful hearts. It is a direct, undeniable assurance from Allah: His allies will neither fear the future nor grieve over the past. The term “allies of Allah” (awliyaa’) includes every servant who sincerely believes in Him and strives to live in obedience, even if they are unknown or unrecognized in this world. To be a wali of Allah is not about fame or status, but about love for Him, loyalty to His commands, and kindness to His creation.\nNotice how Allah expresses it: “no fear concerning them” — meaning their future holds no terror, neither in this world nor in the Hereafter. “Nor will they grieve” — meaning their past will not weigh on them; no regrets will haunt them, no losses will crush their spirits. It is complete reassurance: safety from what lies ahead, and relief from the burdens of yesterday.\nIbn Kathir said: “The allies of Allah are those who believed and were pious. They will have no fear regarding what is to come, nor grief over what has passed.” Al-Tabari explained: “They will not fear the punishment of Allah, nor grieve for what they have missed of worldly matters.” Al-Qurtubi added: “This verse is a great consolation for the believers, for Allah has promised them security from every distress.” Al-Sa‘di wrote: “Every God-fearing believer is among His allies, and this is glad tidings of complete security from all that causes fear and sorrow.”\nSo reflect, dear reader: this verse is not just a broad statement, but a personal message to you if you strive to be among Allah’s allies through faith and piety. It is as though Allah is saying directly to your heart: if you are true with Me, I guarantee you a life where no fear will stalk you and no grief will break you. This is the secret of real peace — not granted by wealth or power, but by being close to Allah, the One who holds all hearts in His mercy."
    },
    {
      "id": 9,
      "title": "يونس ٦٥",
      "verse_text": "يقول الله تعالى: ﴿وَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا ۚ هُوَ السَّمِيعُ الْعَلِيمُ﴾ [يونس: ٦٥]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية نزلت لتواسي قلب النبي ﷺ، الذي كان يسمع من المشركين كلمات قاسية، اتهامات، سخرية، وتكذيب. وهو الرحيم الرقيق كان يتأثر بما يقولون، لأن همّه الأكبر أن يهتدي الناس. فجاءه هذا الخطاب الحاني من ربه: ولا يحزنك قولهم. كأن الله يقول له: لا تسمح لكلماتهم أن تثقل قلبك، ولا تترك سخريتهم تجرح روحك، فأنت في مقام العزّة، والله معك.\nثم يبين له الحقيقة التي لا يغيّرها كلام البشر: إن العزة لله جميعًا. العزة ليست في كثرة الأتباع ولا في قوة السلاح ولا في زخارف الدنيا، بل هي ملك لله وحده. يعطيها لمن يشاء من عباده، ويمنعها عمّن يشاء. فإن كنت مع الله، فأنت في عزّ، حتى لو اجتمع عليك أهل الأرض كلهم. وإن أعرضت عنه، فأنت في ذلّ، ولو ملكت الدنيا كلها.\nوختمت الآية بصفتيه: هو السميع العليم. سميع يسمع كل كلمة قالوها، فلا يفوت عليه شيء مما جرح قلبك. عليم يعلم نواياهم ودواخلهم، ويعلم صدقك وصبرك. فكيف يحزنك كلام من لا يملك لك ضرًّا ولا نفعًا، وربك السميع العليم يراك ويسمعك؟\nابن كثير قال: “يقول تعالى لنبيه ﷺ: لا يحزنك تكذيب هؤلاء المشركين، فإن العزة لله وحده، وهو السميع لأقوالهم، العليم بنياتهم.” والطبري قال: “لا يغمّك قولهم فيك، فإن القوة والسلطان لله وحده، يسمع ما يقولون ويعلم ما يضمرون.” والسعدي قال: “فيها تسلية للرسول ﷺ ولكل مؤمن، أن لا يحزن من أذى الناس، فإن العزة الحقيقية لله، فمن اعتز به نال العزة، ومن طلبها بغيره ذلّ.”\nفتأمل يا عزيزي القارئ: كم من مرة حزنت بسبب كلام الناس، نقدهم، استهزائهم، أو حتى ظلمهم؟ هذه الآية تقول لك: لا تحزن، فقيمتك لا تحددها كلمات البشر، ولا مكانتك تُبنى على رأي الناس فيك. العزة كلها بيد الله، وهو يسمع ما يُقال عنك، ويعلم حقيقتك. فاجعل قلبك معلقًا به، وستشعر بعزّة داخلية لا يهزها قول أحد.",
      "english_content": "“And let not their speech grieve you. Indeed, all honor belongs to Allah entirely. He is the Hearing, the Knowing.” [Younus: 65]\nDear reader, this verse was revealed to comfort the heart of the Prophet ﷺ, who would hear from the disbelievers words of denial, mockery, and insult. His compassionate heart would ache, not for his own pride, but because he longed for people to be guided and feared for their fate. Allah, in His mercy, speaks directly to him: “And let not their speech grieve you.” It is as though Allah is saying: Do not allow their words to weigh on your heart or to wound your spirit, for their insults cannot diminish your worth nor the truth you carry.\nThen Allah declares the eternal reality: “Indeed, all honor belongs to Allah entirely.” True honor is not found in wealth, numbers, or worldly strength. It does not come from people’s praise or acceptance. Honor belongs to Allah alone, and He grants it to whomever He wills. If you are with Allah, then you stand in honor, even if the entire world turns against you. And if you turn away from Him, then you are in humiliation, even if the world crowns you with riches and power.\nThe verse concludes with His two attributes: “He is the Hearing, the Knowing.” Hearing, so that no word they utter escapes Him; every insult, every mockery, He hears it all. Knowing, so that He sees not only their speech but their hidden intentions, and at the same time, He knows the truth of your sincerity, your patience, and your pain. With such a Lord by your side, how could their words truly harm you?\nIbn Kathir said: “Allah says to His Prophet ﷺ: Do not be saddened by their denial, for honor is Allah’s alone, and He hears what they say and knows what they conceal.” Al-Tabari explained: “Their words cannot diminish you, for sovereignty and might belong to Allah, who hears and knows all things.” Al-Sa‘di added: “This verse is consolation for the Messenger ﷺ and for every believer: do not let the harm of people sadden you, for true honor is with Allah, and whoever seeks it from Him will never be humiliated.”\nSo reflect, dear reader: how often do we let people’s words cut into our hearts, their criticism or mockery shake our confidence, their gossip darken our days? This verse tells you: do not let their speech grieve you, for your worth is not measured by human tongues. Your honor rests with Allah alone, the One who hears everything said about you and knows the truth of who you are. If you hold onto Him, you will find a dignity and peace that no insult can take away."
    },
    {
      "id": 10,
      "title": "يوسف ٨٦",
      "verse_text": "يقول الله تعالى: ﴿قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى ٱللَّهِ وَأَعْلَمُ مِنَ ٱللَّهِ مَا لَا تَعْلَمُونَ﴾ [يوسف: ٨٦]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية تفتح لك نافذة على قلب يعقوب عليه السلام، وهو في أشد لحظات حزنه وألمه بعد أن فقد يوسف عليه السلام، ثم فقد أخاه، واشتدّت الكروب من حوله حتى ابيضّت عيناه من الحزن. ومع ذلك لم يكن يشتكي إلى الخلق، لم يكن يُلقي بثقله على الناس، بل لجأ إلى من بيده مفاتيح الفرج: إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ.\nكلمة بَثِّي تعني الهمّ الشديد الذي يفيض من الصدر ولا يستطيع صاحبه كتمانه، فهو البثّ الذي يتفرّق في الجوارح. ويجمعه مع الحزن في شكوى واحدة، لكنها شكوى ليست اعتراضًا ولا جزعًا، بل هي انكسار صادق بين يدي الله، إلقاءٌ كامل للألم بين يديه سبحانه.\nثم قال: وأعلم من الله ما لا تعلمون. أي أن حزنه لم يُخرجه من يقينه، بل كان يثق أن وراء هذا الابتلاء حكمة، وأن الله لن يضيّع يوسف، وأن رحمته أوسع من أن يتركه بلا فرج.\nابن كثير قال: “أي إنما أفوّض أمري إلى الله وأرفع شكواي إليه وحده، وأرجو منه ما لا ترجون.” والطبري قال: “أي لا أشكوكم ولا غيركم، إنما أشكو إلى الله ما نزل بي من الوجد على يوسف وأخيه.” والقرطبي أضاف: “الآية أصل في جواز الشكوى إلى الله، بل هي قربة، بخلاف الشكوى إلى المخلوقين.”\nفتأمل يا عزيزي القارئ، هذه الآية ليست مجرد قصة قديمة، بل هي درس لكل قلب مثقل بالحزن: لا تُكتم همّك حتى يُنهكك، ولا تنثر حزنك أمام الخلق فيخذلوك، بل ارفعه إلى الله، اشكُ إليه، ابكِ بين يديه، فهو السميع الرحيم. واعلم كما علم يعقوب: أن وراء الغيب رحمة، وأن حزنك لن يضيع عند الله، بل سيُبدّله فرحًا وطمأنينة في الوقت الذي يختاره سبحانه.",
      "english_content": "“He said, ‘I only complain of my suffering and my grief to Allah, and I know from Allah that which you do not know.’” [Yusuf: 86]\nDear reader, this verse opens a window into the heart of Prophet Ya‘qub (Jacob, peace be upon him) at the height of his sorrow. He had lost Yusuf, then his other son, and his grief was so deep that his eyes turned white from weeping. Yet notice: he did not complain to people, nor did he pour his sadness into the ears of creation. Instead, he turned fully to the Creator, saying: “I only complain of my suffering and my grief to Allah.”\nThe word “baththi” (suffering) means the overwhelming anguish that bursts out because it can no longer be contained. Ya‘qub combined it with “huzni” (my grief) in one statement — not as a protest or despair, but as an act of surrender. His complaint was not rejection of God’s decree; it was the pouring out of his broken heart in the safest place: before Allah alone.\nThen he added: “And I know from Allah that which you do not know.” Despite his pain, his faith was not shaken. He trusted that behind the veil of hardship, there was wisdom. He believed Yusuf was not lost forever, and that Allah’s mercy was far too vast to leave him without relief. His sorrow was heavy, but his certainty was heavier still.\nIbn Kathir explained: “He means: I entrust my affairs to Allah alone and present my complaint only to Him, while hoping for what you do not hope for.” Al-Tabari wrote: “He says: I do not complain to you or to anyone else, but to Allah alone about my grief over Yusuf and his brother.” Al-Qurtubi added: “This verse is the foundation of the legitimacy — even the devotion — of presenting one’s complaint to Allah, in contrast to complaining to creation.”\nSo reflect, dear reader: this verse is not only a glimpse of a Prophet’s sorrow, it is guidance for every heart weighed down by grief. When you feel crushed by sadness, you need not bottle it up until it breaks you, nor scatter it before people who may fail you. Take your sorrow to Allah. Cry to Him, whisper your grief, and lay your pain before the One who hears every heartbeat. And, like Ya‘qub, hold on to the knowledge that with Allah, there is always wisdom and mercy beyond what you can see.\nThis is the secret: grief does not vanish by hiding it or by venting it to people. It transforms when you turn it into a prayer, a plea, a whisper to Allah — the One who never turns away a broken heart."
    },
    {
      "id": 11,
      "title": "مريم ٢٤",
      "verse_text": "يقول الله تعالى: ﴿فَنَادَاهَا مِن تَحْتِهَا أَلَّا تَحْزَنِي قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا﴾ [مريم: ٢٤]",
      "content": "عزيزي القارئ، هذه الآية ترسم مشهدًا مؤثرًا من قصة مريم عليها السلام، في لحظة شديدة القسوة عليها، حين جاءها المخاض وحدها، بعيدة عن الناس، واشتدّ بها الألم والخوف والحرج. كانت بين نارين: ألم الولادة، وهاجس مواجهة قومها وهي تحمل وليدًا دون أب، فغلبها الحزن حتى تمنت الموت: ﴿يَا لَيْتَنِي مِتُّ قَبْلَ هَٰذَا وَكُنتُ نَسْيًا مَّنسِيًّا﴾.\nوفي ذروة هذا الانكسار، جاءها النداء من تحتها، قيل هو جبريل عليه السلام، أو عيسى عليه السلام وهو في المهد، ليقول لها: أَلَّا تَحْزَنِي. كلمة صغيرة لكنها كالمفتاح الذي يبدد ظلام الحزن. كأنها رسالة من السماء: يا مريم، لست وحدك، لا تجعلي الحزن يكسرك، فالله أعدّ لك الفرج.\nثم جاءتها البشارة العملية: قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا. السري هو الجدول الصغير الجاري من الماء، جعله الله عند قدميها لتشرب وتغتسل وتستعيد قوتها. مشهد عظيم: الحزن في أعلى درجاته، والفرج ينزل مباشرة من عند الله، رزقًا وطمأنينة.\nابن كثير قال: “أي ناداها جبريل أن لا تحزني، قد جعل ربك تحتك سريًّا أي جدول ماء.” والطبري قال: “أراد بالسريّ النهر الصغير الجاري، أي قد يسر الله لك ماءً عذبًا.” والقرطبي أضاف: “فيها دليل على أن الله إذا قضى أمرًا هيأ له أسبابه، وفيها تسلية لكل مهموم أن الله يفتح له باب فرج من حيث لا يحتسب.”\nفتأمل يا عزيزي القارئ، كيف يخاطبك الله من خلال قصة مريم: لا تحزن، حتى في أقسى لحظة، فإن الله يرسل لك رزقًا من حيث لا تتوقع، ويجعل بجانب ألمك نبعًا من الفرج. الحزن طبيعي، لكنه لا يدوم، فمع كل شدة يأتي نداء السماء: ألا تحزن.",
      "english_content": "“But he called her from below her, ‘Do not grieve; your Lord has provided beneath you a stream.’” [Maryam: 24]\nDear reader, this verse paints one of the most tender and powerful moments in the story of Maryam (Mary, peace be upon her). She was alone, carrying the weight of childbirth away from people, overwhelmed by the pain of labor and the fear of how her people would respond when they saw her with a child and no husband. Her sorrow reached such a depth that she wished for death: “Oh, I wish I had died before this and was in oblivion, forgotten.”\nIt is in that very moment of breaking, when despair pressed so heavily upon her, that a voice called to her from below — some scholars said it was Jibreel (Gabriel, peace be upon him), while others said it was her newborn son ‘Isa (Jesus, peace be upon him). And the first words she heard were: “Do not grieve.” Just two words, but they came like light breaking through darkness. It was not only comfort, it was a divine command, a reassurance from heaven itself: grief will not consume you, for Allah is with you.\nThen came the sign of relief: “Your Lord has provided beneath you a stream.” In the midst of her weakness, Allah opened for her a flowing stream at her feet, to drink, to wash, to restore her strength. SubhanAllah — grief had reached its peak, and immediately, provision descended. It is as if the verse is saying: whenever sorrow weighs you down, know that Allah has already placed relief close to you, perhaps nearer than you realize.\nIbn Kathir explained: “Jibreel called her, saying: Do not grieve, for your Lord has placed under you a stream of water.” Al-Tabari said: “The ‘sariyy’ (stream) refers to a small flowing river, which Allah provided for her at that moment.” Al-Qurtubi added: “The verse shows that when Allah decrees a matter, He facilitates its causes. It is also a comfort to every sorrowful soul that Allah can open a door of relief from where one least expects it.”\nSo reflect, dear reader: this verse is not just about Maryam; it is about you in your darkest moments. When grief presses you until you feel you cannot go on, hear the heavenly whisper: “Do not grieve.” Know that Allah has already placed your relief nearby, that your sorrow is not endless, and that with every hardship, He prepares a stream of mercy to refresh your soul."
    },
    {
      "id": 12,
      "title": "القصص ١٣",
      "verse_text": "يقول الله تعالى: ﴿فَرَدَدْنَـٰهُ إِلَىٰٓ أُمِّهِ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ ٱللَّهِ حَقّٞ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ﴾ [القصص: ١٣]",
      "content": "",
      "english_content": "“So We restored him to his mother that she might be comforted and not grieve, and that she would know that the promise of Allah is true. But most of them do not know.” [Al-Qasas: 13]\nDear reader, this verse reveals one of the most beautiful scenes of divine mercy and hidden care. It tells the moment when Allah returned baby Musa (Moses, peace be upon him) to his mother, after she had cast him into the river, trembling with fear but holding onto the promise of her Lord. Imagine her heart — a mother’s heart torn by separation, aching with the thought that she might never hold her child again.\nBut Allah, in His gentleness, says: “So We restored him to his mother.” This was not just the return of a child, it was the return of life to her heart. “That she might be comforted and not grieve.” Her eyes that had overflowed with tears were cooled, her soul that had been heavy with sorrow was relieved, and her trembling was replaced with peace. This is the kind of comfort only Allah can give — a healing that reaches the deepest wounds of the heart.\nThen Allah explains the wisdom: “and that she would know that the promise of Allah is true.” When she placed Musa in the river, she was not abandoning him to fate; she was entrusting him to Allah. And now, with her child safely back in her arms, Allah confirms His truth: when He promises protection, He fulfills it; when He guarantees care, He delivers it. This was a living proof for her — and for us — that Allah never breaks His promise.\nIbn Kathir wrote: “Just as We had promised her, We returned Musa to her safely, so that her eyes would be comforted and her sorrow lifted, and so she would know Our promise is true.” Al-Tabari explained: “Allah returned Musa to his mother so that her soul would be at rest and her grief removed, and to increase her certainty in the truth of her Lord’s promise.” Al-Qurtubi added: “This verse is a solace for every grieving heart: what Allah takes for a time, He may restore in ways beyond expectation, out of His mercy and wisdom.”\nSo reflect, dear reader: this verse is not only about the mother of Musa. It is also about you in your moments of loss. When something precious seems torn away from you, remember: if you entrust it to Allah, He can return it in a way that brings you comfort and erases your grief. His promise is always true, even if most people fail to see it. This is the hidden mercy of your Lord — to turn sorrow into relief, and despair into certainty."
    },
    {
      "id": 13,
      "title": "العنكبوت ٣٣",
      "verse_text": "يقول الله تعالى: ﴿وَلَمَّآ أَن جَآءَتۡ رُسُلُنَا لُوطٗا سِيٓءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعٗا وَقَالُواْ لَا تَخَفۡ وَلَا تَحۡزَنۡ إِنَّا مُنَجُّوكَ وَأَهۡلَكَ إِلَّا ٱمۡرَأَتَكَ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ﴾ [العنكبوت: ٣٣]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية تضعك في مشهد مليء بالتوتر والرهبة: لوط عليه السلام يستقبل الملائكة في صورة رجال، فيحزن ويضيق صدره؛ لأنه يعرف قومه وفسادهم، ويخشى أن يتعرض هؤلاء الضيوف للأذى. ضاق بهم ذرعًا أي شعر بالعجز والحرج، كأن الهموم أثقلت صدره حتى لم يجد لها مخرجًا.\nلكن هنا جاء صوت السماء: لا تخف ولا تحزن. كلمتان قصيرتان، لكنهما تمسحان جبالًا من الهم. لا تخف مما سيأتي، ولا تحزن على ما مضى، لأن الله تكفّل بالحماية. إنا منجوك وأهلك، وعد صريح بالنجاة، والملائكة أنفسهم يطمئنونه بأن الله أرسلهم لا ليُهينوه، بل لينقذوه من شرّ قومه، مع استثناء امرأته التي خانت طريق الإيمان فبقيت مع الهالكين.\nابن كثير قال: “سِيءَ بهم: أي حزن بسببهم، وضاق صدره خشية من قومه. فقيل له لا تخف ولا تحزن، إنا منجوك وأهلك إلا امرأتك.” والطبري قال: “سيء بهم: ساءه شأنهم، وضاق ذرعًا بما نزل به، فقيل له لا تحزن، فإن الله منجيك.” والقرطبي أضاف: “فيها دليل على أن من لجأ إلى الله فلن يخذله، وأن وعد الله بالنجاة حق لا يخلف.”\nفتأمل يا عزيزي القارئ، كيف أن قلب نبي يضيق، وتغشاه غيوم الحزن، لكن كلمة من الله تُبدّد كل ذلك: لا تخف ولا تحزن. هذا الدرس لك أيضًا: حين تواجه المجهول، أو حين يثقل قلبك بالخوف والحزن، تذكّر أن الله قادر أن يقول لك كما قال للوط: لا تخف ولا تحزن، إنا منجوك.",
      "english_content": "“And when Our messengers came to Lot, he was distressed for them and felt for them great discomfort. They said, ‘Do not fear and do not grieve. Indeed, we will save you and your family, except your wife; she is to be of those who remain behind.’” [Al-Ankaboot: 33]\nDear reader, this verse places you in a tense and emotional scene. Prophet Lot (Lut, peace be upon him) receives the angels, who came in the form of men. His heart sinks in sorrow and anxiety because he knows the corruption of his people and fears for the safety of his guests. The Qur’an describes his chest as “tightened with discomfort,” a phrase that captures the weight of helplessness when a person feels trapped and overwhelmed.\nBut then comes the soothing voice of the angels: “Do not fear and do not grieve.” Two short phrases, yet they sweep away mountains of distress. Fear relates to what lies ahead, grief relates to what has already passed — and Allah lifts both from him in a single moment. Then comes the promise: “Indeed, we will save you and your family, except your wife.” It is assurance that he is not alone, that divine protection is already in place, that salvation is certain for him and those who believed with him.\nIbn Kathir explained: “He was saddened by their presence and distressed because of his people, but they comforted him, telling him not to fear or grieve, for Allah would deliver him and his family, except his wife who remained in disbelief.” Al-Tabari wrote: “His heart was weighed down, but the angels reassured him: no fear of what is to come, no grief for what has passed; you are among the saved.” Al-Qurtubi added: “This is proof that whoever seeks refuge in Allah will never be abandoned, and that His promise of deliverance is always true.”\nSo reflect, dear reader: this verse is not only about Lot. It is also about you when you feel cornered by fear and drowned in sorrow. Allah is able to send you reassurance, just as He did for His Prophet: “Do not fear and do not grieve. Indeed, we will save you.” And when salvation comes from Allah, no force in the world can prevent it."
    },
    {
      "id": 14,
      "title": "الحجر ٩٧",
      "verse_text": "يقول الله تعالى: ﴿وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ﴾ [الحجر: ٩٧]",
      "content": "عزيزي القارئ، هذه الآية الكريمة تخاطب قلب النبي صلى الله عليه وسلم في لحظة بشرية صعبة، حين كان يسمع أذى المشركين واستهزاءهم وكلماتهم الجارحة. الله العليم الخبير يخبره: لقد علمنا بما يجري في صدرك، وبما يضيق به قلبك مما تسمع. إن مجرد علم الله بحالك هو في حد ذاته سلوى عظيمة، فكيف إذا أضاف إلى ذلك التثبيت والرحمة؟\nهذه الآية تكشف عن قرب الله من عباده، وأنه لا يغفل عن آلامهم الداخلية التي لا يراها الناس. قد تُخفي حزنك عن أقرب الناس إليك، لكن الله يراه ويسمعه ويعلمه. وما يزيد المعنى قوة أن الله لم يُنكر على نبيه ضيق الصدر، لأنه شعور طبيعي يمر به الإنسان، بل أقره وأحاطه بعلمٍ رحيم.\nابن كثير قال: أي نعلم يا محمد أنك تتألم من قولهم وتضيق نفسك به، فلا تحزن، فإن لك عندنا رفعة وذكراً علياً. والطبري قال: هذا خطاب فيه تأنيس للنبي وتثبيت، كأنه يقول: لا يخفى علي ما تلقى من أذى، وأنا معك بالنصر والتأييد. والقرطبي أضاف: فيه دليل على أن من لحقه ضيق صدر من أذى أو كلام جارح فليعلم أن الله يعلمه ويجبر كسره.\nفتأمل يا عزيزي القارئ، كم في هذه الكلمات من بلسم للقلوب المهمومة. إذا كان الله قد خاطب نبيه في ضيق صدره مواسياً، فهو يخاطبك أنت أيضاً. كل كلمة جارحة سمعتها، كل أذى مررت به، كل ضيق يعتصر قلبك… الله يعلمه، ولم يتركك، بل يفتح لك باب الصبر واليقين بوعده. وهذه هي الطمأنينة الكبرى: أنك لست وحدك، بل معك رب رحيم، يعلم ضيق صدرك ويعوضك بسعة رحمته.",
      "english_content": "\"And We certainly know that your breast is constrained by what they say.\" [Al-Hijr: 97]\nDear reader, this verse gently touches the heart of the Prophet ﷺ in one of his most human moments, when he faced the mockery, insults, and hurtful words of his people. Allah, the All-Knowing, tells him: We know the pain inside your chest, the tightness that fills you because of what they say. The fact that Allah Himself acknowledges the Prophet’s grief is in itself a profound comfort, and then He surrounds it with His mercy and reassurance.\nThis verse reminds us that Allah is not distant from the pain of His servants. He sees the sorrow that no one else can see, He hears the silent cries that never reach another’s ear, and He knows the weight that bends your heart. You may hide your grief from the closest people around you, but it is never hidden from Him.\nIbn Kathir explained: Allah knew, O Muhammad, that you are hurt by what they say, but He reassures you of your lofty status and the honor He has prepared for you. Al-Tabari wrote: This is divine comfort and strengthening, as if to say: we see your struggle, but you are not alone—I am with you with victory and support. Al-Qurtubi added: This verse shows that if a believer feels his chest tighten from others’ harm or words, let him know that Allah is aware and will mend his brokenness.\nSo reflect, dear reader: if Allah comforted His beloved Prophet in his moments of heaviness, then surely these words are for you too. Every insult that pierced your heart, every wound caused by others’ speech, every sorrow that makes your chest tighten—Allah knows it. He does not leave you alone in that pain, but promises His nearness, His healing, and His vast mercy. This is the greatest solace: to know that your hurt is fully seen by the One who can heal it completely."
    },
    {
      "id": 15,
      "title": "الحجر ٨٨",
      "verse_text": "يقول الله تعالى: ﴿لَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ﴾ [الحجر: ٨٨]",
      "content": "عزيزي القارئ، هذه الآية الكريمة تأتي كرسالة حانية من الله إلى نبيّه ﷺ، تحمل بين طياتها دواءً للحزن وشفاءً للصدر. فهي تذكره أولًا: لا تنظر إلى ما متعنا به أقوامًا من زينة الدنيا وزخرفها. هذه الدنيا ليست معيار الكرامة، ولا دليل المحبة، بل مجرد متاع زائل يُعطى ويُسلب. هنا يعلّم الله نبيّه أن لا يلتفت قلبه ولا تنشغل عينه بما عند أهل الدنيا من زخارف، لأن ما عند الله أعظم وأبقى.\nثم يطمئنه بقوله: وَلَا تَحۡزَنۡ عَلَيۡهِمۡ. أي لا يضيق صدرك ولا يثقل قلبك من أجلهم، سواء بكفرهم أو بتقلبهم في النعيم، فإن مصيرهم بيد الله، وعدله نافذ فيهم. الحزن على الناس رحمة، لكن الله يعلّم نبيّه أن لا يجعل هذا الحزن عائقًا عن السير في طريق الدعوة.\nويختم الآية بأمر يفيض رقة: وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ. صورة بديعة، يُشبه النبي ﷺ بالطائر الذي يخفض جناحه ليدني الرحمة والحنان على فراخه. هكذا يجب أن يكون مع المؤمنين: متواضعًا، رحيمًا، قريبًا، يُظلّهم بلطفه ورعايته.\nابن كثير قال: أي لا تمدن عينيك معجبًا بما هم فيه من النعيم، فإنما هو فتنة لهم وزينة زائلة، واصرف همك إلى المؤمنين وارفق بهم. الطبري ذكر: المعنى لا تنشغل بما أعطيناهم من متاع، فإنه إلى انقطاع، ولكن اخفض جناحك للمؤمنين رحمة وتواضعًا. والقرطبي قال: هذه الآية تربية للنبي ﷺ أن يزهد في الدنيا، ويجعل همّه الآخرة، ويكون رفقه وعطفه لأهل الإيمان.\nتأمل يا عزيزي القارئ: كم مرة شعرت بالضيق لأنك رأيت غيرك يملك ما لا تملك؟ أو حزنت لأن أهل الباطل يتقلبون في النعيم وأنت تكابد الطريق؟ هذه الآية دواء لك. لا تُرهق قلبك بالمقارنة، ولا تُحزن نفسك بما في أيدي غيرك، فما عند الله أعظم. وبدلًا من أن يستهلكك الحزن على من ضل، اصرف قلبك لمدّ الرحمة والحنان لإخوانك وأحبتك من المؤمنين، فهم زادك في الطريق، وهم عونك في الدنيا، وهم رفقاؤك إلى الجنة.",
      "english_content": "\"Do not extend your eyes toward that by which We have given enjoyment to [certain] categories of them, and do not grieve over them. And lower your wing to the believers.\" [Al-Hijr: 88]\nMy dear reader, this verse comes as a gentle, soothing message from Allah to His Prophet ﷺ, carrying within it both comfort and direction for the heart. First, it reminds him: Do not look longingly at what We have allowed others to enjoy of worldly adornments and temporary pleasures. This fleeting world is not the measure of honor, nor the sign of divine love. It is but a passing enjoyment, granted and taken at will. Here Allah teaches His Prophet not to let his heart or eyes be occupied by what people possess, for what is with Allah is far greater and everlasting.\nThen comes the reassurance: And do not grieve over them. Do not let your heart be burdened or your chest constrained because of them — whether due to their disbelief, or their indulgence in worldly luxuries. Their destiny lies in Allah’s hands, and His justice will surely reach them. Grieving over people shows mercy, but Allah instructs His Prophet not to allow that grief to hinder the mission of truth.\nAnd finally, the verse closes with a tender command: And lower your wing to the believers. A beautiful image, likening the Prophet ﷺ to a bird that lowers its wings to shelter and comfort its young. Such should he be with the believers — gentle, compassionate, humble, spreading over them his care and mercy.\nIbn Kathir explains: “Do not let your eyes be dazzled by what they possess of worldly wealth, for it is a trial for them and a fleeting adornment. Instead, focus your care on the believers and treat them with kindness.” Al-Tabari comments: “Do not be occupied with what We gave them of enjoyment, for it will vanish; rather, lower your wing in mercy and humility for the faithful.” Al-Qurtubi adds: “This verse is a nurturing for the Prophet ﷺ — to renounce the world, focus on the Hereafter, and direct his tenderness and affection to the people of faith.”\nSo, reflect, my dear reader: how many times have you felt distress when you saw others possessing what you did not? Or sorrow because people of falsehood seemed to enjoy ease while you struggled on the path? This verse is the cure for that pain. Do not weigh your worth by the possessions of others. Do not let grief consume you over those far from guidance. Instead, turn your heart toward mercy, humility, and love for your fellow believers. They are your companions on the journey, your support in this life, and, God willing, your companions in Paradise."
    },
    {
      "id": 16,
      "title": "طه ٤٦",
      "verse_text": "يقول الله تعالى: ﴿قَالَ لَا تَخَافَآۖ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾ [طه: ٤٦]",
      "content": "عزيزي القارئ، هذه الآية نزلت في لحظة مهيبة من قصة موسى وأخيه هارون عليهما السلام، حين أمرهما الله أن يذهبا إلى أعتى طاغية في التاريخ، فرعون، الذي ادّعى الألوهية وقال: ﴿أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ﴾. تخيل الرهبة التي قد تدخل القلب حين يُكلّف إنسانان ضعيفان بمواجهة ملك متجبر يملك الجنود والسلطان. إنّه موقف يثير الخوف الطبيعي في النفس البشرية.\nفجاء صوت الله عز وجل ليغمر قلبيهما بالسكينة: ﴿لَا تَخَافَآۖ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾. ما أعظمها من بشارة! لم يقل لهما: \"سأرسل لكم مددًا الآن\" أو \"سأحميكما من بعيد\"، بل قال: إني معكما. وهذه المعية الإلهية ليست كأي معية، بل معية بالرعاية والنصر والحفظ والاطلاع.\nابن كثير يقول: “أي لا تخافا من فرعون ولا من جنوده، فإني معكما بعوني ونصري، أسمع كلامكما وما يجيبانكما به، وأرى مكانكما ومكانهما.” والطبري يوضح: “إني معكما بالحفظ والتأييد، أسمع قولكما وأرى فعلكما، فلا يصل إليكما شيء تكرهان.” وأما القرطبي فيعلق: “هذه أعظم آية في رفع الخوف، فإن من علم أن الله معه سكنت روحه وزال فزعه.”\nوهنا، عزيزي القارئ، يكمن الدرس لك أنت أيضًا: كم من موقف في حياتك تخشاه؟ كم من طريق مجهول تتردد في دخوله؟ كم من عدو أو همّ أو مرض أو ضيق تقف أمامه خائفًا؟ هذه الآية تخاطبك أنت كما خاطبت موسى وهارون: لا تخف، إنني معك. فالله يسمع همسك ويرى حالك، ولن يتركك وحدك.\nفتأمل كيف أن الخوف ذاب من قلبي النبيين أمام هذا الوعد العظيم، وسارا إلى فرعون بثبات ويقين. وأنت كذلك، إن وضعت ثقتك في الله واستحضرت معيته، سترى أن الخوف مجرد وهم أمام عظمة القرب من الله.",
      "english_content": "“He [Allah] said, Do not fear; indeed, I am with you both. I hear and I see. [Taha: 46]”\nMy dear reader, this verse captures one of the most profound moments of reassurance in the Qur’an. Imagine the scene: two men, Musa and his brother Harun (peace be upon them), are sent by Allah to confront the mightiest tyrant in history, Pharaoh, who declared arrogantly, “I am your lord most high.” The natural reaction of any human heart would be fear—fear of rejection, of harm, of the overwhelming power of an oppressor.\nBut then comes this divine comfort: “Do not fear; indeed, I am with you both.” Notice, Allah does not merely say, “I will protect you” or “I will send help.” Instead, He promises His very presence—I am with you. This is not a distant guardianship, but a close, intimate companionship filled with divine care, protection, and oversight.\nIbn Kathir explains: “Meaning, do not fear Pharaoh or his soldiers, for I am with you both with My support and assistance; I hear what you say and what they reply, and I see your place and their place.” Al-Tabari adds: “I am with you by guarding you and aiding you; I hear your speech and see your actions, and nothing of your condition is hidden from Me.” Al-Qurtubi beautifully comments: “This is the greatest verse for removing fear, for whoever knows that Allah is with him, his soul finds peace and his terror vanishes.”\nMy dear reader, the lesson is timeless. How many situations in your own life fill you with fear—whether from people, circumstances, or the unknown future? This verse speaks directly to you as it once spoke to Musa and Harun: Do not fear; indeed, I am with you. Your Lord hears every whisper of your heart and sees every step you take. You are never abandoned, never left alone.\nThe prophets walked into the court of the most arrogant man of their time without trembling, because they carried this promise in their hearts. You, too, can walk into your fears with the same assurance: when Allah is with you, nothing else has power over you."
    },
    {
      "id": 17,
      "title": "الأنبياء ١٠٣",
      "verse_text": "يقول الله تعالى: ﴿لَا يَحْزُنُهُمُ ٱلۡفَزَعُ ٱلۡأَكۡبَرُ وَتَتَلَقَّـٰهُمُ ٱلۡمَلَـٰٓئِكَةُ هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمۡ تُوعَدُونَ﴾ [الأنبياء: ١٠٣]",
      "content": "عزيزي القارئ، هذه الآية الكريمة من سورة الأنبياء تفتح أمامنا مشهدًا مهيبًا من مشاهد الآخرة، ذلك اليوم الذي وصفه الله ﴿ٱلۡفَزَعُ ٱلۡأَكۡبَرُ﴾، أي الهول الأعظم والرعب الأكبر الذي يملأ قلوب الخلائق حين يُنفخ في الصور، وتُبدل الأرض غير الأرض، وتتناثر النجوم، وتتفطر السماء، ويقف الناس جميعًا بين يدي الله.\nلكن هنا يطمئن الله عباده المؤمنين، فيقول: ﴿لَا يَحْزُنُهُمُ ٱلۡفَزَعُ ٱلۡأَكۡبَرُ﴾، أي أنهم في مأمن من ذلك الرعب، محاطون بسكينة وطمأنينة من الله. ابن كثير يقول: “أي لا يفزعهم حين يفزع الناس ولا يروعهم حين يروع الناس.” والطبري يضيف: “هم المؤمنون الذين آمنوا بالله وصدقوا رسله، لا يصيبهم ذلك الخوف الذي يصيب غيرهم من الكفار.”\nوتأمل عزيزي القارئ، أن الله لم يكتفِ برفع الخوف عنهم، بل أكرمهم بأعظم من ذلك: ﴿وَتَتَلَقَّـٰهُمُ ٱلۡمَلَـٰٓئِكَةُ﴾. الملائكة تستقبلهم استقبال المكرمين، تبشرهم وتطمئنهم: ﴿هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمۡ تُوعَدُونَ﴾. أي هذا يومكم الذي كنتم تسمعون عنه في الدنيا، يوم الوفاء بالوعد، يوم الجزاء، يوم الفرح الحقيقي بعد طول صبرٍ وتعب.\nالقرطبي قال: “أي تبشرهم الملائكة بالنجاة من النار وبالخلود في الجنة.” وكأن الملائكة تحمل رسالة الله لعباده: اليوم هو ثمرة إيمانكم وصبركم، اليوم هو جزاء ثباتكم، اليوم هو بداية الأبد الذي لا حزن فيه ولا خوف.\nيا عزيزي القارئ، إذا شعرت في الدنيا بأثقال الحزن أو بالقلق من المستقبل، فتذكر هذه الصورة القرآنية: الفزع الأكبر نفسه، الذي لا يطيقه بشر، لن يمس قلب المؤمن. لأن الله تكفّل أن يطمئنه ويؤمنه، وأن يرسل ملائكته خصيصًا لتستقبله. فما بالك بأحزان الدنيا الصغيرة؟ أليست أهون من ذلك بكثير؟ فإذا كان الله وعدك أن يحميك من هول الآخرة، أفلا يحميك من هموم هذه الحياة؟\nهذه الآية درس عميق: أن الطمأنينة ليست من الظروف ولا من الدنيا، بل من وعد الله. ومن تمسك بالوعد، عاش قلبه مطمئنًا مهما كان حوله من خوف.",
      "english_content": "\"They will not be grieved by the greatest terror, and the angels will meet them, [saying], 'This is your Day which you have been promised.'\" [Al-Anbiya: 103]\nDear reader, this verse from Surah Al-Anbiya paints for us a breathtaking scene of the Hereafter. It speaks of the “greatest terror”, the unimaginable horror of the Day of Judgment when the heavens are torn apart, the earth is shaken, the stars are scattered, and mankind stands in absolute awe before their Creator. On that Day, fear and panic will overtake all hearts — but not the hearts of the believers.\nAllah assures them: “They will not be grieved by the greatest terror.” Imagine that, while all of creation trembles, the believers will be wrapped in a divine calm, untouched by fear. Ibn Kathir explains: “They will not be terrified when the people are terrified, nor will they be alarmed when the people are alarmed.” Al-Tabari adds: “It refers to the believers who trusted in Allah and His Messengers; the terror that seizes others will not touch them.”\nAnd more than just safety, they are honored. The verse continues: “and the angels will meet them.” The angels come to greet them with warmth and reassurance, carrying Allah’s message: “This is your Day which you have been promised.” The scholars said this is the day of fulfillment — the day when all the promises of Allah about mercy, reward, and Paradise become reality.\nAl-Qurtubi beautifully remarked: “The angels will greet them with salvation from the Fire and glad tidings of eternal residence in Paradise.” It is as if the angels are saying: This is the moment you waited for. This is the day you lived for. This is the reward of your faith and patience.\nDear reader, reflect on this. If Allah protects His servants from the terror of the Day of Judgment — the greatest terror that creation will ever know — then surely He can shield your heart from the smaller griefs of this world. If He sends angels to comfort His believers in the Hereafter, will He not send tranquility to your heart when you call upon Him now?\nThis verse is a lantern in the darkness of sorrow. It whispers to you: the promise of Allah is true, and the terror you fear — whether in this life or the next — will not touch you if you remain close to Him."
    },
    {
      "id": 18,
      "title": "النحل ١٢٧",
      "verse_text": "يقول الله تعالى: ﴿وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ﴾ [النحل: ١٢٧]",
      "content": "عزيزي القارئ، هذه الآية العظيمة نزلت لتصبّر قلب النبي ﷺ، لكنها في حقيقتها بلسم لكل قلب مثقل بالحزن. الله جل جلاله يأمر نبيه: \"واصبر\"، لكن ليس أي صبر، بل صبر متصل بالله: \"وما صبرك إلا بالله\". وكأن الآية تقول: لا تعتمد على قوة نفسك، ولا على تحمّلك وحدك، فإن النفس تضعف والقلب ينهار، ولكن إذا أسندت صبرك على الله، صار الصبر سندًا لا ينكسر.\nثم يوجهه ربه: \"ولا تحزن عليهم\". هؤلاء الذين كفروا، أو كادوا، أو آذوا، لا يستحقون أن يرهقوا قلبك بالحزن. ليس لأن الحزن ممنوع، بل لأن المؤمن يعلم أن مصير الناس بيد الله، يهدي من يشاء ويضل من يشاء، فليس على قلبك أن يحمل همًّا يفوق طاقته.\nويضيف: \"ولا تك في ضيق مما يمكرون\". المكر، الكيد، المؤامرات التي تحاك ضدك، لا تدعها تحاصرك من الداخل. لأن الله، الذي أمرك بالصبر، هو نفسه الذي يكشف المكر ويبطله. قال ابن كثير: “أي اصبر على أذاهم وتوكل على الله، فإنه هو الذي يعينك عليهم ويكفيك مكرهم.” وقال الطبري: “نهاه الله أن يضيق صدره بما يمكر به أعداؤه، فإنه معه بالنصر والتأييد.”\nعزيزي القارئ، تأمل كيف يربط الله بين ثلاثة أشياء: الصبر بالله، ترك الحزن، الاطمئنان من المكر. هذه مفاتيح الطمأنينة في الدنيا. فإذا ضاق صدرك من أذى الناس، أو حزنت على من لم يهتدِ، أو شعرت بثقل مؤامرات الحياة ضدك، فارجع إلى هذه الآية. فيها وعد بأن الله لن يتركك وحدك.\nوهنا عبرة أخرى: النبي ﷺ، وهو أحب خلق الله، مرّ عليه الحزن والضيق حتى احتاج ربه أن يسكب عليه هذه الكلمات. فكيف بنا نحن؟ إن الحزن جزء من طبيعة الدنيا، لكن الدواء دائمًا أن تسند قلبك إلى الله.\nفتذكّر يا عزيزي القارئ: لا تجعل همّك يسرق قلبك، ولا حزنك يعميك عن نور الله، بل اجعل صبرك بالله، واستودع حزنك عنده، وستجد أن المكر يزول والضيقة تنفرج، ويبقى قلبك مطمئنًا برعاية من لا يغفل عنك لحظة.",
      "english_content": "“And be patient, and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.” [An-Nahl: 127]\nDear reader, this verse is like a soothing balm poured upon a wounded heart. Allah addresses His beloved Prophet ﷺ, but in truth, these words are meant for every broken soul. “And be patient”—but not just any patience. This is not about gritting your teeth or forcing your heart to endure. Allah reminds: “Your patience is not but through Allah.” In other words, true patience comes when you hand over your weakness to Him and let His strength carry you. Alone, the heart collapses; with Allah, it stands firm.\nThen He says: “Do not grieve over them.” Do not let your heart sink because of those who turn away, mock, or deny the truth. Their choices are in Allah’s hands, not yours. Your duty is to call and to live with sincerity; the rest belongs to the One who guides and misguides.\nAnd finally: “Do not be in distress over what they conspire.” Plots, schemes, the hidden whispers of those who wish you harm—they may appear heavy, but their weight dissolves in the face of Allah’s protection. Ibn Kathir commented: “Be patient with their harm and rely on Allah, for He alone aids you and suffices against their schemes.” Al-Tabari added: “Allah forbade His Prophet’s heart from narrowing due to their plots, for He is with him by victory and support.”\nDear reader, notice how Allah ties together three healing lessons: patience that comes from Him, relief from grief, and freedom from fear of conspiracies. This is a divine prescription for every troubled soul. If you’ve ever felt crushed by people’s words, burdened by grief, or haunted by worries about what others might do, return to this verse.\nEven the Prophet ﷺ—beloved of Allah, the strongest of hearts—felt sorrow and heaviness until Allah comforted him with these words. And if he needed them, then how much more do we?\nSo remember, dear reader: your patience is not your own, it’s Allah carrying you. Your grief does not belong to you, it belongs to the One who heals. And their plots are nothing when the Protector Himself has you under His care. Entrust your heart to Him, and you will find light in the very place you thought only darkness existed."
    },
    {
      "id": 19,
      "title": "محمد ٣٥",
      "verse_text": "يقول الله تعالى: ﴿فَلَا تَهِنُوا وَتَدۡعُوآ إِلَى ٱلسَّلۡمِ وَأَنتُمُ ٱلۡأَعۡلَوۡنَۗ وَٱللَّهُ مَعَكُمۡ وَلَن يَتِرَكُمۡ أَعۡمَـٰلَكُمۡ﴾ [محمد: ٣٥]",
      "content": "عزيزي القارئ، هذه الآية الكريمة تأتي كاليد التي ترفع قلبك إذا أثقله الحزن أو أوشك على الانكسار. الله يخاطب المؤمنين: فلا تهنوا، أي لا تضعفوا ولا تستسلموا لما يثقل صدوركم من هموم أو مكائد أو مشقة الطريق. وكأن الله يقول: \"ارفع رأسك، فالقوة ليست في الجسد بل في روحك التي تتعلق بي\".\nثم يضيف: ولا تدعوا إلى السلم وأنتم الأعلون. ليس المقصود السلام بمعناه المحمود، بل هنا الاستسلام الضعيف الذي يأتي من وهن النفوس وخوفها. الله يذكرك: أنت الأعلى بإيمانك، أنت الأعلى برضا الله عنك، أنت الأعلى لأنك تمسك بالحبل المتين الذي لا ينقطع.\nوالله معكم—هذه الجملة وحدها كفيلة بأن تُسكن قلوب أهل الحزن جميعًا. معيتُه هنا ليست مجرد علمه بك، بل نصره، وتأييده، وحفظه، ولطفه. فحين تشعر أنك وحيد وسط الهموم أو أن الناس قد تخلوا عنك، اقرأ هذه الكلمة وتذكر: الله معك، فكيف يضيع قلبك؟\nثم يختم بقوله: ولن يتركم أعمالكم، أي لن يضيع الله شيئًا من عملك ولا دمعة بكيتها خفية، ولا تنهيدة رفعتها في جوف الليل، ولا صبر صبرته حين انكسر قلبك. كل ذلك محفوظ عنده، مكتوب في صحيفتك، يُجزى به يوم لا ينفع مال ولا بنون.\nالطبري رحمه الله قال: “أي لا تضعفوا عن جهاد أعدائكم، وأنتم الغالبون بنصر الله ومعيته، والله لن ينقصكم ثواب أعمالكم.” وابن كثير قال: “فيها تثبيت للمؤمنين أن عاقبتهم النصر، وأن الله لا يترك لهم حسنة إلا حفظها وجازاهم عليها.” والقرطبي أشار إلى أن الآية تحمل وعدًا صريحًا بحفظ الأعمال وردّ الكيد مهما كان.\nفتأمل، يا عزيزي القارئ: الآية ليست فقط نداءً للمجاهدين في سبيل الله، بل هي نداء لك في معركتك الخاصة مع الحزن. لا تهن أمام ضغوط الدنيا، لا تستسلم لليأس وأنت صاحب إيمان يرفعك فوق الهموم، تذكر أن الله معك، وأن كل جهد أو صبر أو دمعة لن تضيع.",
      "english_content": "“So do not weaken and call for peace while you are superior; and Allah is with you and will never deprive you of [the reward of] your deeds.” [Muhammad: 35]\nMy dear reader, this verse comes like a hand that lifts your heart when it feels heavy with sorrow or close to breaking. Allah addresses the believers: “Do not weaken,” meaning do not let your spirits collapse, do not surrender to the burdens that weigh down your chest—be they worries, the plots of others, or the hardships of the path. It is as if Allah is saying: “Raise your head high, for true strength is not in the body, but in the soul that clings to Me.”\nThen He adds: “And do not call for peace while you are superior.” Here, the peace meant is not the praiseworthy peace of reconciliation, but the weak surrender that comes from broken souls and fearful hearts. Allah reminds you: you are the higher ones—higher through faith, higher through Allah’s pleasure with you, higher because you hold tightly to the rope of Allah that never breaks.\nAnd then, the most comforting phrase: “And Allah is with you.” These words alone are enough to soothe every grieving heart. His ma‘iyyah—His “being with you”—is not just His knowledge of you, but His support, His aid, His protection, His mercy. So when you feel alone in your sadness, when you think people have abandoned you, read these words and remember: Allah is with you. How, then, could your heart ever be truly lost?\nFinally, Allah assures you: “And He will never deprive you of the reward of your deeds.” Nothing is wasted—no hidden tear, no sigh lifted in the stillness of the night, no patience you bore while your heart was breaking. Every effort is preserved, written in your record, and will be rewarded on the Day when neither wealth nor children will avail, but only a sound heart.\nAl-Tabari explained: “Do not weaken in striving against your enemies, for you are the victorious with Allah’s help and His company. And Allah will never diminish the reward of your deeds.” Ibn Kathir said: “It is a firm reassurance to the believers that the final outcome will be victory, and that Allah does not neglect a single good deed, but preserves it and rewards it fully.” Al-Qurtubi added that this verse is a clear promise of preserved deeds and the defeat of every scheme against you.\nSo reflect, my dear reader: this verse is not only an address to those who fought in Allah’s path long ago—it is a personal address to you in your private battle with grief. Do not collapse before the pressures of life, do not surrender to despair while you are lifted by faith above all burdens. Remember: Allah is with you, and every effort, every tear, every endurance is treasured by Him."
    },
    {
      "id": 20,
      "title": "الزمر ٦١",
      "verse_text": "يقول الله تعالى: ﴿وَيُنَجِّي ٱللَّهُ ٱلَّذِينَ ٱتَّقَواْ بِمَفَازَتِهِمۡ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمۡ يَحۡزَنُونَ﴾ [الزمر: ٦١]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية كأنها تفتح لك بابًا من الرحمة والطمأنينة، لتقول لك: إن طريق التقوى ليس ضياعًا ولا تعبًا بلا ثمرة، بل هو النجاة الحقيقية. الله تعالى يخبرنا أنه سينجي الذين اتقوه، أي الذين جعلوا بينهم وبين غضبه وقاية، بسلوكهم المستقيم، وخشيتهم، وحرصهم على رضاه. يقول: ﴿بِمَفَازَتِهِمۡ﴾، أي بفوزهم العظيم، بنجاتهم من كل سوء، وبحصولهم على ما كانوا يرجونه من رحمة ورضوان.\nوانظر إلى التعبير: ﴿لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمۡ يَحۡزَنُونَ﴾. إنه وعد إلهي مؤكد بأنهم سيكونون في أمان تام، لا يصل إليهم شر ولا يحزنهم شيء. لا ألم يطرق قلوبهم، ولا حزن يعكر صفوهم. وهذه أعظم بشارة للمؤمن في الدنيا قبل الآخرة: أنك حين تختار طريق الله، فإنك تختار الطمأنينة التي لا تُشترى بمال ولا تُنال بسلطان.\nابن كثير رحمه الله قال: “أي ينجيهم الله يوم القيامة بما كتب لهم من السعادة، فلا يمسهم السوء، ولا يلحقهم فزع ولا حزن.” والطبري قال: “يفوزون برضا الله عنهم، وينجون من عذابه، فلا ينالهم سوء، ولا يدخل الحزن إلى قلوبهم.” والسعدي أضاف: “هذه الآية تجمع بين السلامة من المكروه، وحصول كل محبوب.”\nفتأمل يا عزيزي القارئ، كيف أن الله يربط النجاة في الدنيا والآخرة بالتقوى. كثيرون اليوم يبحثون عن طرق النجاة من الهموم والأحزان، لكن الله يلخص الطريق في كلمة واحدة: التقوى. اجعل بينك وبين معصيته وقاية، اجعل قلبك حيًا بذكره، وستجد أن الله يفتح لك أبواب الطمأنينة التي لا تُغلق.\nكأن الآية تقول لك: لا تقلق من الحزن الذي يطوق صدرك الآن، ولا تخف من السوء الذي قد يأتيك غدًا. إذا كنت من المتقين، فالله يتولى أمرك، ينجيك، ويحملك إلى مفازتك، إلى فوزك الذي لا ينتهي.",
      "english_content": "“And Allah will deliver those who feared Him to their place of success; no evil will touch them, nor will they grieve.” [Al-Zumar: 61]\nListen, dear reader, this verse opens a door of mercy and reassurance. It tells you that the path of piety is never wasted, nor is it a journey without reward. Allah promises that those who lived with taqwa—those who placed a barrier between themselves and His anger through obedience, humility, and seeking His pleasure—will be delivered safely to their ultimate triumph. The word mafāzatihim means their place of victory, their salvation, and the attainment of everything they longed for in the Hereafter.\nNotice the expression: “no evil will touch them, nor will they grieve.” It is a divine guarantee of complete safety. No harm will reach them, no sadness will overwhelm their hearts. Imagine a life free of sorrow, where no shadow of fear or regret follows you—this is the state promised by Allah to His faithful servants.\nIbn Kathir explained: “Allah will save them on the Day of Judgment by what He has written for them of happiness, so no harm will touch them, nor will they grieve.” Al-Tabari said: “They will attain Allah’s pleasure and escape His punishment; no evil reaches them, and no grief enters their hearts.” Al-Sa‘di beautifully summed it up: “This verse combines two things: safety from all that is disliked and the attainment of all that is beloved.”\nSo reflect, dear reader: Allah ties salvation in both worlds to taqwa. People today search for relief from grief and for ways to protect themselves from life’s harms, yet here Allah gives the simplest answer: be mindful of Him, and He Himself will secure you.\nIt is as though this verse whispers to your heart: Do not be afraid of tomorrow’s trials, and do not let today’s sorrows consume you. If you belong to the people of taqwa, Allah Himself will carry you to safety and victory, shielding you from all evil, and granting you peace that no one can take away."
    },
    {
      "id": 21,
      "title": "هود ٣٣",
      "verse_text": "يقول الله تعالى: ﴿قَالَ إِنَّمَا يَأۡتِيكُم بِهِ ٱللَّهُ إِن شَآءَ وَمَآ أَنتُم بِمُعۡجِزِينَ﴾ [هود: ٣٣]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية جاءت على لسان نبي الله نوح عليه السلام حين طالبه قومه بأن يأتيهم بالعذاب الذي كان يحذرهم منه إن كان صادقًا. فجاء رده صريحًا واضحًا: ليس الأمر بيدي، ولا أملك إنزال العذاب ولا رفعه، إنما هو بيد الله وحده، إن شاء أن ينزله فعل، وأنتم لا تستطيعون الهرب منه ولا دفعه.\nهذه الآية تعلمنا معنى عميقًا في التوكل والتسليم. نوح عليه السلام لم ينجرّ إلى جدالٍ عقيم، ولم يحاول أن يُثبت صدقه بإرادته الخاصة، بل ردّ القوم إلى الحقيقة الكبرى: أن الله هو صاحب الأمر، والعبد لا يملك إلا البلاغ والإنذار.\nابن كثير قال: “أي ليس إليّ ذلك، وإنما هو إلى الله تعالى، إن شاء فعله بكم، وما أنتم بمعجزين”. والطبري فسر: “إنما يأتيكم به الله، أي بالعذاب الذي استعجلتموني به، وما أنتم بمعجزين: أي لا تفوتون الله هربًا.” والسعدي قال: “يعني: إن أنزل الله بكم ما تستعجلون به من العذاب فلا مفر لكم منه، ولا ملجأ ولا مهرب.”\nفتأمل يا عزيزي القارئ، كم في هذه الكلمات من راحة للمؤمن: أن كل ما يهددك من شرور أو مخاوف لا يقع إلا بإذن الله، وأنك لست وحدك في مواجهة أقدارك. لا أحد يستطيع أن يعجِّل أو يؤخر ما كتبه الله لك. فلا تنشغل بالقلق من ألسنة الناس أو تحدياتهم، فالأمر كله لله، وهو الذي يحكم في النهاية.",
      "english_content": "“He said, ‘Allah alone will bring it to you, if He wills, and you cannot escape [it].’” [Hud: 33]\nListen, my dear reader, this verse came from the tongue of Prophet Nuh (Noah), peace be upon him, when his people challenged him and mocked his warnings, demanding that he bring upon them the punishment he kept reminding them of, if he was truly honest. His reply was filled with clarity and humility: “Allah alone will bring it to you, if He wills.” In other words, the matter is not in my hands, nor can I hasten it or delay it. The one who controls punishment, mercy, and destiny is Allah, and Allah alone.\nNotice how Nuh did not allow himself to get pulled into their arrogant provocation. He didn’t say, “I will show you,” nor did he try to claim power he didn’t have. Instead, he reminded them of the absolute truth: all power, all decree, all authority belong to Allah. And then he added: “and you cannot escape [it].” Meaning, if Allah’s will descends, no fortress, no strength, no cleverness will protect you from it.\nIbn Kathir explained: “It is not up to me, but to Allah. If He wills, He will bring it upon you, and you cannot frustrate Him.” Al-Tabari said: “The punishment you ask for, Allah alone will bring it, and you cannot make yourselves safe from it, nor escape it.” And Al-Sa’di noted: “If Allah decrees it, there is no refuge for you and no escape, for His will always comes to pass.”\nSo reflect, my dear reader: in these words lies a comfort for the heart of the believer. Everything that frightens you, every threat, every looming fear—it cannot touch you unless Allah permits. And nothing in the universe can hasten or delay what Allah has already written for you. This means you don’t need to spend your life trembling at the words or threats of people. Your fate, your protection, your life, and your end rest only with Allah.\nThis verse is not only a warning to the disbelievers; it is also a reassurance to you: rest in the knowledge that your life is governed by Allah’s will. Nothing can happen outside His decree, and nothing can reach you except what He has already chosen for you with His wisdom."
    },
    {
      "id": 22,
      "title": "مريم ٩",
      "verse_text": "يقول الله تعالى: ﴿قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـٔٗا﴾ [مريم: ٩]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية جاءت في سياق قصة نبي الله زكريا عليه السلام، حين دعا ربه أن يرزقه ولدًا على كبر سنه وعقم زوجته. جاءه الجواب العجيب: ﴿قَالَ كَذَٰلِكَ﴾، أي هكذا يكون الأمر، لا تعجز قدرة الله عن شيء. ثم جاء البيان الإلهي الذي يخترق كل استبعاد بشري: ﴿هُوَ عَلَيَّ هَيِّنٞ﴾، أي أن ما تستعظمه أنت يا زكريا، وما تراه مستحيلًا في عينيك، هو سهل يسير عند الله، لا يزيده على ملكوته شيئًا.\nثم ذُكِّر بحقيقة عميقة: ﴿وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـٔٗا﴾. وكأن المعنى: يا زكريا، إذا كنتَ تتعجب من ولادة ولد من شيخ كبير وامرأة عاقر، فتذكّر أنك أنت نفسك لم تكن شيئًا أصلًا، ثم خلقتك أنا من العدم. فإذا قدرت على أن أوجدك من لا شيء، أفلا أقدر أن أجعل لك ولدًا وأنت موجود؟\nابن كثير قال: “أي الأمر كما سألت، ولكنه على الله يسير، وقد خلقتك من قبل ولم تك شيئًا، أفلا أقدر أن أجعل لك غلامًا؟” والطبري قال: “أي خلقتك من غير شيء، فكيف تعجب من أن أجعل لك ولدًا مع كبرك وعقم امرأتك؟” والقرطبي أضاف: “في الآية إشارة إلى أن كل ما يراه العبد صعبًا، فهو على الله هيّن.”\nفتأمل يا عزيزي القارئ، كيف يكلّمك الله هنا: كل ما يحملك الحزن أو يثقلك الهم لأنك تظنه مستحيلًا أو بعيدًا، تذكّر أن الله يقول: هو عليّ هيّن. لا شيء يعجزه، لا ضعفك، لا ظروفك، لا المستحيلات التي تراها أمامك. كما أخرجك من العدم، قادر أن يبدّل واقعك مهما بدا مظلمًا أو مغلقًا.\nإنها رسالة عظيمة للمؤمن الحزين أو التائه: لا تقلق من المستحيل، فإن ربك الذي خلقك من لا شيء، يقول لك اليوم: أنا قادر أن أغير كل شيء.",
      "english_content": "“He said, ‘So it will be; your Lord says, It is easy for Me, for I created you before, while you were nothing.’” [Maryam: 9]\nListen, my dear reader, this verse comes in the story of the Prophet Zakariya (peace be upon him), when he prayed to his Lord to grant him a child despite his old age and his wife’s barrenness. The answer came astonishing and reassuring: “So it will be”—as if Allah is saying: this matter you see as difficult, it will happen exactly as I decreed.\nThen the divine statement follows: “It is easy for Me.” What you, O Zakariya, see as impossible, what weighs on your heart as beyond human ability, is effortless in the sight of Allah. Nothing in the heavens or earth challenges His power.\nAnd to deepen the meaning, Allah reminds: “For I created you before, while you were nothing.” As if to say: you yourself were once non-existent, nothing at all, and yet I brought you into being. If I could create you out of nothing, how could you doubt that I can grant you a son even in these circumstances?\nIbn Kathir said: “The matter is as you asked, but it is easy for Allah. Did He not create you before when you were nothing?” Al-Tabari said: “I created you when you did not exist, so why be surprised if I grant you a son in your old age and your wife’s barrenness?” And Al-Qurtubi added: “This verse shows that everything the servant considers impossible is, in fact, easy for Allah.”\nSo reflect, dear reader: this verse speaks to you directly. Every worry that weighs on your heart, every impossibility you whisper to yourself—Allah is telling you: It is easy for Me. The barriers you see are nothing before His will. Just as He brought you out of nothingness, He can open doors you thought would never open.\nIt is a message of deep comfort to the sad, the weary, and the hopeless: do not despair of the impossible, for your Lord, who created you when you were nothing, says to you now—I can change everything for you, and it is easy for Me."
    },
    {
      "id": 23,
      "title": "الطور ٤٨",
      "verse_text": "يقول الله تعالى: ﴿وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ فَإِنَّكَ بِأَعۡيُنِنَاۖ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِينَ تَقُومُ﴾ [الطور: ٤٨]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية الكريمة تخاطب النبي ﷺ أولًا، لكنها في حقيقتها رسالة لكل مؤمن يعيش بين تقلبات الدنيا وأحزانها. الله يقول: ﴿وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ﴾، أي اصبر على ما قدّره الله لك من ابتلاءات وأقدار، وعلى ما كلفك به من رسالة وطاعة. الصبر هنا ليس استسلامًا، بل ثبات واطمئنان بأن كل ما يجري بحكمة الله.\nثم يأتي التعبير العجيب: ﴿فَإِنَّكَ بِأَعۡيُنِنَا﴾. أي أنك يا محمد، وأنت يا عبد الله، لست وحدك في مواجهة الحزن أو الأذى أو الابتلاء. أنت في رعاية الله، في حفظه، في عين لطفه. وكأن الله يقول لك: لا تقلق، فأنا أراك وأرعاك، ولن يُصيبك شيء إلا بإذني، وأنا خير الحافظين.\nبعدها يوجه الله إلى العلاج العملي: ﴿وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِينَ تَقُومُ﴾. التسبيح والذكر هما زاد القلب حين يثقل بالحزن. فإذا أثقلتك همومك، فاذكر الله، سبح بحمده، واجعل لسانك عامرًا بذكره، فهو البلسم الذي يداوي قلبك.\nابن كثير قال: “أي اصبر لحكم الله فيما ابتلاك به، فإنك بمرأى منا نراك ونحوطك بعنايتنا.” والطبري قال: “بأعيننا: أي بمرأى منا وحفظ.” والقرطبي قال: “في هذه الآية أعظم تسلية للمؤمن، إذ يعلم أنه في عين الله لا يغيب عنه طرفة عين.”\nفتأمل يا عزيزي القارئ: هذه الكلمات ليست مجرد خطاب للنبي ﷺ، بل هي خطاب لك في حزنك، في لحظات ضعفك، حين تشعر أنك وحيد في مواجهة الدنيا. الله يقول لك: اصبر، فأنت في عيني. لا يضيعك، لا يتركك، لا يغفل عنك.\nفإذا ضاق صدرك، فتذكر هذه الكلمات: ﴿فَإِنَّكَ بِأَعۡيُنِنَا﴾. أي في رعاية الله الذي لا يغفل ولا ينام. أليس هذا كافيًا لأن يبدد حزنك ويملأ قلبك سكينة؟",
      "english_content": "“So be patient for the decision of your Lord, for indeed, you are under Our observation. And exalt [Allah] with praise of your Lord when you arise.” [At-Tur: 48]\nListen, my dear reader, this verse was first directed to the Prophet ﷺ, but in its spirit, it is a message to every believer who faces the heaviness of grief and the turbulence of life. Allah says: “So be patient for the decision of your Lord”—meaning, endure with steadfastness what Allah has decreed for you, whether it is trials, burdens, or duties. This patience is not passive surrender, but rather a calm trust, a conviction that everything unfolds with wisdom and purpose.\nThen comes the most tender reassurance: “for indeed, you are under Our observation.” Imagine these words reaching your heart—you are never unseen, never abandoned. Allah Himself is telling you: You are under My watchful care, under My protection, under My loving gaze. Every tear, every sigh, every ache in your heart is known to Him. You are not walking through your sorrow alone; you are walking within the sight and mercy of the Almighty.\nAnd then He gives you the key to soothing that grief: “And exalt [Allah] with praise of your Lord when you arise.” When your chest feels heavy and your thoughts overwhelm you, turn to remembrance. Let your tongue move with praise, let your heart soften with tasbīḥ. Praise of Allah is not just ritual—it is medicine, it is light for your heart, and strength for your spirit.\nIbn Kathir said: “That is, be patient with what your Lord has decreed, for you are in Our sight, and We protect you with Our care.” Al-Tabari said: “Under Our observation means under Our watch and preservation.” Al-Qurtubi added: “This verse is the greatest comfort for the believer, for he knows he is never absent from the eye of Allah, not even for the blink of an eye.”\nSo reflect, my dear reader: this verse is a whisper to your heart in its moments of sorrow. Allah is telling you: Be patient. You are in My sight. I am with you. Does this not ease your grief and replace it with tranquility?"
    },
    {
      "id": 24,
      "title": "الرعد ٢٨",
      "verse_text": "يقول الله تعالى: ﴿ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ﴾ [الرعد: ٢٨]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية من أعظم ما يسكب السكينة على قلبٍ أثقله الحزن، هي ليست مجرد جملة قرآنية، بل وعد سماوي يُخاطب قلبك مباشرة. الله يقول: ﴿ٱلَّذِينَ آمَنُواْ﴾، أي الذين ربطوا قلوبهم بحبل الإيمان، وجعلوا وجهتهم إلى الله. هؤلاء يصف حالهم: ﴿وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِ﴾.\nالطمأنينة يا صديقي ليست هدوءًا عابرًا، بل هي استقرار داخلي، سكون في الأعماق، كأن قلبك بعد اضطراب طويل وجد مكانًا آمنًا ليستقر فيه. ما أعظمها من بشارة! فالله نفسه يخبرك أن ذكرك له، استحضارك لعظمته، ترديدك لاسمه، هو البلسم الذي يُهدئ حزنك ويبدده.\nثم جاءت الآية مؤكِّدة بأسلوب الحصر: ﴿أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ﴾. ألا هنا تنبيه قوي، كأنه يقول لك: انتبه! لا شيء في الدنيا يقدر أن يُشعرك بالطمأنينة الحقيقية إلا ذكر الله. لا مال، ولا جاه، ولا بشر. كل ذلك قد يواسيك لحظة، لكنه يتركك في النهاية فارغًا. وحده ذكر الله يمنحك سكينة لا تنقطع، لأنه يربطك بالحي الذي لا يموت.\nابن كثير قال: “أي قلوبهم ساكنة مطمئنة بذكره، وقد قيل: هو القرآن.” الطبري ذكر: “يقول لا تستقر قلوب المؤمنين إلا بذكر الله، ولا تطمئن إلا به.” والقرطبي قال: “فيها دليل على أن في ذكر الله حياة القلوب ودواء الأسقام.” أما السعدي فقال: “هذا دليل على أن كل من كان أكثر ذكرًا لله، كان قلبه أطيب عيشًا، وأرغد بالًا، وأقوى طمأنينة.”\nفتأمل يا عزيزي القارئ، كم مرة جلست حزينًا تبحث عمّن يخفف عنك فلم تجد؟ هذه الآية تعطيك الجواب: الطمأنينة ليست عند الناس، بل في ذكر رب الناس. فإذا غشاك الحزن، لا تركض وراء الدنيا، بل اجلس بهدوء واذكر الله، وسترى بنفسك كيف يذوب ثِقَل الحزن ويتحوّل إلى سكينة تُعجزك عن وصفها.",
      "english_content": "“Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured.” [Ar-Ra’ad: 28]\nListen, my dear reader, this verse is one of the greatest treasures for every heart burdened by sadness. It’s not just words; it’s a heavenly promise that speaks directly to your soul. Allah describes the believers as people whose hearts find assurance in His remembrance.\nThis assurance is not a fleeting calm or a temporary distraction. It is a deep-rooted tranquility, a stillness in the very core of your being, like a stormy sea suddenly settling into peace. When the verse says “by the remembrance of Allah hearts are assured,” it means that your restlessness, your grief, your heaviness—all of it finds its cure in turning back to Him.\nAnd notice the emphasis: “Unquestionably.” It’s as if Allah is telling you, beyond any doubt, that nothing in this world can bring you true peace except His remembrance. Wealth may comfort you for a moment, people may soothe you for a while, but eventually, they leave your heart empty again. Only the remembrance of the Ever-Living, the One who never abandons, fills your heart with a lasting serenity.\nIbn Kathir said: “Their hearts are calm and at peace with the remembrance of Allah, and it was said: with the Qur’an.” Al-Tabari wrote: “The hearts of the believers do not find stability except in Allah’s remembrance.” Al-Qurtubi explained: “This is proof that in remembering Allah lies the life of hearts and the remedy for their ailments.” And Al-Sa’di beautifully summed it up: “The more one remembers Allah, the more his heart enjoys a good life, serenity, and peace.”\nSo reflect, my dear reader: how many times have you searched for someone to comfort you in your sorrow, only to find emptiness in their words? This verse whispers the answer: your heart’s healing isn’t in people or possessions, it’s in Allah. When grief weighs you down, don’t chase after the world; sit quietly, mention His name, and you’ll feel the heaviness dissolve into a serenity you cannot explain—only taste."
    }
  ]
}