{
  "feeling": "الوحدة",
  "verses": [
    {
      "id": 1,
      "title": "مريم ٤٨ / Maryam 48",
      "verse_text": "يقول الله تعالى: ﴿وَأَعۡتَزِلُكُمۡ وَمَا تَدۡعُونَ مِن دُونِ ٱللَّهِ وَأَدۡعُواْ رَبِّي عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّي شَقِيّٗا﴾ [مريم: ٤٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تفتح لك باب المعنى العميق لشعور الوحدة، لكنها وحدة من نوع آخر. هنا إبراهيم عليه السلام يعلن قراره: يترك قومه، يبتعد عنهم وعن آلهتهم، ويختار أن يعيش مع الله وحده. من الخارج قد تبدو صورة الوحدة صعبة: إنسان يبتعد عن أهله وبلده وناسه. لكن في الحقيقة ليست وحدة، بل هي أعظم صحبة، صحبة الله. إبراهيم لم يعتزل يائسًا أو منكسراً، بل قال: ﴿وَأَدۡعُواْ رَبِّي﴾. كأن لسان حاله: أنتم تركتموني، لكني اخترت ربي، ولن أكون وحدي أبدًا. هو يدرك أن الوحدة الحقيقية ليست أن تبتعد عن الناس، بل أن تبتعد عن الله. لذلك أكمل بقوله: ﴿عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّي شَقِيّٗا﴾. يعني كل دعاء أرفعه إلى الله، كل كلمة أقولها له، كل مناجاة، ستكون سببًا في سعادتي، ولن يتركني الله شقيًّا. ابن كثير قال: \"أي أرجو أن أسعد بدعائي ربي ولا أشقى بترك عبادتكم.\" والطبري قال: \"أي أرجو أن لا يخيبني بدعائي.\" والسعدي قال: \"هذا رجاء عظيم وثقة بالله، أن من دعا الله صادقًا لم يكن شقيًا أبداً.\" فتأمل يا قارئي العزيز: هذه الآية تعطيك علاجًا لشعور الوحدة. حين تشعر أنك وحدك، حين يخذلك الناس أو يبتعد عنك من تحب، تذكر أن معك ربك، وأن مناجاته تكفيك عن كل الناس. قد تكون في الظاهر معتزلاً، لكن في الباطن قلبك ممتلئ بالأنس بالله.",
      "english_content": "“And I will leave you and those you invoke other than Allah and will call upon my Lord. I expect that I will not be unhappy in supplicating my Lord.” [Maryam: 48] Look, my dear reader, this verse carries a profound meaning for the feeling of loneliness—but it is a different kind of loneliness. Here, Prophet Ibrahim (Abraham), peace be upon him, declares his decision: he will leave his people, distance himself from their idols, and choose to live with Allah alone. From the outside, it may look like solitude: a man leaving his family, his community, and his homeland. But in truth, it is not loneliness—it is the greatest companionship: companionship with Allah. Ibrahim did not withdraw in despair or weakness. Rather, he said: “and will call upon my Lord.” It is as if he is saying: You may abandon me, but I have chosen my Lord, and I will never truly be alone. He knew that real loneliness is not in being away from people, but in being away from Allah. That is why he added: “I expect that I will not be unhappy in supplicating my Lord.” Every prayer he raised, every word of supplication, every whisper to Allah—he believed—would bring him joy and protection, never misery. Ibn Kathir explained: “I hope to be made happy by my Lord through my supplication and not to be wretched by abandoning your worship.” Al-Tabari said: “I hope that my Lord will not disappoint me in my supplication.” And Al-Sa’di said: “This reflects great hope and trust in Allah—that whoever sincerely calls upon Him will never be wretched.” So reflect, dear reader: this verse is a cure for the feeling of loneliness. When you feel alone, when people abandon you or when those you love walk away, remember that your Lord is with you. Speaking to Him is enough to fill the emptiness of your heart. Outwardly, you may seem separated, but inwardly your soul is alive with the closeness of Allah."
    },
    {
      "id": 2,
      "title": "الأنبياء ٨٩ / Al-Anbiya 89",
      "verse_text": "يقول الله تعالى: ﴿وَزَكَرِيَّآ إِذْ نَادَىٰ رَبَّهُ رَبِّ لَا تَذَرْنِي فَرْدٗا وَأَنتَ خَيْرُ ٱلْوَٰرِثِينَ﴾ [الأنبياء: ٨٩]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تصور لحظة وحدة عميقة مرّ بها نبي الله زكريا عليه السلام. شيخ كبير، شعر بقرب نهايته، ولم يكن له ولد يرثه أو يحمل رسالته، فامتلأ قلبه بشعور الوحدة. لكنه لم يغرق في حزنه، بل حوّل هذه الوحدة إلى دعاء، وقال: ﴿رَبِّ لَا تَذَرْنِي فَرْدٗا﴾. كلمة \"فردًا\" هنا ليست فقط بلا ولد، بل بلا سند، بلا من يواصل طريقه من بعده. ومع ذلك لم يتوقف عند الشعور بالنقص، بل رفع بصره إلى السماء وقال: ﴿وَأَنتَ خَيْرُ ٱلْوَٰرِثِينَ﴾. كأنه يذكّر نفسه ويذكّرك: حتى لو لم يبقَ أحد، حتى لو شعرت أنك وحدك، الله هو خير الوارثين، خير من يبقى بعد الجميع، خير من يتكفل بك حين يذهب كل من حولك. ابن كثير قال: \"أي لا تتركني فردًا لا ولد لي يرثني، وأنت خير الوارثين، أي أبقى بعد كل من يموت.\" والطبري قال: \"أي لا تتركني وحيدًا، وأنت خير من ورث وبقي.\" والسعدي قال: \"في هذه الآية دليل على أن الالتجاء إلى الله عند الوحدة أعظم دواء، فإنه الباقي الذي لا يزول.\" فتأمل يا قارئي العزيز: الآية تعطيك درسًا عميقًا أن شعور الوحدة ليس علامة ضعف، بل فرصة لمدّ يدك إلى الله. حين تقول: \"يا رب لا تتركني فردًا\"، فأنت تعلن أن سندك الأول هو الله، وأن بقاءه معك يغنيك عن كل من رحل.",
      "english_content": "“And [mention] Zechariah, when he called to his Lord, ‘My Lord, do not leave me alone [with no heir], while You are the best of inheritors.’” [Al-Anbiya: 89] Look, my dear reader, this verse captures a moment of deep loneliness experienced by Prophet Zechariah, peace be upon him. An old man, nearing the end of his life, feeling the weight of having no child to carry on his legacy or his mission—his heart was touched by solitude. Yet, instead of drowning in sorrow, he transformed that loneliness into a heartfelt prayer: “My Lord, do not leave me alone.” The word “alone” here is not only about lacking a son—it carries the sense of being without support, without someone to continue the path after him. But Zechariah did not stop at expressing his need. He lifted his gaze higher and said: “While you are the best of inheritors.” It is as if he reminded himself—and reminds you—that even if every companion leaves, even if you find yourself utterly alone, Allah remains. He is the best of inheritors, the One who stays when all else perishes, the One who takes care of you when no one else can. Ibn Kathir explained: “Do not leave me without a child to inherit me, while You remain, the best of inheritors.” Al-Tabari said: “Do not leave me solitary, for You are the best of those who remain after all pass away.” And Al-Sa’di noted: “This verse shows that turning to Allah in moments of solitude is the greatest cure, for He is the Everlasting who never disappears.” So reflect, dear reader: this verse teaches you that loneliness is not a mark of weakness, but an invitation to draw nearer to Allah. When you say: “My Lord, do not leave me alone,” you are declaring that your true support, your unending companion, is Allah Himself. His presence is enough to fill every emptiness, even when the world feels empty around you."
    },
    {
      "id": 3,
      "title": "ق ١٦ / Qaaf 16",
      "verse_text": "يقول الله تعالى: ﴿وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ﴾ [ق: ١٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية وحدها كافية لتذيب كل شعور بالوحدة. الله سبحانه يقول لك: أنا الذي خلقتك، أعرف ما يدور في داخلك، ما تحدّثك به نفسك بصوتٍ لا يسمعه أحد، حتى ما لا تبوح به لأقرب الناس. كل وسوسة، كل هم، كل فكرة سرية تمر في قلبك، الله يعلمها. ثم يزيدك قربًا وطمأنينة بقوله: ﴿وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ﴾. حبل الوريد هو العِرق الذي يمدك بالحياة، أقرب شيء إليك، لا تستطيع أن تعيش لحظة بدونه. ومع ذلك الله يقول: أنا أقرب إليك منه. أي أن قرب الله ليس مكانًا أو مسافة، بل قرب علم، وقرب عناية، وقرب إحاطة ورحمة. ابن كثير قال: \"أي نحن أعلم به من نفسه، ونحن أقرب إليه من حبل وريده.\" والطبري قال: \"أقرب إليه بعلمنا من نفسه.\" والقرطبي قال: \"المعنى: لا يخفى علينا شيء من سره ولا علانيته.\" والسعدي قال: \"هذا القرب يوجب للعبد أن يستحي من ربه، وأن يطمئن قلبه أن ربه مطّلع عليه لا يتركه.\" فتأمل يا قارئي العزيز: هذه الآية تقول لك بوضوح، حتى لو جلست وحيدًا في غرفة مظلمة، حتى لو لم يفهمك أحد أو لم تجد من تبوح له، أنت لست وحدك. ربك أقرب إليك من نفسك، يسمع همسك قبل أن تنطقه، ويرى دمعتك قبل أن تنزل. فالوحدة في حقيقتها وهم، لأن معك من لا يفارقك أبدًا.",
      "english_content": "“And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein.” [Qaaf: 16] Look, my dear reader, this verse alone is enough to dissolve every feeling of loneliness. Allah Himself tells you: I am the One who created you. I know what your soul whispers to you—the thoughts that circle inside your heart, the fears, the hopes, the words you never share with anyone else. Even the secret voice of your heart that no human can hear—Allah knows it fully. Then He gives you an even greater reassurance: “And We are closer to him than his jugular vein.” The jugular vein is the vessel that gives you life, the closest part of your body to your very existence—you cannot survive a moment without it. Yet Allah says: I am closer to you than that. This closeness is not of place or distance, but of knowledge, care, mercy, and constant watchfulness. Ibn Kathir explained: “It means We know him better than himself, and We are closer to him than his jugular vein.” Al-Tabari said: “Closer by Our knowledge than he is to himself.” Al-Qurtubi added: “Nothing of his secrets or his open deeds is hidden from Us.” And Al-Sa’di noted: “This closeness should cause the servant to feel both awe and comfort, knowing his Lord is near, watching, and never abandoning him.” So reflect, dear reader: this verse is telling you clearly that even if you sit alone in a dark room, even if no one understands you or listens to your pain, you are never truly alone. Your Lord is closer to you than your own self—He hears your whisper before you utter it, He sees your tear before it falls. Loneliness, in truth, is only an illusion, for you are always in the company of the One who never leaves you."
    },
    {
      "id": 4,
      "title": "التوبة ٤٠ / At-Taubah 40",
      "verse_text": "يقول الله تعالى: ﴿إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَاحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ﴾ [التوبة: ٤٠]",
      "content": "انظر يا عزيزي القارئ، هذه الآية من أعظم مشاهد السيرة، لحظة في غاية الصعوبة، لكنها تحمل أعظم معاني الأنس مع الله. النبي ﷺ ومعه صاحبه أبو بكر في الغار، مطاردان، والعدو يحيط بهم من كل جانب. في مثل هذا الموقف الطبيعي أن يملأ الخوف القلوب، ويغمر الإحساس بالوحدة والضعف كل شعور. لكن النبي ﷺ يقول بكل ثبات: ﴿لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَا﴾. هذه الكلمات القليلة تختصر كل العلاج لشعور الوحدة: معية الله. حين تكون مطاردًا أو محاصرًا، حين تشعر أن لا أحد معك، تذكّر أن الله معك. ليست مجرد معية عامة، بل معية خاصة: معك بعونه، بنصره، بسكينته. ولذلك قال: ﴿فَأَنزَلَ ٱللَّهُ سَكِينَتَهُ عَلَيۡهِ﴾، سكينة من نوع خاص، تُسكّن القلوب المضطربة، وتطفئ الخوف، وتبدّد شعور الوحدة. ابن كثير قال: \"أي لا تحزن يا أبا بكر إن الله معنا بنصره وتأييده.\" والطبري قال: \"أي معنا بحفظه وعنايته.\" والقرطبي قال: \"هذه أعظم آية في إثبات معية الله الخاصة لأوليائه.\" والسعدي قال: \"هذه المعية الخاصة هي سبب كل طمأنينة للمؤمن.\" فتأمل يا قارئي العزيز: حتى في أحلك لحظات الغربة والوحدة، حين يتخلى عنك الناس وتُحاصر من كل جانب، يكفيك أن تقول في قلبك: إن الله معنا. هذه ليست مجرد كلمات، بل وعد إلهي بالسكينة والنصر والطمأنينة.",
      "english_content": "“If you do not aid him – Allah has already aided him when those who disbelieved had driven him out as one of two, when they were in the cave and he said to his companion, ‘Do not grieve; indeed, Allah is with us.’ And Allah sent down His tranquility upon him and supported him with soldiers you did not see and made the word of those who disbelieved the lowest, while the word of Allah – that is the highest. And Allah is Exalted in Might, Wise.” [At-Taubah: 40] Look, my dear reader, this verse captures one of the most powerful and moving moments in the Prophet’s life. The Messenger of Allah ﷺ was with his closest companion Abu Bakr in the cave, pursued and surrounded by enemies. To any human being, this was a moment of fear, of being cut off, of profound vulnerability and loneliness. Yet the Prophet ﷺ uttered words that changed the meaning of the entire moment: “Do not grieve; indeed, Allah is with us.” These words hold the secret to overcoming loneliness and despair: the companionship of Allah. When people abandon you, when you are trapped, when fear closes in on you, you are never alone—because Allah’s presence is with you, carrying His help, His care, and His protection. That is why the verse continues: “And Allah sent down His tranquility upon him.” This special tranquility is a gift from Allah that soothes a trembling heart, extinguishes fear, and replaces loneliness with serenity. Ibn Kathir explained: “Do not grieve, O Abu Bakr, for Allah is with us by His support and aid.” Al-Tabari said: “He is with us by His protection and care.” Al-Qurtubi commented: “This is the greatest proof of Allah’s special companionship to His allies.” And Al-Saʿdi wrote: “This special companionship is the source of all comfort for the believers.” So reflect, dear reader: even in your darkest and most isolated moments, when you feel surrounded by difficulties or abandoned by people, remember these words: “Indeed, Allah is with us.” They are not just words of reassurance; they are a divine promise of support, peace, and victory."
    },
    {
      "id": 5,
      "title": "طه ٤٦ / Taha 46",
      "verse_text": "يقول الله تعالى: ﴿قَالَ لَا تَخَافَآ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾ [طه: ٤٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية نزلت في موقف شديد، حين أمر الله موسى وأخاه هارون عليهما السلام أن يذهبا إلى فرعون الطاغية المتكبر، الذي يملك السلطة والجبروت. طبيعي أن يمتلئ قلبهما بالرهبة: كيف يواجهان ملكًا جبارًا بسطوته وجنوده؟ لكن الله يقطع الخوف من جذوره بكلمات تُطمئن كل قلب خائف: ﴿لَا تَخَافَآ إِنَّنِي مَعَكُمَآ﴾. هذه \"المعية\" ليست معية عامة، بل معية خاصة، معية حضور إلهي بالسمع والرؤية والرعاية. كأنه يقول: لا يخفى عليّ شيء مما يقول فرعون، ولا يغيب عني شيء مما يفعل، فأنا أسمع كلامه وأرى أفعاله، وأنا الذي سأدبر الأمر. ابن كثير قال: \"أي لا تخافا منه ولا مما يأتي من قبله، فإني معكما بحفظي ونصري وتأييدي.\" والطبري قال: \"إني معكما أسمع أقوالكما وأقواله، وأرى مكانكما ومكانه.\" والقرطبي قال: \"المعية هنا معية النصرة والحفظ والرعاية.\" والسعدي قال: \"في هذا أعظم تثبيت للمؤمنين، أن الله معهم يسمع ويرى، فلا يخافون من أحد.\" فتأمل يا قارئي العزيز: هذه الآية تخاطبك أنت أيضًا في لحظات الوحدة والخوف. حين تواجه موقفًا أكبر منك، أو عدوًا أقوى منك، أو همًّا يثقل قلبك، تذكّر أن الله معك، يسمع ويرى. هذه المعية كافية أن تملأ قلبك شجاعة وطمأنينة، وتجعلك تمضي بخطوات ثابتة، مطمئنًا أن عيون البشر قد لا ترى ضعفك، لكن عين الله لا تفارقك.",
      "english_content": "“[Allah] said, ‘Do not fear; indeed, I am with you both. I hear and I see.’” [Taha: 46] Look, my dear reader, this verse was revealed in a moment of immense challenge. Allah had commanded Moses and his brother Aaron, peace be upon them, to go and confront Pharaoh—the tyrant king, arrogant and powerful, backed by his armies and authority. Naturally, their hearts felt the weight of fear: How can two men stand before such a ruler? But Allah cut that fear from its very root with these soothing, empowering words: “Do not fear; indeed, I am with you both.” This is not a general companionship—it is a special divine companionship, a promise of support and protection. Allah clarifies it further: “I hear and I see.” Meaning, I hear every word Pharaoh says, I hear your call, and I see your place and his place. Nothing escapes Me, and I am the One who manages all affairs. Ibn Kathir explained: “Do not fear him or anything that comes from him, for I am with you by My preservation, My help, and My support.” Al-Tabari said: “I am with you both, hearing your words and his, and seeing your position and his.” Al-Qurtubi commented: “This companionship is the companionship of protection, support, and care.” And Al-Sa’di beautifully said: “This is the greatest comfort for the believers—that Allah is with them, hearing and seeing, so they should fear no one else.” So reflect, dear reader: this verse is not just for prophets—it speaks to you in your own struggles. When you face challenges bigger than yourself, when fear creeps into your heart, or when you feel cornered and alone, remember these words: “Do not fear; indeed, I am with you. I hear and I see.” This promise is enough to fill your heart with courage, to steady your steps, and to remind you that while the eyes of people may miss your weakness, the gaze of Allah never leaves you."
    },
    {
      "id": 6,
      "title": "البقرة ١٨٦ / Al-Baqarah 186",
      "verse_text": "يقول الله تعالى: ﴿وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ﴾ [البقرة: ١٨٦]",
      "content": "انظر يا عزيزي القارئ، هذه من أدفأ الآيات وأكثرها قربًا للقلب، خاصة في لحظات الوحدة. كثير من الآيات تبدأ بـ\"قل\" كأن الله يأمر نبيه أن يجيب الناس، لكن هنا، حين سأل الناس عن الله، لم يقل: \"قل إني قريب\"، بل قال مباشرة: ﴿فَإِنِّي قَرِيبٌ﴾. كأن الله تجاوز الوسائط ليجيب بنفسه، ليدخل إلى قلبك بلا حواجز. القرب هنا ليس مسافة تُقاس، بل قرب علم ورحمة واستجابة. الله يطمئنك أنك لست وحدك أبدًا، يقول لك: أنا قريب منك، أسمعك إذا دعوتني، أجيبك إذا ناديتني. فشعور الوحدة يتبدد حين تدرك أن الله أقرب إليك من كل من حولك، أقرب حتى من نفسك. ثم يضيف: ﴿أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِ﴾. ليس شرطًا أن تكون دعاءك بلسان فصيح، أو بصوت مسموع، يكفي أن تنطق بقلبك، والله يسمع ويستجيب. فهذه الآية ليست مجرد وعد بالاستجابة، بل وعد بالقرب أولًا، القرب الذي يحوّل كل وحدة إلى أنس. ابن كثير قال: \"هذه أعظم آية في القرآن في بيان قرب الله من عباده.\" والطبري قال: \"أعلم عبادي أني قريب منهم إذا دعوني.\" والقرطبي قال: \"قريب بعلمه وإجابته ورحمته.\" والسعدي قال: \"هذه الآية دليل على لطف الله بعباده، حيث أمرهم بدعائه، ووعدهم بالإجابة، وبيّن قربه منهم.\" فتأمل يا قارئي العزيز: هذه الآية تخاطب قلبك لتقول لك: إذا شعرت بالوحدة، إذا لم تجد من يسمعك، لا تظن أنك بلا سند. الله قريب، أقرب من كل قريب، ينتظرك أن تدعوه، ليملأ فراغك بالرحمة، ووحدتك بالأنس، وحاجتك بالعطاء.",
      "english_content": "“And when My servants ask you concerning Me – indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be rightly guided.” [Al-Baqarah: 186] Look, my dear reader, this verse is among the warmest and most comforting passages in the Qur’an—especially for hearts that taste loneliness. Notice something remarkable: in many places, when people ask about something, Allah says: “Say (Qul)” to the Prophet so he may answer. But here, when the question is about Allah Himself, He does not put a veil or an intermediary—He answers directly: “Indeed I am near.” It is as if Allah draws Himself closer to your heart, removing all distance. This nearness is not about physical space; it is nearness in knowledge, mercy, care, and intimate presence. It means you are never alone. Even when you feel abandoned by people, Allah is near enough to hear the quietest whisper of your heart. Then He assures you: “I respond to the invocation of the supplicant when he calls upon Me.” The condition is simple—just call upon Him. You don’t need eloquence, you don’t need a loud voice, you don’t need a perfect time. A whisper in the depths of your chest is enough for the Lord of the heavens and the earth to listen and respond. Ibn Kathir said: “This is the greatest verse in the Qur’an showing Allah’s closeness to His servants.” Al-Tabari explained: “I inform My servants that I am near them when they supplicate to Me.” Al-Qurtubi said: “Near in His knowledge, His answer, and His mercy.” And Al-Sa’di beautifully wrote: “This verse shows Allah’s kindness to His servants, calling them to supplicate, promising them response, and assuring them of His closeness.” So reflect, dear reader: this verse is a direct invitation for your heart. If you feel alone, if you feel unheard, Allah is telling you: I am near. Call upon Me, and I will respond. This nearness turns loneliness into companionship, emptiness into fullness, and weakness into strength."
    },
    {
      "id": 7,
      "title": "التوبة ٣٦ / At-Taubah 36",
      "verse_text": "يقول الله تعالى: ﴿إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثْنَا عَشَرَ شَهۡرٗا فِي كِتَـٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَـٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَـٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ﴾ [التوبة: ٣٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تتحدث عن نظام الزمن عند الله، وأن الشهور معدودة منذ خلق السماوات والأرض، وفيها أربعة أشهر حرم عظّمها الله ونهى عن الظلم فيها. لكن الخاتمة تحمل رسالة خاصة تذيب شعور الوحدة: ﴿وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ﴾. هنا الله يربطك بمعنى المعية الخاصة: معية الله ليست مع الجميع، بل مع الذين يتقونه، يحفظون أوامره، ويتجنبون نواهيه. إذا كنت من هؤلاء، فمهما واجهت من عداوة أو وحدة، مهما حوصرت أو قلّ نصيرك، فالله معك. وهذه \"المعية\" ليست شعارًا بل حقيقة: معك بحفظه، معك بنصره، معك بتثبيت قلبك. ابن كثير قال: \"أي الله معهم بالنصر والتأييد.\" والطبري قال: \"أي مع المتقين بعونه وتوفيقه.\" والقرطبي قال: \"هذه أعظم بشارة لأهل التقوى، أن الله معهم لا يتركهم.\" والسعدي قال: \"المعية هنا معية خاصة تتضمن الحفظ والتأييد والإعانة.\" فتأمل يا قارئي العزيز: الآية تخاطبك كأنها تقول: لا يهم في أي وقت أو في أي شهر أو أي مكان كنت، إن كنت من المتقين فلست وحدك أبدًا. حتى لو شعرت أن الدنيا كلها ضدك، معك معية الله، وهذه تكفيك عن معية الخلق كلهم.",
      "english_content": "“Indeed, the number of months with Allah is twelve [lunar] months in the register of Allah from the day He created the heavens and the earth; of these, four are sacred. That is the correct religion, so do not wrong yourselves during them. And fight against the polytheists all together as they fight against you all together. And know that Allah is with those who fear Him.” [At-Taubah: 36] Look, my dear reader, while this verse lays out the divine order of time—twelve months decreed since the creation of the heavens and the earth, with four sacred months set apart for reverence—the ending holds a profound comfort for every heart that feels alone: “And know that Allah is with those who fear Him.” This is not a general companionship. It is a special kind of closeness, reserved for those who live with awareness of Allah, guarding His limits and striving to avoid His prohibitions. To such people, Allah grants His maʿiyyah—His nearness, His support, His protection. Ibn Kathir explained: “Allah is with them with His support and aid.” Al-Tabari said: “It means He is with the God-fearing by His help and His guidance.” Al-Qurtubi noted: “This is the greatest glad tidings for the people of taqwa—that Allah is with them and never abandons them.” And Al-Sa’di said: “This is a special companionship that includes protection, strength, and assistance.” So reflect, dear reader: wherever you are, in any time, in any place, if you live with taqwa—conscious of Allah—you are never truly alone. You may feel surrounded by enemies, you may feel abandoned by people, but Allah’s nearness is with you. And His companionship is worth more than the company of the entire world."
    },
    {
      "id": 8,
      "title": "النحل ١٢٨ / An-Nahl 128",
      "verse_text": "قال الله تعالى: ﴿إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَٱلَّذِينَ هُم مُّحۡسِنُونَ﴾ [النحل: ١٢٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية الكريمة تأتي ختامًا لسورة النحل، وكأنها توقيع رباني يطمئن قلوب عباده. الله يذكرك أن المعية الحقيقية ليست مع كثرة الناس من حولك، ولا مع كثرة الأعوان، بل مع التقوى والإحسان. يقول: ﴿إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ﴾، أي الذين خافوا مقامه فاجتنبوا معاصيه، وحفظوا أوامره، هؤلاء لا يتركون وحدهم في الشدائد، بل الله معهم، يمدّهم بالصبر، ويعينهم بالنصر، ويملأ قلوبهم طمأنينة. ثم يزيد: ﴿وَٱلَّذِينَ هُم مُّحۡسِنُونَ﴾. الإحسان هو أن تعبد الله كأنك تراه، أن تتقن عملك، أن تعامل الناس بالخير. هؤلاء لهم معية خاصة، معية عون وفضل. فالمؤمن الذي يجمع بين التقوى والإحسان ليس وحده أبدًا، بل يعيش في كنف الله، وتحت رعايته. ابن كثير قال: \"أي معهم بالحفظ والتأييد والنصر.\" والطبري قال: \"أي مع الذين يتقون معاصيه، والذين يحسنون في طاعته.\" والقرطبي قال: \"المعية هنا معية الكرامة والنصرة.\" والسعدي قال: \"في هذه الآية أعظم بشارة لأهل التقوى والإحسان، أن الله معهم يوفقهم ويؤيدهم.\" فتأمل يا قارئي العزيز: قد تجد نفسك وحيدًا في موقف، أو غريبًا في مكان، أو بلا نصير من البشر، لكن إذا كنت من المتقين المحسنين، فالله معك. وهذه المعية وحدها تكفيك عن كل البشر، وتملأ وحدتك بالأنس، وخوفك بالأمان.",
      "english_content": "“Indeed, Allah is with those who fear Him and those who are doers of good.” [An-Nahl: 128] Look, my dear reader, this verse closes Surah An-Nahl with a divine seal of reassurance. Allah reminds you that true companionship is not found in crowds of people or in the strength of allies—it is found in living with taqwa (God-consciousness) and ihsan (excellence). Allah says: “Indeed, Allah is with those who fear Him.” Meaning those who are mindful of His presence, who avoid His prohibitions, and who strive to keep His commands. Such people are never left alone in times of hardship. Allah is with them—with His protection, His help, and His tranquility that steadies their hearts. Then He adds: “and those who are doers of good.” Ihsan is to worship Allah as though you see Him, to perfect your deeds, and to treat people with kindness and excellence. For such people, Allah grants a special companionship: not only guarding them from harm, but raising them with honor, guiding them, and enveloping them in His mercy. Ibn Kathir explained: “It means Allah is with them through His protection, support, and victory.” Al-Tabari said: “With those who fear disobeying Him and those who excel in obeying Him.” Al-Qurtubi added: “This is a companionship of dignity and divine aid.” And Al-Sa’di beautifully wrote: “In this verse lies the greatest glad tidings for the people of taqwa and ihsan—that Allah Himself is with them, granting them success and support.” So reflect, dear reader: you may find yourself alone in a situation, a stranger in a place, or without human support—but if you live with taqwa and ihsan, then Allah is with you. His companionship is greater than the company of all mankind, and with Him your solitude transforms into serenity and your fear into safety."
    },
    {
      "id": 9,
      "title": "طه ١٣٢ / Taha 132",
      "verse_text": "يقول الله تعالى: ﴿وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَاۖ لَا نَسْـَٔلُكَ رِزْقٗا نَّحْنُ نَرْزُقُكَۗ وَٱلْعَـٰقِبَةُ لِلتَّقْوَىٰ﴾ [طه: ١٣٢]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتي كرسالة توجيهية من الله لنبيه ﷺ، لكنها في حقيقتها خطاب لكل مؤمن يبحث عن الطمأنينة ويخاف من الوحدة أو القلق على الرزق والمصير. يقول الله: ﴿وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَا﴾، أي اجعل الصلاة محور حياتك وحياة أهلك، واصبر على الاستمرار فيها، لأنها أعظم ما يربطك بالله ويملأ قلبك بالأنس مهما ابتعد عنك الناس. ثم يزيل عنك هاجسًا كبيرًا يشغل القلوب: الرزق. فيقول: ﴿لَا نَسْـَٔلُكَ رِزْقٗا نَّحْنُ نَرْزُقُكَ﴾. كأنه يقول لك: لا تحمل همّ رزقك، لا تظن أنك وحيد تركض وراء لقمة العيش، رزقك عندنا ونحن نتكفل به. ما عليك إلا أن تثبت على صلتك بالله، أما الأرزاق فهي مقسومة محسومة. ويختم بالقول: ﴿وَٱلْعَـٰقِبَةُ لِلتَّقْوَىٰ﴾، أي النهاية السعيدة، المآل الطيب، ثمرة كل صبر واستقامة، هي للتقوى. فمن عاش حياته متقيًا، لا يمكن أن تنتهي قصته إلا بخير، مهما شعر في الطريق بوحدة أو ضيق. ابن كثير قال: \"أي مر أهلك بالصلاة وألزمها أنت أيضًا، فنحن نكفيك أمر الرزق.\" والطبري قال: \"أي لا نسألك أن ترزق نفسك ولا أهلك، فنحن نرزقك وإياهم.\" والقرطبي قال: \"هذا تسلية للنبي ﷺ ولكل مؤمن، أن الصلاة سبب للرزق والبركة.\" والسعدي قال: \"جمع الله في هذه الآية بين عبادة الله والاعتماد عليه، ووعد بحسن العاقبة للتقوى.\" فتأمل يا قارئي العزيز: هذه الآية كأنها تخاطب قلبك لتقول: إذا شعرت بالوحدة، إذا ضاقت بك الحياة، فاجعل الصلاة أنسك، واترك همّ الرزق لله، وامضِ مطمئنًا أن النهاية الجميلة تنتظرك إن كنت من المتقين.",
      "english_content": "“And enjoin prayer upon your family and be steadfast therein. We do not ask you for provision; We provide for you. And the [best] outcome is for righteousness.” [Taha: 132] Look, my dear reader, this verse is a gentle yet powerful reminder, first given to the Prophet ﷺ but intended for every believer seeking comfort when life feels heavy or lonely. Allah tells him: “And enjoin prayer upon your family and be steadfast therein.” In other words, make prayer the center of your life and your household, and hold firmly to it with patience and persistence. Prayer is not just ritual—it is the anchor that ties your heart to Allah, filling the emptiness of solitude with divine nearness. Then Allah lifts from you one of the heaviest burdens humans carry: the worry over provision. “We do not ask you for provision; We provide for you.” It is as though Allah is saying: Your job is to stay connected to Me through worship; sustaining you is My responsibility. You are not left to struggle alone in pursuit of your needs—your sustenance is written, guaranteed, and provided by Allah Himself. Finally, He seals the verse with a timeless truth: “And the [best] outcome is for righteousness.” No matter the twists of life, no matter the moments of fear or isolation, the good end—the true victory—is always for those who live with taqwa (God-consciousness). The path of the righteous may feel long or lonely, but its ending is certain: safety, honor, and peace with Allah. Ibn Kathir explained: “Command your family to pray, and you yourself adhere to it, for We take care of your provision.” Al-Tabari said: “We do not ask you to provide for yourself or your family, for We are the ones who provide.” Al-Qurtubi noted: “This is a consolation for the Prophet and every believer—that prayer brings blessing, and sustenance is Allah’s affair.” And Al-Sa’di beautifully wrote: “This verse combines worship of Allah with reliance upon Him, and promises that the good outcome belongs to taqwa.” So reflect, dear reader: if you ever feel burdened or left alone, turn to prayer—it will steady you. Leave the worry of provision to Allah—He is the Provider. And walk the path of righteousness—because no matter how hard the journey feels, the best ending is promised to those who fear Him."
    },
    {
      "id": 10,
      "title": "الحديد ٤ / Al-Hadid 4",
      "verse_text": "يقول الله تعالى: ﴿هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۚ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ﴾ [الحديد: ٤]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تجمع بين عظمة الله المطلقة وقربه اللطيف من عباده. أولها يريك عظمة الملك: خلق السماوات والأرض في ستة أيام، استوى على العرش، أحاط علمه بكل حركة: ما يدخل الأرض وما يخرج منها، ما ينزل من السماء وما يصعد إليها. كأنك تقف أمام مشهد الكون كله تحت بصر الله وسمعه، لا يغيب عنه ذرة. ثم تأتي الجملة التي تمسّ قلب كل من يشعر بالوحدة: ﴿وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡ﴾. أينما كنت، في غرفة مظلمة أو في صحراء واسعة، بين الناس أو وحيدًا تمامًا، الله معك. ليس معية مكان، بل معية علم وإحاطة، معية رعاية ولطف. أنت أبدًا لست بعيدًا عن عينه، ولا خارجًا عن علمه. ابن كثير قال: \"أي رقيب عليكم شهيد على أعمالكم حيثما كنتم.\" والطبري قال: \"معكم بعلمه لا يخفى عليه شيء من أمركم.\" والقرطبي قال: \"هذه معية عامة تعم الخلق، لكنها للمؤمنين طمأنينة، وللكافرين تهديد.\" والسعدي قال: \"في هذه المعية أعظم باعث على مراقبة الله، وأعظم تسلية لمن استوحش.\" فتأمل يا قارئي العزيز: هذه الآية تخاطب قلبك مباشرة لتقول لك: إذا شعرت بالوحدة، فاعلم أنك في معية الله. إذا أحسست أنك غير مرئي لأحد، فالله يراك. إذا حسبت أنك مهمَل، فالله محيط بك، بصير بأعمالك، عالم بهمومك. المعية الإلهية ليست فكرة نظرية، بل حقيقة تحيط بك في كل لحظة، وتمنحك أنسًا يغنيك عن كل الناس.",
      "english_content": "“It is He who created the heavens and the earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein. And He is with you wherever you are. And Allah, of what you do, is Seeing.” [Al-Hadid: 4] Look, my dear reader, this verse brings together the majesty of Allah’s greatness and the gentleness of His closeness. At its beginning, it shows you the grandeur of the Divine: He created the heavens and the earth in six days, He rose above the Throne in absolute authority, and His knowledge encompasses every movement—what enters the earth and what comes out, what descends from the skies and what ascends into them. It is as if the verse places the entire universe before your eyes under Allah’s constant watch and knowledge. Then comes the line that touches the heart of anyone who has ever felt alone: “And He is with you wherever you are.” Wherever you may be—alone in a dark room, in the vastness of a desert, in the middle of a crowd yet feeling unseen—Allah is with you. This is not a physical closeness, but the closeness of knowledge, care, protection, and mercy. You are never outside of His gaze, never absent from His awareness. Ibn Kathir explained: “It means He is ever watching over you, witnessing your deeds wherever you are.” Al-Tabari said: “He is with you by His knowledge—nothing of your affairs is hidden from Him.” Al-Qurtubi noted: “This is a general companionship encompassing all creation, but for the believers it is a source of reassurance, and for the disbelievers it is a warning.” And Al-Sa’di beautifully said: “In this companionship lies the greatest motivation for mindfulness of Allah, and the greatest comfort for those who feel estranged.” So reflect, dear reader: this verse is speaking directly to your heart. If you feel lonely, know that you are in the company of Allah. If you feel unseen, know that He sees you. If you feel abandoned, know that He surrounds you. His divine companionship is not a theory but a living reality that embraces you in every moment, filling solitude with serenity and emptiness with presence."
    },
    {
      "id": 11,
      "title": "طه ٤٦ / Taha 47",
      "verse_text": "يقول الله تعالى: ﴿قَالَ لَا تَخَافَآ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾ [طه: ٤٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية العظيمة نزلت في موقف شديد الرهبة، حين أُمر موسى وأخوه هارون عليهما السلام أن يذهبا إلى فرعون، الطاغية المتجبر الذي ملك القلوب رعبًا والبلاد سلطانًا. طبيعي أن يملأ الخوف قلبهما، فالذهاب إلى مثل هذا الملك الظالم دون جيش أو قوة ظاهرة يبدو مغامرة تهدد حياتهما. لكن الله قطع الخوف من جذوره، وقال لهما مباشرة: ﴿لَا تَخَافَآ إِنَّنِي مَعَكُمَآ﴾. هذه الكلمات ليست مجرد طمأنة، بل وعد إلهي بالمعية الخاصة: معية الحفظ والنصرة والرعاية. الله لم يقل: \"سأرسل معكما أحدًا\" أو \"سأعينكما عن بُعد\"، بل قال: أنا معكما. وهذه أعظم رفقة يمكن أن يحملها إنسان في قلبه. ثم بيّن معنى هذه المعية: ﴿أَسۡمَعُ وَأَرَىٰ﴾. أي أسمع أقوال فرعون وأتباعه، وأسمع دعاءكما وهمسكما، وأرى مواقفكما وما يجري حولكما. لا يغيب عني شيء، ولن يضركما شيء إلا بإذني. ابن كثير قال: \"أي لا تخافا منه ولا من جنوده، فإني معكما بحفظي ونصري وتأييدي.\" والطبري قال: \"إني معكما أسمع أقوالكما وأقواله، وأرى مكانكما ومكانه.\" والقرطبي قال: \"المعية هنا معية النصرة والعصمة.\" والسعدي قال: \"هذا أعظم تثبيت للمؤمنين، أن الله معهم، يسمع ويرى، فلا يخافون من أحد.\" فتأمل يا قارئي العزيز: هذه الآية لا تخص موسى وهارون وحدهما، بل هي رسالة لك أنت أيضًا. حين تواجه موقفًا يفوق طاقتك، أو شخصًا أقوى منك، أو همًا يرهق قلبك، تذكّر أن الله يقول لك: لا تخف، إني معك، أسمع وأرى. هذه الكلمة وحدها كافية لتملأ القلب شجاعة، وتحوّل الوحدة إلى أنس، والخوف إلى طمأنينة.",
      "english_content": "“He said, ‘Do not fear; indeed, I am with you both. I hear and I see.’” [Taha: 46] Look, my dear reader, this verse was revealed in a moment of great fear and tension. Allah had commanded Moses and his brother Aaron, peace be upon them, to go before Pharaoh—the arrogant tyrant who held power over the land and struck terror into people’s hearts. Naturally, fear weighed heavily upon them; to stand before such a ruler without an army or worldly strength seemed impossible. But Allah cut off their fear at its root with these words: “Do not fear; indeed, I am with you both.” These are not just words of comfort, but a divine promise of special companionship: the companionship of protection, support, and care. Allah did not say, “I will send someone with you,” or “I will help you from afar.” Instead, He declared, “I am with you.” There is no greater companionship for the human heart than this. Then he explained the nature of this closeness: “I hear and I see.” Meaning, I hear the words of Pharaoh and his followers, I hear your prayers and your whispers, and I see your place and their place. Nothing escapes Me, and nothing will harm you except by My permission. Ibn Kathir said: “Do not fear him or his soldiers, for I am with you by My preservation, My help, and My support.” Al-Tabari explained: “I am with you both, hearing your words and his, and seeing your positions.” Al-Qurtubi wrote: “This is the companionship of protection and safeguarding.” And Al-Sa’di beautifully said: “This is the greatest comfort for the believers—that Allah is with them, hearing and seeing, so they should fear no one else.” So reflect, dear reader: this verse is not just for Moses and Aaron—it speaks to you as well. When you face trials greater than your strength, when you encounter people or challenges that overwhelm you, remember Allah’s words: “Do not fear; indeed, I am with you. I hear and I see.” This truth alone can turn loneliness into companionship, fear into courage, and uncertainty into trust."
    },
    {
      "id": 12,
      "title": "العنكبوت ٦٥ / Al-‘Ankabut 65",
      "verse_text": "قال الله تعالى: ﴿فَإِذَا رَكِبُواْ فِي ٱلۡفُلۡكِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ إِذَا هُمۡ يُشۡرِكُونَ﴾ [العنكبوت: ٦٥]",
      "content": "انظر يا عزيزي القارئ، هذه الآية ترسم مشهدًا حيًّا من حياة البشر، مشهد الوحدة والخوف في عرض البحر. حين يركب الناس البحر وتأتي العاصفة، وتضطرب الأمواج، وتنقطع بهم الأسباب، يدركون فجأة أنهم لا يملكون شيئًا، وأن لا أحد يمكنه إنقاذهم، فيتوجهون مباشرة إلى الله: ﴿دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ﴾. في لحظة الخوف والوحدة، يسقط كل قناع، وتنكشف حقيقة القلب، فلا يجد الإنسان إلا الله. لكن الله يصف تناقضهم: ﴿فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ إِذَا هُمۡ يُشۡرِكُونَ﴾. بمجرد أن يزول الخوف وتعود الطمأنينة، ينسى كثير منهم ذلك الإخلاص، ويعودون للشرك أو الغفلة. ابن كثير قال: \"هذا إخبار عن حال الناس، أنهم عند الشدة يخلصون لله الدعاء، فإذا فرّج عنهم عادوا إلى شركهم.\" والطبري قال: \"أي إذا ركبوا البحر وخافوا الغرق لم يدعوا إلا الله، فإذا نجاهم نسوا.\" والقرطبي قال: \"فيه دليل على أن التوحيد فطرة مغروسة في القلوب، تظهر عند الشدائد.\" والسعدي قال: \"هذا وصف أكثر الخلق، إلا من رحم الله، أن إخلاصهم مؤقت عند الكرب.\" فتأمل يا قارئي العزيز: هذه الآية تعلمك أن لحظات الوحدة والخوف تكشف لك حقيقة قلبك، فحين لا يبقى معك أحد، تجد نفسك تقول: \"يا الله\". هذه اللحظة من الصدق هي أعظم ما في الإنسان، لكن التحدي أن تبقى مخلصًا حتى بعد أن ينجّيك الله، فلا تعود إلى الغفلة.",
      "english_content": "“And when they board a ship, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him.” [Al-‘Ankabut: 65] Look, my dear reader, this verse paints a vivid scene from human life—a scene of fear and isolation upon the open sea. When people ride the waves and a storm strikes, when the winds howl and the waters rise, suddenly every illusion of control collapses. They realize they own nothing, that no human can save them, and so they turn directly to Allah: “they supplicate Allah, sincere to Him.” In that moment of fear and utter loneliness, all masks fall away, and the truth of the heart is revealed: only Allah remains. But then Allah exposes their contradiction: “But when He delivers them to the land, at once they associate others with Him.” Once the fear subsides and safety returns, many forget the sincerity of that cry and go back to heedlessness or even shirk. Ibn Kathir explained: “This informs of people’s state: in hardship they make their supplication purely for Allah, but when He relieves them, they return to their shirk.” Al-Tabari said: “When they boarded the sea and feared drowning, they called only upon Allah; but when He saved them, they forgot.” Al-Qurtubi added: “This verse shows that tawheed (monotheism) is an innate truth planted in hearts, and it appears most clearly in times of distress.” And Al-Sa’di beautifully noted: “This is the description of most people, except those whom Allah protects—their sincerity lasts only in the moment of crisis.” So reflect, dear reader: this verse reminds you that fear and solitude strip you down to your essence. When no one is there, when nothing can help, your heart naturally cries: “O Allah!” That sincerity is your purest state. The real challenge is not just to find Allah in the storm, but to remain sincere to Him once He brings you back to safety."
    },
    {
      "id": 13,
      "title": "الأحزاب ٣ / Al-Ahzab 3",
      "verse_text": "يقول الله تعالى: ﴿وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا﴾ [الأحزاب: ٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتي كقاعدة عظيمة لكل من شعر بالوحدة أو الضعف أو ثِقَل المسؤولية. الله يأمر نبيه ﷺ، وهو أعظم الناس، أن يتوكل عليه، فكيف بنا نحن الضعفاء؟ التوكل هنا ليس مجرد كلمة، بل هو اعتماد كامل على الله، تفويض مطلق للأمور بين يديه، يقين أن ما يقدره لك خير، وأنه لن يتركك وحدك أبدًا. ثم يضيف: ﴿وَكَفَىٰ بِٱللَّهِ وَكِيلٗا﴾. كلمة \"وكيل\" تعني الكافي، الضامن، المدبر لشؤونك. كأن الله يقول: إذا كنت تبحث عمن تتكئ عليه في لحظة وحدتك، فلا أحد يكفيك مثلي. البشر قد يغيبون، قد يخذلونك، قد يعجزون، لكن الله وكيل لا يغيب ولا يعجز ولا يتركك. ابن كثير قال: \"أي فوّض أمرك إلى الله، فإنه كافيك وناصرك.\" والطبري قال: \"وكفى بالله وكيلًا، أي حافظًا لمن توكل عليه، قائمًا بأمره.\" والقرطبي قال: \"التوكل هو الثقة بالله، والاعتماد عليه في كل الأمور.\" والسعدي قال: \"من توكل على الله كفاه ما أهمه، ودفع عنه كل شر، وجلب له كل خير.\" فتأمل يا قارئي العزيز: هذه الآية تخاطبك أنت أيضًا، تقول لك: إذا وجدت نفسك وحيدًا، لا سند لك ولا معين، ضع قلبك كله عند الله، وقل له: \"أنت وكيلي\"، وستجد أن كل خوف يزول، وكل قلق يذوب، لأن من توكل على الله لن يُخذل أبدًا.",
      "english_content": "“And rely upon Allah; and sufficient is Allah as Disposer of affairs.” [Al-Ahzab: 3] Look, my dear reader, this verse lays down a rule of life for anyone who has ever felt the weight of loneliness, weakness, or heavy responsibility. Allah commands His Prophet ﷺ—the strongest of hearts—to rely upon Him. If even the Messenger was told to lean on Allah, how much more are we, fragile and in need, called to do the same? This reliance, or tawakkul, is not just a word—it is a state of the heart. It means to entrust all your matters to Allah, to believe with certainty that what He decrees for you is best, and to rest assured that He will never abandon you. Then Allah strengthens this command with a promise: “and sufficient is Allah as Disposer of affairs.” The word wakil means a guardian, a caretaker, the One who manages your concerns fully. It is as if Allah is telling you: when you search for someone to lean on in moments of loneliness, know that no one suffices like Me. People may leave, fail, or be powerless to help—but Allah never fails, never forgets, and never leaves His servant unaided. Ibn Kathir explained: “Meaning, entrust your affairs to Allah, for He is enough for you and your supporter.” Al-Tabari said: “Sufficient is Allah as a guardian for whoever relies upon Him.” Al-Qurtubi wrote: “Tawakkul is trusting in Allah and depending upon Him in all matters.” And Al-Sa’di beautifully said: “Whoever relies upon Allah will find Him sufficient, driving away harm and bringing every good.” So reflect, dear reader: this verse is a personal call to your heart. When you feel alone, unsupported, or uncertain about what comes next, place your whole trust in Allah and say: “You are my Guardian, my Wakil.” And you will find your fear replaced with peace, your loneliness with companionship, and your weakness with strength—for whoever relies on Allah is never forsaken."
    },
    {
      "id": 14,
      "title": "الزمر ١٠ / Az-Zumar 10",
      "verse_text": "يقول الله تعالى: ﴿قُلْ يَا عِبَادِ ٱلَّذِينَ آمَنُوا۟ ٱتَّقُوا۟ رَبَّكُمْۚ لِلَّذِينَ أَحْسَنُوا۟ فِي هَٰذِهِ ٱلدُّنْيَا حَسَنَةٞۗ وَأَرْضُ ٱللَّهِ وَٰسِعَةٌۗ إِنَّمَا يُوَفَّى ٱلصَّـٰبِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٖ﴾ [الزمر: ١٠]",
      "content": "انظر يا عزيزي القارئ، هذه الآية مليئة بالتسلية والطمأنينة لكل قلب شعر بالوحدة أو الضيق. الله يوجه الخطاب مباشرة للمؤمنين: ﴿يَا عِبَادِ ٱلَّذِينَ آمَنُوا۟ ٱتَّقُوا۟ رَبَّكُمْ﴾، أي اجعلوا بينكم وبين عذاب الله وقاية، بالتمسك بطاعته وترك معصيته. ثم يفتح لك باب الأمل في الدنيا: ﴿لِلَّذِينَ أَحْسَنُوا۟ فِي هَٰذِهِ ٱلدُّنْيَا حَسَنَةٞ﴾. أي من أحسن العمل، جازاه الله بحسنة في الدنيا قبل الآخرة، فيطمئن قلبه، ويبارك في رزقه، ويشعر بمعية الله حتى لو عاش وحيدًا بين الناس. ثم يذكّرك بسعة الأرض: ﴿وَأَرْضُ ٱللَّهِ وَٰسِعَةٌ﴾. كأن الله يقول: إذا ضاقت عليك أرض، أو أحسست بالغربة بين قومك، فالأرض كلها لي، فارحل حيث تجد فسحة لعبادتي وأُنسًا بالقرب مني. هذه رسالة للمؤمن الوحيد في قومه، أن لا يظن أن مكانه الضيق يعزله عن رحمة الله. ويختم بآية عظيمة: ﴿إِنَّمَا يُوَفَّى ٱلصَّـٰبِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٖ﴾. الصبر هنا دواء الوحدة وضيق الصدر. الله يعد الصابرين أجرًا لا يُقاس ولا يُحصى، أجرًا فوق الحساب البشري. ابن كثير قال: \"أي من أحسن في هذه الدنيا أحسن الله إليه في الدنيا والآخرة.\" والطبري قال: \"أرض الله واسعة، فهاجروا فيها ولا تتركوا الدين.\" والقرطبي قال: \"الصابرون على الطاعة وعن المعصية وعلى البلاء لهم أجر غير محدود.\" والسعدي قال: \"هذا أعظم ما يسلّي المؤمن، أن صبره لن يضيع، بل سيُجزى بغير حساب.\" فتأمل يا قارئي العزيز: هذه الآية تخاطبك إذا شعرت بالوحدة أو بالغربة: اتق الله، أحسن العمل، واعلم أن الأرض واسعة مهما ضاق صدرك، وأن صبرك لن يضيع أبدًا، بل سيُكافَأ بعطاء غير محدود من ربك.",
      "english_content": "“Say, ‘O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.’” [Az-Zumar: 10] Look, my dear reader, this verse is filled with reassurance and comfort for every heart that feels lonely or burdened. Allah addresses the believers directly: “O My servants who have believed, fear your Lord.” To live with taqwa—being mindful of Allah and guarding against His displeasure—is the key to peace even in solitude. Then He opens a door of hope in this life: “For those who do good in this world is good.” Meaning, whoever lives with kindness, honesty, and faithfulness, Allah will grant them goodness in this world even before the Hereafter—peace of heart, blessings in provision, and the sweetness of His companionship, even if people turn away. Allah then reminds you: “The earth of Allah is spacious.” It is as if He is saying: if you feel trapped or estranged in one place, do not despair—the earth is vast. You can move, migrate, or find another space to worship Him freely. No confinement can truly isolate you from Allah’s mercy. Finally, He gives the greatest promise: “Indeed, the patient will be given their reward without account.” Patience here is the cure for loneliness and hardship. To be patient in obedience, patient in avoiding sin, and patient in enduring trials—this patience will not just be rewarded, but rewarded beyond measure, in ways the human mind cannot calculate. Ibn Kathir explained: “Whoever does good in this world, Allah will do good to him in this life and the Hereafter.” Al-Tabari said: “The earth of Allah is wide—so migrate in it and do not abandon your faith.” Al-Qurtubi wrote: “Those who are patient in obedience, in avoiding disobedience, and in affliction will have a reward beyond limit.” And Al-Sa’di beautifully said: “The greatest comfort for a believer is that his patience will never be lost, but will be repaid with a reward beyond account.” So reflect, dear reader: this verse speaks to you in your moments of isolation. It tells you—fear Allah, do good, and if you feel restricted, remember the world is wide and your Lord is with you. Most of all, remember that your patience is not wasted; it is being gathered for you, and one day you will receive it as an endless reward, beyond all measure."
    },
    {
      "id": 15,
      "title": "العلق ١٩ / Al-‘Alaq 19",
      "verse_text": "يقول الله تعالى: ﴿كَلَّا لَا تُطِعْهُ وَٱسْجُدْ وَٱقْتَرِبْ﴾ [العلق: ١٩]",
      "content": "انظر يا عزيزي القارئ، هذه الآية القصيرة تحمل سرًّا عظيمًا لمن يشعر بالوحدة أو يبحث عن الأنس بالله. جاءت الآية في سياق مواجهة النبي ﷺ للمعاندة والعداوة من أبي جهل، ذلك الطاغية الذي حاول أن يمنعه من الصلاة عند الكعبة. لكن الله يخاطبه بلهجة الحزم: ﴿كَلَّا لَا تُطِعْهُ﴾، أي لا تلتفت إليه، لا تخضع لتهديداته، ولا تجعل لكلمة البشر سلطانًا على عبادتك. ثم يأتي العلاج العجيب: ﴿وَٱسْجُدْ وَٱقْتَرِبْ﴾. السجود هنا ليس مجرد حركة، بل هو أقرب لحظة بين العبد وربه. كلما وضع العبد جبهته على الأرض ذاب شعور الوحدة تمامًا، لأنك في تلك اللحظة في حضرة ربك، أقرب ما تكون إلى خالقك. فالوحدة لا تُعالج بالناس، وإنما تُعالج بالقرب من الله، وهذا القرب يتحقق بأكمل صوره في السجود. ابن كثير قال: \"أي لا تطعه يا محمد فيما ينهاك عنه من الصلاة، ودم على طاعة ربك، واسجد له واقترب منه.\" والطبري قال: \"المعنى دم على سجودك واقترب من الله بطاعته.\" والقرطبي قال: \"فيه أعظم شرف للمؤمن، أن السجود سبب القرب من الله.\" والسعدي قال: \"هذا يدل على أن السجود من أعظم أسباب القرب إلى الله، فينبغي الإكثار منه.\" فتأمل يا قارئي العزيز: إذا شعرت أنك وحيد، أو أنك غريب بين الناس، اجعل لك نصيبًا من السجود. هناك، في لحظة السجود، لن تشعر بالفراغ ولا بالغربة، بل ستجد القرب الحقيقي، القرب الذي يغنيك عن كل أحد.",
      "english_content": "“No! Do not obey him. But prostrate and draw near [to Allah].” [Al-‘Alaq: 19] Look, my dear reader, this short verse carries a profound secret for anyone who feels loneliness or longs for closeness to Allah. It was revealed in the context of the Prophet ﷺ facing opposition and hostility from Abu Jahl, who arrogantly tried to stop him from praying at the Ka‘bah. But Allah commanded firmly: “No! Do not obey him.” Meaning—do not yield to his threats, do not let the words of men dictate your worship, and never allow worldly power to block your path to your Lord. Then comes the cure, the gateway to true companionship: “But prostrate and draw near.” Prostration here is not just a physical act; it is the moment when the servant is nearest to his Lord. In sujood, all feelings of isolation dissolve, because your head is lowered on the ground while your heart rises to the highest station of closeness with Allah. Loneliness is not healed by the company of people—it is healed by nearness to the One who never leaves you. Ibn Kathir said: “Do not obey him, O Muhammad, in what he forbids you of prayer. Rather, continue in obedience to your Lord—prostrate and draw near to Him.” Al-Tabari explained: “Persevere in your prostration, and by that draw closer to Allah in obedience.” Al-Qurtubi noted: “In this is the greatest honor for the believer—that prostration is the path to nearness to Allah.” And Al-Sa’di beautifully said: “This shows that sujood is among the greatest means of nearness to Allah, so one should increase in it.” So reflect, dear reader: if you ever feel alone or estranged, make sujood your refuge. In that moment, you are not abandoned—you are embraced by the closest presence of your Lord. There, in prostration, you will find the nearness that fills every emptiness and replaces solitude with serenity."
    },
    {
      "id": 16,
      "title": "البقرة ١٥٢ / Al-Baqarah 152",
      "verse_text": "يقول الله تعالى: ﴿فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ﴾ [البقرة: ١٥٢]",
      "content": "انظر يا عزيزي القارئ، هذه الآية وحدها كفيلة بأن تزيل من قلبك كل شعور بالوحدة أو الغربة. الله جلّ جلاله يخاطبك أنت مباشرة: اذكرني، أذكرك. أي أنك إذا ذكرت ربك بلسانك وقلبك وعملك، فإن الله العظيم يذكرك هو، يذكرك عند نفسه وعند ملائكته. فأي أنس أعظم من أن يذكرك خالق السماوات والأرض؟ ابن كثير قال: “أي: اذكروني بطاعتي أذكركم برحمتي ومغفرتي، وقال مجاهد: اذكروني في الدنيا أذكركم في الآخرة.” والطبري قال: “اذكروني بالإيمان والطاعة أذكركم بالثواب والمغفرة.” وقال القرطبي: “هذه أعظم كرامة للمؤمن، أن يكون جزاء ذكره لربه ذكرَ الرب له.” والسعدي أوضح المعنى فقال: “فمن ذكر ربه في نفسه ذكره الله في نفسه، ومن ذكره في ملأ ذكره الله في ملأ خير منه.” وتأمل آخر الآية: ﴿واشكروا لي ولا تكفرون﴾. كأن الله يربط الذكر بالشكر، ويعلّمك أن علاج الوحدة ليس فقط بذكره باللسان، بل بأن ترى نعمه وتملأ قلبك بالشكر له. هذا يفتح لك أبواب السكينة والأنس، فلا تعود بحاجة إلى أحد بجوارك، لأن الله نفسه معك، يذكرك، يرعاك، ويعطيك فوق ما ترجوه. فيا من يشعر بالوحدة: هذه الآية تقول لك، إن أردت أن لا تبقى وحدك، فاذكر ربك. لأنك حين تذكره، يذكرك هو، ويكفيك ذلك أنسًا وسعادةً وملاذًا.",
      "english_content": "“So remember Me; I will remember you. And be grateful to Me and do not deny Me.” [Al-Baqarah: 152] Look, dear reader, this verse alone is enough to remove every feeling of loneliness or estrangement from your heart. Allah, the Almighty, is speaking to you directly: Remember Me, I will remember you. That means when you remember your Lord with your tongue, your heart, and your actions, Allah—the Creator of the heavens and the earth—remembers you. Can there be any companionship greater than this: that the Lord of Majesty mentions you to Himself and to His angels? Ibn Kathir said: “Remember Me through obedience, I will remember you with My mercy and forgiveness. Mujahid said: Remember Me in the world, I will remember you in the Hereafter.” Al-Tabari explained: “Remember Me with faith and obedience, I will remember you with reward and forgiveness.” Al-Qurtubi added: “This is the greatest honor for a believer: that the reward of remembering his Lord is that the Lord remembers him.” And Al-Sa’di clarified: “Whoever remembers Allah within himself, Allah remembers him within Himself, and whoever remembers Allah in a gathering, Allah remembers him in a gathering better than it.” Notice also the end of the verse: “And be grateful to Me and do not deny Me.” Allah ties remembrance with gratitude, teaching us that the cure for loneliness is not only by remembering Him with words, but also by filling your heart with gratitude for His countless blessings. This brings peace, comfort, and companionship, so that you are never truly alone—for Allah Himself is with you, remembering you, caring for you, and granting you more than you could ever hope for. So, to the one who feels lonely: this verse whispers to you—if you do not want to remain alone, then remember your Lord. For when you remember Him, He remembers you, and that alone is enough to fill your heart with joy, comfort, and closeness."
    },
    {
      "id": 17,
      "title": "المزمل ٨ / Al-Muzzammil 8",
      "verse_text": "قال الله تعالى: ﴿وَٱذۡكُرِ ٱسۡمَ رَبِّكَ وَتَبَتَّلۡ إِلَيۡهِ تَبۡتِيلٗا﴾ [المزمل: ٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتيك كرسالة رقيقة من الله، تدعوك إلى أن تملأ فراغ وحدتك بذكر اسمه. ليس أي ذكر، بل ذكر عميق حي، يقطعك عن كل ما سواه ويجعلك متصلًا به اتصالًا لا يشوبه انشغال. \"تبتل إليه تبتيلا\" معناها: أخلص نفسك كلها لله، وتوجّه إليه بقلبك وجوارحك، كأنك تقطع خيوط التعلّق بالدنيا لتبقى متصلًا بخيط واحد هو خيط القرب من الله. ابن كثير قال: “أي أكثر من ذكره، وانقطع إليه، وتفرغ لعبادته.” والطبري قال: “ابتغِ إليه بتبتيلك وجهك وإخلاصك.” والقرطبي أوضح أن التبتل هو الانقطاع عن غير الله، لا بمعنى ترك العمل أو الدنيا، بل بمعنى أن يكون قلبك كله مع الله وإن كنت في وسط الناس. هذه الآية تعطي معنى عظيم لمن يشعر بالوحدة: أن وحدتك تتحول إلى قرب إذا ملأتها بذكر اسم الله. أن الخلوة التي تخافها تصبح ساحة نور إذا رددت فيها أسماءه، وإذا صارت جوارحك ولسانك وقلبك كلها تبتلًا له. فهي كأنها تقول لك: إذا ضاقت بك الوحدة، فلا تبحث عن أن تملأها بأصوات الناس فقط، بل املأها باسم ربك، فهو الذي لا يغيب ولا يتركك، وهو أقرب إليك من كل قريب.",
      "english_content": "“And remember the name of your Lord and devote yourself to Him with [complete] devotion.” [Al-Muzzammil: 8] Look, my dear reader, this verse comes as a tender message from Allah, inviting you to fill the emptiness of loneliness with His remembrance. Not just any remembrance, but a living, deep one that detaches you from everything else and ties you solely to Him. “Devote yourself to Him with complete devotion” means: give your whole self to Allah, turning your heart and actions toward Him, as if you cut off every worldly thread and hold on to the one thread of closeness to Him. Ibn Kathir said: “Increase in remembering Him, and devote yourself to Him, and free yourself for His worship.” Al-Tabari explained: “Seek Him with your devotion and sincerity.” And Al-Qurtubi clarified that devotion here means detaching the heart from other than Allah — not abandoning life or work, but having your heart fully with Allah even when you are among people. This verse carries a profound meaning for anyone who feels alone: your solitude turns into nearness if you fill it with the remembrance of Allah’s name. The isolation you fear becomes a garden of light when you call upon Him, when your tongue, your heart, and your limbs all live in devotion to Him. It is as if the verse is telling you: if loneliness overwhelms you, don’t only look for the voices of people to fill it, but fill it with the name of your Lord — the One who never leaves you, the One who is closer to you than any companion."
    },
    {
      "id": 18,
      "title": "الأنفال ٢ / Al-Anfal 2",
      "verse_text": "يقول الله تعالى : ﴿إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَـٰتُهُ زَادَتۡهُمۡ إِيمَـٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ﴾ [الأنفال: ٢]",
      "content": "انظر يا عزيزي القارئ، هذه الآية ترسم ملامح القلب المؤمن حقًا. قد تشعر أحيانًا بالوحدة، كأنك غريب في هذا العالم، لا أحد يفهمك أو يشاركك شعورك. لكن الله هنا يصف لك الصحبة الحقيقية التي لا تزول: أن يكون قلبك معلقًا به. يقول: ﴿إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ﴾، أي إذا سمعوا اسم الله ارتجفت قلوبهم، لا خوفًا وحسب، بل مهابةً ومحبّةً وتعظيمًا. هذا الوجل يُبدّد فراغ الوحدة، لأنه يجعلك تعيش مع الله حاضرًا دائمًا في قلبك. ثم قال: ﴿وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَـٰتُهُ زَادَتۡهُمۡ إِيمَـٰنٗا﴾، أي أن القرآن لا يمر عليهم مرورًا عابرًا، بل يزيدهم يقينًا وقوةً وطمأنينة. هنا يكمن السر: الناس قد يتركونك، لكن كلما جلست مع آيات الله، تجد قلبك ينمو بالإيمان، ويشتدّ ضد الوحشة. وأخيرًا: ﴿وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ﴾. أي هم يضعون اعتمادهم الكامل على الله وحده، لا على بشر قد يخيبون، ولا على دنيا قد تزول. التوكل يملأ قلبك بسكينة لا يملك أحد أن يمنحك إياها، لأنه يجعلك متيقنًا أنك لست وحدك أبدًا، فالله يتولى أمرك. ابن كثير قال: “هذا وصف المؤمن الكامل، وجِل قلبه عند ذكر الله، وزيادة إيمانه بتلاوة كتابه، وتوكله على ربه في أموره.” والطبري قال: “وجلت قلوبهم: خافت فرقًا منه، وزادتهم الآيات يقينًا.” والسعدي قال: “إذا تليت عليهم آياته ازداد علمهم ويقينهم، فكلما أكثر العبد من سماع كلام الله كان أقوى إيمانه.” فتأمل يا عزيزي القارئ، هذه الآية كأنها تقول لك: إن الوحدة الحقيقية ليست في قلة الناس من حولك، بل في غياب ذكر الله من قلبك. فإذا ذكرته وجِل قلبك، وإذا تليت آياته زاد إيمانك، وإذا توكلت عليه، لم يبق مكان للوحدة أبدًا، لأنك مع الله دائمًا.",
      "english_content": "“The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely.” [Al-Anfal: 2] Look, dear reader. This verse paints for us the portrait of the true believer’s heart. Sometimes you might feel lonely, like a stranger in this world, with no one to truly understand or share your feelings. But Allah here shows you the true companionship that never leaves: having your heart attached to Him. He says: “when Allah is mentioned, their hearts become fearful”. This is not just a fear of punishment, but a trembling born of awe, love, and reverence. That trembling itself fills the emptiness of loneliness, because it means you live with Allah’s presence always alive within your heart. Then He says: “When His verses are recited to them, it increases them in faith”. The Qur’an doesn’t pass them by as ordinary words—it strengthens their certainty, their resilience, and their inner peace. Here lies the secret: people may abandon you, but whenever you sit with the words of Allah, your heart grows in faith and becomes fortified against isolation. And finally: “and upon their Lord they rely”. They place their full trust in Allah alone—not in people who may disappoint, nor in a worldly life that will fade. This reliance fills the heart with a serenity no human can give, because it assures you that you are never truly alone—Allah is handling your affairs. Ibn Kathir said: “This is the description of the complete believer: his heart trembles when Allah is mentioned, his faith increases with the recitation of His Book, and he relies upon his Lord in all matters.” Al-Tabari said: “Their hearts tremble: they fear Him with awe; His verses increase their certainty.” And Al-Sa‘di said: “Whenever they hear Allah’s words, their knowledge and certainty grow stronger, so the more the servant listens to His Book, the stronger his faith becomes.” So reflect, dear reader: this verse is telling you that loneliness is not truly about how many people are around you. The real loneliness is when Allah is absent from your heart. But if your heart trembles at His mention, if His verses increase your faith, and if you rely upon Him, then you are never alone—for Allah is always with you."
    },
    {
      "id": 19,
      "title": "المدثر ٣-٥ / Al-Muddaththir 3-5",
      "verse_text": "﴿وَرَبَّكَ فَكَبِّرْ (٣) وَثِيَابَكَ فَطَهِّرْ (٤) وَالرُّجْزَ فَاهْجُرْ (٥)﴾ [المدثر: ٣-٥]",
      "content": "عزيزي القارئ، هذه الآيات الكريمة نزلت على قلب النبي ﷺ في بدايات الرسالة، في لحظة كان فيها وحيدًا أمام تكليف عظيم يفوق الوصف. تخيل معي ذلك الموقف: رجل في غار حراء، يتلقى الخطاب من الله تعالى مباشرة، ليبدأ أعظم مهمة في تاريخ البشرية. وبينما قد يظن المرء أن الوحدة ستثقل قلبه، جاء الخطاب الإلهي ليغمره بالمعية والتوجيه، وكأنه يقول: لست وحدك، ربك معك، يوجهك، ويثبتك، ويعلمك خطوات السير. أول أمر: ﴿وَرَبَّكَ فَكَبِّرْ﴾. أي عظِّم ربك فوق كل شيء، كبِّره في قلبك حتى يصغر ما سواه. وهنا نجد العلاج الأول لشعور الوحدة: إذا عظمت الله في داخلك، فإنك لن تشعر بوحشة، لأنك مرتبط بالعظيم، القريب، السميع، البصير. قال ابن كثير: “أي عظِّم ربك عن الشركاء والنظراء، ونزهه عما يقول الظالمون.” فالانشغال بالله يملأ فراغ القلب، فلا يبقى فيه موضع لوحشة البشر. ثاني أمر: ﴿وَثِيَابَكَ فَطَهِّرْ﴾. والمقصود كما قال المفسرون: طهِّر نفسك وأعمالك من الذنوب، كما تطهِّر ثيابك من الدنس. ابن جرير الطبري قال: “طهِّر عملك من الرياء.” أي أن طهارة الداخل والخارج طريق السكينة، فالوحدة الحقيقية ليست في غياب الناس، بل في غياب النقاء بينك وبين الله. فإذا طهرت قلبك، وجدت السكينة ملازمة لك حتى وأنت منفرد. ثالث أمر: ﴿وَالرُّجْزَ فَاهْجُرْ﴾. أي ابتعد عن الأوثان والذنوب وكل ما يغضب الله. وهذه دعوة للخروج من دائرة كل ما يسبب ضيق الصدر. فالهجر هنا ليس مجرد ترك، بل هو مفارقة تامة مع نية وعزم، وكأن الله تعالى يقول لنبيه: إذا شعرت بوحدة في طريق الحق، فاعلم أن الهجر لما يكرهه الله سيعوضك بمعيته التي لا تنقطع. القرطبي رحمه الله قال: “هذه وصايا عظيمة للنبي صلى الله عليه وسلم، وهي وصايا لكل مؤمن بعده، ليكون عبدًا خالصًا لربه، مطهَّرًا من الآثام، منصرفًا عن كل باطل.” وكأنها خارطة طريق لمن يسلك طريق الله وهو يشعر بالوحدة: كبِّر الله، طهِّر قلبك، اهجر الباطل. فتأمل يا عزيزي القارئ، كيف أن هذه الآيات جاءت في بدايات الرسالة لتقول: حتى لو كنت وحدك في مواجهة الدنيا، فأنت لست وحدك. معك ربك، ومعك التكبير، ومعك الطهارة، ومعك الهجر للباطل، وهذا يكفيك. فكل من سار على طريق الإيمان وشعر بالوحشة، فليجد عزاءه في هذه الكلمات: كبِّر ربك، طهِّر قلبك، واهجر الباطل، ستجد أن الوحدة تتحول إلى أنس لا يُوصف، وأنك في معية الله الذي لا يترك عباده الصادقين.",
      "english_content": "“And your Lord glorify, And your clothing purify, And uncleanliness avoid.” [Al-Muddaththir: 3-5] Dear reader, these verses descended upon the heart of the Prophet ﷺ at the very beginning of the mission, in a moment when he stood seemingly alone before a burden greater than words can describe. Imagine that scene: a man in the cave of Ḥirā’, suddenly entrusted with the greatest message in human history. What could have been a crushing solitude was lifted by the voice of God Almighty, teaching him that he was never truly alone. The first command: “And your Lord glorify.” Magnify your Lord above all else, fill your heart with His greatness until everything else becomes small. This is the first cure for loneliness: when you fill your inner world with the awareness of God, you will never feel empty, because you are tethered to the One who is near, who hears, who sees. Ibn Kathir explained: “That is, exalt your Lord above partners and equals, and declare Him far above what the wrongdoers claim.” When you busy yourself with God, solitude becomes companionship. The second command: “And your clothing purify.” This, as the scholars explained, points not only to physical garments but to one’s deeds and inner state. Ibn Jarir al-Ṭabari said: “Purify your deeds from hypocrisy.” In other words, cleanse your soul as you cleanse your clothes, for true comfort in solitude is not the absence of people but the presence of purity between you and God. The third command: “And uncleanliness avoid.” This refers to idols, sins, and all that distances one from Allah. To “avoid” here is not a mere turning away, but a complete separation filled with determination. It is as though Allah is telling His Prophet: if you feel alone walking the path of truth, know that abandoning what He hates will be replaced by His constant nearness and protection. Imam al-Qurtubi beautifully wrote: “These are tremendous instructions for the Prophet ﷺ, and they are instructions for every believer after him: to be devoted to his Lord, purified from sin, and detached from all falsehood.” Reflect on this, dear reader: these verses were revealed at the very dawn of revelation to tell the Prophet ﷺ—and us by extension—that even if you stand alone before the world, you are not alone. You have your Lord. You have the act of glorification. You have purification. You have the courage to abandon falsehood. And that is more than enough. So if you ever walk the road of faith and feel its solitude, find comfort in these words: glorify your Lord, purify your heart, and avoid what displeases Him. In that, you will discover that loneliness transforms into a sweetness of divine companionship that words cannot capture."
    }
  ]
}