{
  "feeling": "الندم",
  "verses": [
    {
      "id": 1,
      "title": "البقرة ٢٢٢",
      "verse_text": "﴿إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلۡمُتَطَهِّرِينَ﴾ [البقرة: ٢٢٢]",
      "content": "انظر يا عزيزي القارئ، هذه الآية في ظاهرها تتحدث عن أحكام الطهارة، لكنها تحمل في قلبها معنى أعمق يلمس شعور الندم والتوبة. فالله جل جلاله لا يقول فقط إن التوبة مقبولة، بل يرفع التائب إلى منزلة المحبوبية: \"يُحبّ التوابين\". أي أن الله يحبّ من يخطئ ثم يندم ويعود إليه بقلب منكسِر، يحبّ من يتطهّر من ذنوبه كما يتطهّر من الأوساخ، يحبّ من لا يُصرّ على خطيئته بل يندم ويستغفر ويجدد العهد معه. ابن كثير قال: \"التوابون: الذين يتوبون من الذنوب، والمتطهرون: من النجاسات والأحداث.\" والطبري قال: \"إن الله يحبّ المكثرين من التوبة، المقلعين عن الذنوب.\" والقرطبي بيّن أن التوبة لا تكون إلا مع الندم، فالتائب الحق هو الذي يحترق قلبه ندمًا على ما مضى، ويستدرك بالمغفرة ما فات. فتأمل كيف أن القرآن يُحوّل شعور الندم من ألم يثقل الصدر إلى طريق محبة ورضوان. كأن الآية تقول لك: لا تجعل الندم يقودك إلى اليأس، بل اجعله يقودك إلى التوبة، لأن الله لا يكرهك على ذنبك، بل ينتظرك أن تعود. وما أعظم أن يكون أثر ندمك أن تدخل دائرة \"محبة الله\".",
      "english_content": "“Indeed, Allah loves those who are constantly repentant.” [Al-Baqarah: 222] Look, my dear reader. At first glance, this verse speaks about rules of purity, but deep inside it carries a meaning that touches the feeling of regret and repentance. Allah does not merely say that repentance is accepted—He elevates the repentant to the status of being loved: “Allah loves those who are constantly repentant.” That means Allah loves the one who sins and then feels remorse, who turns back to Him with a broken heart, who cleanses himself from sins just as he cleanses his body. He loves the one who doesn’t persist in his wrongdoing but instead feels regret, seeks forgiveness, and renews his bond with Him. Ibn Kathir explained: “The repentant are those who turn back from sins, and the purified are those who cleanse themselves from impurities.” Al-Tabari said: “Indeed, Allah loves those who frequently repent, those who give up sins.” Al-Qurtubi pointed out that repentance cannot exist without regret—for true repentance is when the heart burns with remorse over what has passed, and seeks Allah’s pardon for what went before. So reflect: the Qur’an transforms the feeling of regret from a burden that weighs down the chest into a path leading to love and acceptance. It is as if the verse whispers to you: Do not let regret drag you into despair. Let it carry you back to Allah. He does not hate you for your sin; rather, He waits for you to return. And what greater gift than for your regret to make you one of those whom Allah loves?"
    },
    {
      "id": 2,
      "title": "آل عمران ١٣٥",
      "verse_text": "﴿وَٱلَّذِينَ إِذَا فَعَلُواْ فَـٰحِشَةً أَوْ ظَلَمُوٓاْ أَنفُسَهُمْ ذَكَرُواْ ٱللَّهَ فَٱسْتَغْفَرُواْ لِذُنُوبِهِمْ وَمَن يَغْفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمْ يُصِرُّواْ عَلَىٰ مَا فَعَلُواْ وَهُمْ يَعْلَمُونَ﴾ [آل عمران: ١٣٥]",
      "content": "انظر يا عزيزي القارئ، هذه الآية كأنها تتحدث عن لحظة الندم التي يعرفها كل إنسان. لحظة يسقط فيها في خطأ أو ذنب، فيجد نفسه بين نارين: نار الشعور بالذنب ونار الخوف من الله. لكن القرآن يفتح أمامه باب النجاة: ﴿ذَكَرُواْ ٱللَّهَ﴾، أي لم ينسوا أن لهم ربًا رحيمًا ينتظر رجوعهم، فلم يستسلموا لليأس، بل أسرعوا إلى الاستغفار. تأمل جمال الآية: لم تقل إن المؤمنين لا يخطئون، بل قالت: ﴿إِذَا فَعَلُواْ فَـٰحِشَةً أَوْ ظَلَمُوٓاْ أَنفُسَهُمْ﴾. أي أنهم بشر يزلّون، لكن الفرق أنهم حين يخطئون لا يتمادون، بل يتذكرون الله فورًا، فيندمون ويستغفرون. ثم يأتي السؤال الذي يملأ القلب بالرجاء: ﴿وَمَن يَغْفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ﴾. كأن الله يقول لك: لا تبحث بعيدًا، لا تحمل ذنبك وحدك، فأنا الغفور الذي أنتظرك. ابن كثير قال: \"أي ذكروا عظمة الله وخافوا عقابه، فسألوه أن يغفر لهم ذنوبهم.\" والطبري قال: \"أي لم يقيموا على المعصية مصرّين عالمين بقبحها، بل أقلعوا عنها وندموا.\" والسعدي لخصها بقوله: \"هذه صفة المؤمنين، وقوع الذنب منهم لا يضرهم إذا بادروا بالتوبة والندم، والإقلاع عن المعصية.\" فتأمل، يا قارئي العزيز، أن الآية لا تعالج الندم بإلقاء العتاب فقط، بل تجعل من الندم بداية حياة جديدة. تجعل الشعور بالذنب محرّكًا للاستغفار، لا جدارًا يحجبك عن الله. وكأنها تهمس لك: إذا وقعت في الذنب فلتكن ردة فعلك الأولى أن تذكر الله، أن تقول: ربي اغفر لي. لا تصرّ، لا تتمادى. دع الندم يقودك إلى المغفرة، لا إلى الغرق.",
      "english_content": "“And those who, when they commit an immorality or wrong themselves, remember Allah and seek forgiveness for their sins. And who can forgive sins except Allah? And [they] do not persist in what they have done while they know.” [Aal-Imran: 135] Look, dear reader, this verse speaks directly to that heavy moment of regret every human being experiences. The moment you slip into a sin or make a mistake, and you find yourself torn between the pain of guilt and the fear of Allah’s displeasure. Yet, the Qur’an opens a door of hope: “they remember Allah”—meaning they don’t drown in despair, they don’t forget their Lord, but they immediately turn back to Him, acknowledging their fault. Notice the beauty: the verse doesn’t say believers never sin; it says when they do commit a shameful deed or wrong themselves, they react differently. They remember Allah instantly, and that remembrance awakens regret in their hearts, pushing them to seek forgiveness. Then comes the tender question that fills the heart with hope: “And who can forgive sins except Allah?” It’s as if Allah Himself is telling you: Don’t look elsewhere, don’t carry this burden alone. I am the One who forgives, and I am waiting for you. Ibn Kathir said: “They remember the greatness of Allah and fear His punishment, so they ask Him to forgive their sins.” Al-Tabari explained: “They do not persist in their sins knowingly, but they abandon them and repent.” And Al-Sa‘di summed it beautifully: “This is the trait of the believers: committing a sin does not harm them if they quickly repent, regret, and abandon the wrongdoing.” So reflect, dear reader: this verse doesn’t treat regret as despair, but as a turning point, a moment of awakening. It transforms guilt into a path back to Allah. It whispers to you: If you fall, don’t stay down. Let your first reaction be to remember Allah, to say, ‘My Lord, forgive me.’ Don’t persist, don’t justify it. Let regret guide you to mercy, not to ruin."
    },
    {
      "id": 3,
      "title": "النساء ١٧",
      "verse_text": "﴿إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوٓءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِن قَرِيبٖ فَأُوْلَٰٓئِكَ يَتُوبُ ٱللَّهُ عَلَيْهِمۡۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا﴾ [النساء: ١٧]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تصف لك حالة الإنسان حين يسقط في المعصية ثم يندم. الله جل جلاله يفتح باب التوبة، لكنّه يحدد مَن هم الذين يُقبلون عنده: الذين يعملون السوء بجهالة، ثم يتوبون من قريب. ابن عباس رضي الله عنهما قال: \"كل من عصى الله فهو جاهل، سواء أكان عمدًا أو خطأ.\" ومعنى \"بجهالة\" هنا ليس الجهل بالمعرفة فقط، بل هو غلبة الهوى، غفلة القلب، اندفاع النفس وراء الشهوة، كأنّ المرء في لحظة معصيته أعمى عن الحق. ثم إذا أفاق من غفلته، وأدرك قبح ما فعل، وندم بصدق، وسارع بالتوبة قبل أن يطول به الأمد، فإن الله يتوب عليه. ابن كثير قال: \"أي كل من عمل ذنبًا فهو جاهل، ومن تاب قريبًا قُبلت توبته.\" والطبري قال: \"التوبة التي أوجبها الله على نفسه لعباده، هي لمن عمل السوء وهو جاهل، ثم تاب قبل الموت.\" والسعدي قال: \"هذه التوبة مقبولة؛ لأنهم تابوا حال قدرتهم على العمل، ولم يصرّوا.\" فتأمل يا عزيزي القارئ: الآية وكأنها تقول لك إن ندمك على ذنبك هو دليل حياة قلبك. الله لا يغلق الباب في وجهك إذا أذنبت، بل يقول لك: تب من قريب. لا تؤخر التوبة حتى يغلُبك الموت أو يطول بك التسويف. شعور الندم الذي يهزّ داخلك الآن هو دعوة من الله أن ترجع إليه سريعًا، لتكون من هؤلاء الذين وعدهم أن يتوب عليهم. كأنها رسالة مباشرة: لا تحقر نفسك إذا أخطأت، ولا تؤخر عودتك، بل اغتنم لحظة الندم هذه، فهي نفسها باب مفتوح من ربك العليم الحكيم.",
      "english_content": "“The repentance accepted by Allah is only for those who do wrong in ignorance [or heedlessness] and then repent soon after. It is they to whom Allah will turn in forgiveness, and Allah is ever Knowing and Wise.” [An-Nisa: 17] Look, my dear reader, this verse describes the state of a human being when he falls into sin and then regrets it. Allah Almighty opens the door of repentance, but He clarifies who are the ones whose repentance is truly accepted: those who commit wrongdoing out of ignorance, heedlessness, or being overpowered by desire, and then repent soon after. Ibn ʿAbbas (may Allah be pleased with him) said: “Everyone who disobeys Allah is ignorant, whether intentionally or unintentionally.” The word “ignorance” here does not only mean lack of knowledge, but also the blindness of the heart when desire dominates, the heedlessness that makes one forget Allah in the moment of sin. But when he wakes up from that heedlessness, realizes the ugliness of his act, and sincerely regrets it, hastening to repent before it is too late, then Allah promises to forgive him. Ibn Kathir said: “That is, everyone who commits a sin is ignorant, and whoever repents soon after, his repentance will be accepted.” Al-Tabari said: “The repentance that Allah made obligatory upon Himself is for the one who commits evil out of ignorance and then repents before death.” Al-Saʿdi said: “This repentance is accepted because they repented while still able to act and did not persist in sin.” So reflect, dear reader: this verse is speaking to you directly. The regret you feel after a sin is a sign of your heart being alive. Allah is not closing the door in your face; rather He is saying to you: repent soon, without delay. Do not postpone it until death overcomes you, or until habit chains you down. The very moment of remorse you feel now is itself an invitation from Allah to return to Him. It is as if the verse is telling you: never belittle yourself because of a mistake, and never delay your return. Seize the moment of regret — for it is a door wide open from your All-Knowing, All-Wise Lord."
    },
    {
      "id": 4,
      "title": "الأعراف ٢٣",
      "verse_text": "﴿قَالَا رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ﴾ [الأعراف: ٢٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية هي أول دعاء للتوبة في تاريخ البشرية، على لسان أبينا آدم وأمنا حواء عليهما السلام، بعدما وقعا في الخطأ وأكلا من الشجرة التي نهاهما الله عنها. بدلًا من أن يبررا فعلتهما أو يلقيا باللوم على أحد، قالا مباشرة: ﴿رَبَّنَا ظَلَمْنَا أَنفُسَنَا﴾. اعتراف صريح بالذنب، وتحميل النفس المسؤولية، وكأنهما يقولان: ما ظلمناك يا رب، نحن الذين خسرنا أنفسنا بما فعلنا. ثم يأتيا بالرجاء العظيم: ﴿وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا﴾، أي يا رب، لا نجاة لنا إلا بمغفرتك، ولا حياة لنا إلا برحمتك. هنا يظهر معنى الندم الحقيقي: شعور بالذنب، خوف من الخسارة، ورجاء في رحمة الله. ولهذا ختم الدعاء بالقول: ﴿لَنَكُونَنَّ مِنَ الْخَاسِرِينَ﴾، أي لا مخرج لنا من الخسران إلا أن تغفر وترحم. ابن كثير قال: هذا اعتراف وافتقار من آدم وحواء إلى الله، وإقرار بالذنب، وتوسل إلى الله بأسمائه وصفاته ليغفر لهما. والطبري قال: أي إن لم تغفر لنا ما أذنبنا، وترحمنا فتعفو عنا، لنهلكنّ. والسعدي قال: في هذه الآية أن من تمام التوبة الاعتراف بالذنب، وطلب المغفرة، والاعتراف بالحاجة إلى رحمة الله. فتأمل يا عزيزي القارئ: هذا الدعاء هو مدرسة في الندم والتوبة. يعلمك أن السعادة لا تكون بإنكار الخطأ أو التكبر، بل بالاعتراف، والانكسار، واللجوء إلى رحمة الله. كلما أخطأت فاذكر كلمات أبويك آدم وحواء، ورددها بيقين: ربنا ظلمنا أنفسنا، فإن لم تغفر لنا وترحمنا لنكونن من الخاسرين.",
      "english_content": "\"They said, 'Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.'\" [Al-A'raf: 23] Look, my dear reader, this verse is the very first prayer of repentance in human history, spoken by our father Adam and our mother Hawwa (Eve), peace be upon them both, after they slipped and ate from the tree that Allah had forbidden them. Instead of justifying their mistake or blaming anyone else, they turned directly to Allah with honesty: “Our Lord, we have wronged ourselves.” It was a pure confession, an acknowledgment that the harm of their sin was upon themselves, not against Allah. Then comes the plea that carries the essence of regret: “And if You do not forgive us and have mercy upon us…” — meaning, “O Lord, without Your forgiveness and mercy, there is no salvation for us, no life, no hope.” This is the core of true repentance: a heart heavy with guilt, aware of loss, yet clinging to Allah’s mercy. And so they ended their supplication: “we will surely be among the losers.” It’s as if they’re saying, “Without Your mercy, O Lord, we are doomed.” Ibn Kathir explained: “This is an acknowledgment and a declaration of need from Adam and Hawwa, admitting their sin and pleading with Allah by His names and attributes to forgive them.” Al-Tabari said: “If You do not forgive our sin and have mercy upon us, then we will surely perish.” And Al-Sa’di wrote: “In this verse is the lesson that true repentance is built on confessing the sin, asking forgiveness, and recognizing the absolute need for Allah’s mercy.” So, reflect on this deeply: this supplication is a timeless lesson. It teaches you that happiness and relief from guilt don’t come from denying mistakes or covering them up, but from admitting them sincerely and returning to Allah with humility. Every time you slip, remember the words of your first parents, Adam and Hawwa, and repeat them with conviction: “Our Lord, we have wronged ourselves. And if You do not forgive us and have mercy upon us, we will surely be among the losers.”"
    },
    {
      "id": 5,
      "title": "التوبة ١٠٤",
      "verse_text": "﴿أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ﴾ [التوبة: ١٠٤]",
      "content": "انظر يا عزيزي القارئ، هذه الآية كأنها تفتح بابًا واسعًا لكل من أرهقه الندم وأثقلته الذنوب. الله يخاطب عباده بقوله: ألم يعلموا؟، صيغة سؤال لكنها في الحقيقة تذكير وتنبيه، كأنها تقول: أما علمتم أن الله هو الذي يقبل التوبة من عباده؟ أي أن الباب لم يُغلق، وأن الذنب مهما كبر فإن التوبة تمسحه إذا كانت صادقة. ثم يزيد الطمأنينة: ويأخذ الصدقات. لاحظ التعبير: \"يأخذ\"، وكأن الله تعالى يقبل الصدقة بيده الكريمة كما ورد في الحديث: «إن الله يقبل الصدقة بيمينه فيربيها لصاحبها كما يربي أحدكم فَلوَّه» (رواه مسلم). فالتوبة والصدقة كلاهما طريق لتطهير القلب وتخفيف ثقل الذنب، وكلاهما مقبول عند الله إذا خرج من قلب مخلص. ويختم بقوله: وأن الله هو التواب الرحيم. كلمة \"التواب\" تعني كثير القبول للتوبة، يكرر على عباده فتح الباب مرة بعد مرة، لا يملّ من رجوعهم، بل يحب ذلك منهم. و\"الرحيم\" ليؤكد أن توبته ليست قبولًا جافًا، بل قبول ممتزج برحمة، بعطف، بمغفرة تغسل الذنب وتُبدله أحيانًا حسنات. ابن كثير قال: \"هذا إخبار منه تعالى بأنه يقبل توبة عباده من أي ذنب كان، ويأخذ صدقاتهم أي يقبلها، وأنه التواب على من تاب، الرحيم بهم.\" والطبري قال: \"التواب: كثير الرجوع على عباده بالعفو، الرحيم: واسع الرحمة بهم.\" والقرطبي أضاف: \"هذه الآية أعظم بشارة لكل مذنب، لأنها نصّ أن الله يتوب على من تاب مهما عظم ذنبه.\" فكأن الآية تخاطبك أنت أيها النادم: لا تظن أن ذنبك سدّ الطريق، ولا أن كثرة خطاياك أغلقت الأبواب. الله هو التواب الذي يفرح برجوعك، وهو الرحيم الذي يغمر قلبك بالراحة بعد أن كان مكدودًا بالندم. إذا صدقت في التوبة وأتبعتها بعمل صالح أو صدقة، فقد علمت أن الله يقبل منك، ويجعل من لحظة ندمك بداية لحياة جديدة مليئة بالطمأنينة.",
      "english_content": "“Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful?” [At-Taubah: 104] Look, my dear reader. This verse is like an open door for every soul weighed down by regret and guilt. Allah reminds His servants: Do they not know? It’s a question, but in reality it’s a wake-up call, as if to say: “Haven’t you realized that Allah is the One who accepts repentance from His servants?” No matter how heavy the sin, no matter how often you have fallen, the moment you return sincerely, the door is not closed. Then comes a tender reassurance: “and receives charities.” Notice the word receives—it paints the image of Allah Himself taking the charity with honor and acceptance. In the Hadith, the Prophet ﷺ said: “Indeed, Allah accepts charity with His Right Hand, then nurtures it for one of you as one of you nurtures his foal, until it becomes like a mountain.” (Muslim). So, repentance and charity are both ways of cleansing the heart and lightening the burden of guilt, and both are embraced by Allah when they come from sincerity. And the verse concludes with: “And that it is Allah who is the Accepting of repentance, the Merciful.” The name At-Tawwāb means the One who accepts repentance again and again, no matter how many times His servant returns. He never grows tired of welcoming the repentant back. And Ar-Rahīm shows that His acceptance is not cold or reluctant, but is wrapped in mercy, kindness, and even transforming sins into good deeds. Ibn Kathir said: “This is Allah’s declaration that He accepts repentance from His servants for any sin, and that He accepts their charities, and that He is the One who repeatedly turns to His servants with forgiveness, the Merciful toward them.” Al-Tabari explained: “At-Tawwāb is the One who often returns to His servants with pardon, and Ar-Rahīm is the One who extends His vast mercy to them.” And Al-Qurtubi said: “This verse is the greatest glad tidings for every sinner, for it states that Allah accepts the repentance of anyone who repents, no matter how great the sin.” So reflect, my dear reader: this verse is speaking directly to you in your regret. Don’t think your sin has blocked the path. Don’t believe that the door is shut because of how often you’ve slipped. Allah is At-Tawwāb, who rejoices when you return, and Ar-Rahīm, who fills your heart with peace after it was choked by guilt. If you repent sincerely and follow it with good deeds or charity, then you can be certain—Allah has accepted you, and from your regret He has made the start of a new life of calm and hope."
    },
    {
      "id": 6,
      "title": "الزمر ٥٣",
      "verse_text": "﴿قُلۡ يَـٰعِبَادِيَ ٱلَّذِينَ أَسۡرَفُواْ عَلَىٰٓ أَنفُسِهِمۡ لَا تَقۡنَطُواْ مِن رَّحۡمَةِ ٱللَّهِۚ إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ﴾ [الزمر: ٥٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تُسمّى عند كثير من العلماء \"أرجى آية في كتاب الله\". الله سبحانه يخاطب مباشرة عباده الذين غرقوا في الذنوب، الذين تجاوزوا الحدود وأسرفوا على أنفسهم، الذين ربما ظنوا أن لا رجعة لهم ولا فرصة بعد ما فعلوا. ومع ذلك، يفتح الله لهم باب الخطاب بنفسه: ﴿قُلۡ يَـٰعِبَادِيَ﴾. لاحظ، ما قال: يا أيها العصاة أو يا أيها المذنبون، بل قال: يا عبادي. نسبهم إليه رغم ذنوبهم، ليشعروا أنهم ما زالوا في دائرة رحمته. ثم يضع القاعدة العظيمة: ﴿لَا تَقۡنَطُواْ مِن رَّحۡمَةِ ٱللَّهِ﴾. القنوط هو اليأس التام، أن تشعر أن لا أمل لك. والله هنا يحطّم هذا الشعور تمامًا، يقول لك: لا تيأس، لا تنكسر حتى تظن أن الرحمة ليست لك. ثم تأتي البشرى العظمى: ﴿إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًا﴾. كلمة \"جميعًا\" هنا تمسح كل شك، كل استثناء يتوهمه الإنسان. ذنبك مهما كان كبيرًا، قديماً، متكررًا، ما دام صاحبه رجع إلى الله بصدق، فإنه داخل تحت هذا الوعد. ويختم بالسبب: ﴿إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ﴾. ليس فقط أنه يغفر الذنوب، بل هو الغفور الذي يكرّر المغفرة لعباده مهما عادوا، وهو الرحيم الذي يغمرهم بعد المغفرة بالطمأنينة والسكينة. ابن كثير قال: \"هذه الآية دعوة لجميع العصاة من الكفار وغيرهم إلى التوبة والإنابة، وهي عامة في جميع الذنوب، لا يقنطن عبد من رحمة الله وإن عظمت ذنوبه وكثرت.\" وقال الطبري: \"أخبر الله أنه يغفر الذنوب جميعًا لمن تاب منها ورجع.\" وقال القرطبي: \"هي أرجى آية في القرآن، قيل إنها نزلت في وحشي قاتل حمزة، وقيل في غيره، والعبرة بعموم اللفظ.\" فتأمل يا عزيزي القارئ: هذه الآية كأنها تُمسك بيدك إذا كنت غارقًا في الندم وتقول لك: لا تيأس. مهما كان ماضيك، مهما أسرفت على نفسك، باب الله ما زال مفتوحًا، والرحمة لا تُغلق دونك. كل ما تحتاجه أن ترجع، أن تقول: رب اغفر لي، أن تصدق في توبتك. وحينها، وعد الله لك أن يغفر ذنوبك كلها بلا استثناء، ويكسوك برحمته.",
      "english_content": "“Say, ‘O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.’” [Al-Zumar: 53] Look, my dear reader. Many scholars called this the most hopeful verse in the entire Qur’an. Here Allah directly addresses those who are drowning in sin, those who have crossed every boundary, those who might believe there’s no way back. Yet Allah Himself speaks to them: “O My servants.” Notice—He didn’t say “O sinners” or “O criminals.” He still calls them My servants, claiming them as His own despite their sins. That alone is mercy. Then comes the life-giving command: “Do not despair of the mercy of Allah.” Despair is the death of the soul, the feeling that forgiveness is impossible. Allah shatters that darkness with a clear directive: never lose hope, never believe that your sins have put you beyond His reach. The next words are even more powerful: “Indeed, Allah forgives all sins.” The word all removes every imagined exception. No matter how heavy, how old, how repeated your sin is—if you turn back sincerely, it is covered by this promise. And the verse closes with reassurance: “Indeed, it is He who is the Forgiving, the Merciful.” He is not only willing to forgive once; He is Al-Ghafūr, the One who forgives again and again, and Ar-Rahīm, whose forgiveness is wrapped in tenderness, replacing despair with peace and even turning sins into reasons for greater nearness to Him. Ibn Kathir said: “This verse is a call to all sinners, disbelievers and others, to repentance and returning to Allah. It is general for all sins. No one should despair of Allah’s mercy, no matter how many or how great the sins.” Al-Tabari explained: “Allah informs that He forgives all sins for whoever repents and turns back to Him.” And Al-Qurtubi commented: “It is the most hopeful verse in the Qur’an. It was said it was revealed about Wahshi, the killer of Hamza, but the meaning is general for all.” So reflect, my dear reader: if you are burdened with regret, this verse is speaking straight to you. It is Allah calling you back, telling you not to sink in despair, not to let guilt paralyze you. Whatever your past holds, His door is still wide open. All he asks is your sincere return. And with that, every sin—all sins—are washed away, replaced by His mercy and love."
    },
    {
      "id": 7,
      "title": "الفرقان ٧٠",
      "verse_text": "﴿إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلٗا صَـٰلِحٗا فَأُوْلَـٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَـٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا﴾ [الفرقان: ٧٠]",
      "content": "انظر يا عزيزي القارئ، هذه الآية من أعظم آيات الرجاء والرحمة للمذنبين. الله يذكر قبلها صنوفًا من الكبائر: الشرك، والقتل بغير حق، والزنا، ثم يبين عظم إثمها وعقوبتها. لكن فجأة يفتح بابًا واسعًا للنور: ﴿إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلٗا صَـٰلِحٗا﴾. أي أن حتى هؤلاء، إن تابوا بصدق، وآمنوا من جديد، وأتبعوا إيمانهم بعمل صالح، فإن الله لا يكتفي بمسامحتهم فقط، بل يرفعهم إلى مقام أعجب. يقول: ﴿فَأُوْلَـٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَـٰتٖ﴾. لاحظ كلمة يبدل. ليس فقط يغفر، بل يحول الذنوب نفسها إلى حسنات. كل لحظة معصية تبت عنها تتحول في سجلّك إلى طاعة. كل دمعة ندم، كل دعاء توبة، تجعل الماضي الأسود نفسه يصبح نورًا. ابن عباس قال: “هم المؤمنون، جعل الله سيئاتهم قبل الإسلام حسنات بالتوبة.” ومجاهد قال: “يبدلهم الله بعمل السيئات أعمالًا صالحة.” وقال قتادة: “هؤلاء قوم أبدلهم الله بعبادة الأوثان عبادة الرحمن، وبالزنا عفة وإحصانًا، وبالقتل إيمانًا وجهادًا.” والسعدي قال: “هذا من أعظم فضله، أن الذنوب التي عملوها إذا تابوا منها صارت سببًا للحسنات.” ثم ختم الآية: ﴿وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا﴾. أي أنه دائمًا غفور، لا يملّ من المغفرة، ورحيم يفيض على عباده برحمته حتى يقلب ماضيهم المظلم إلى مستقبل مشرق. فتأمل يا عزيزي القارئ: الله لا يعاملك فقط بالستر والمغفرة، بل بالكرم والفضل. إذا تبت بصدق، ماضيك لن يكون عارًا يطاردك، بل سيكون كنزًا من الحسنات. كل سقطة تتحول إلى خطوة رفعتك. كل لحظة ضعف تتحول إلى سبب قربك. كأن الآية تخاطبك مباشرة: لا تحمل الماضي كعقبة، بل اجعله سلّمًا. تب إلى الله، آمن بصدق، اعمل عملًا صالحًا، وسترى كيف أن خيباتك السابقة نفسها تُكتب لك حسنات يوم القيامة.",
      "english_content": "“Except for those who repent, believe, and do righteous deeds. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful.” [Al-Furqan: 70] Look, my dear reader. This is one of the most hope-filled verses in the Qur’an. Before it, Allah lists some of the gravest sins—shirk, unlawful killing, and adultery—and He warns of their severe punishment. But then suddenly, like a burst of light in the darkness, He opens a door of mercy: “Except for those who repent, believe, and do righteous deeds.” Even for those who fell into the greatest sins, if they return sincerely, renew their faith, and follow it with good works, the story changes completely. But here is the astonishing part: “For them Allah will replace their evil deeds with good.” Allah does not only erase the sins, He transforms them. Every moment of sin that you regret and repent from becomes, by His grace, a source of reward. The black marks of the past are rewritten as light. Your tears of remorse, your sincere return, turn those failures into blessings. Ibn ʿAbbās said: “These are the believers—Allah made their sins before Islam into good deeds after they repented.” Mujāhid explained: “Allah replaces their deeds of evil with deeds of righteousness.” And Qatādah said: “He replaced their worship of idols with worship of the Merciful, their adultery with chastity, and their killing with faith and striving.” Al-Saʿdī beautifully summed it: “This is one of the greatest favors of Allah: that the sins themselves, when repented from, become the very cause of good deeds.” The verse ends with reassurance: “And ever is Allah Forgiving and Merciful.” He is not just willing to pardon once, but He is always Al-Ghafūr, endlessly forgiving, and Ar-Rahīm, pouring mercy so abundantly that He transforms a dark past into a radiant future. So reflect, my dear reader: Allah is not only ready to wipe your slate clean—He is ready to turn your mistakes into treasures. Your past does not have to chain you; it can become your ladder. If you repent sincerely, believe wholeheartedly, and act righteously, your very failures become the reason for your elevation."
    },
    {
      "id": 8,
      "title": "القصص ١٦",
      "verse_text": "﴿قَالَ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي فَٱغۡفِرۡ لِي فَغَفَرَ لَهُۥٓۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ﴾ [القصص: ١٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تروي لحظة ندم عميقة من نبي كريم، موسى عليه السلام، حين قتل الرجل القبطي خطأً وهو يدافع عن رجل من بني إسرائيل. لم يكن قصده القتل، لكنه وقع فيه، فأحسّ فورًا بثقل الذنب وقال: ﴿رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي﴾. اعتراف صريح بلا تبرير، لم يقل: \"كان دفاعًا\" أو \"لم أقصد\"، بل قال مباشرة: ظلمت نفسي. هذا أول طريق التوبة: الصدق مع النفس. ثم لجأ إلى الله بالدعاء: ﴿فَٱغۡفِرۡ لِي﴾. دعاء قصير، لكنه يحمل كل مشاعر الانكسار، الندم، والرغبة في ستر الله. وهنا تأتي الاستجابة الفورية: ﴿فَغَفَرَ لَهُۥٓۚ﴾. الله لم يتأخر، لم يتركه في قلق أو انتظار، بل غفر له مباشرة. وهذه بشارة لكل مذنب: إذا كان الله غفر لموسى ذنبه في لحظة صدق، فهو يغفر لك أنت أيضًا إذا لجأت إليه بنفس الانكسار. ثم ختمت الآية بالوصف: ﴿إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ﴾. كأنها تقول: السبب في سرعة المغفرة ليس أنك تستحق، بل لأن الله هو الغفور الرحيم. هذه صفته الأزلية التي تتجلى لعباده كلما رجعوا إليه. ابن كثير قال: “أي اعترف بخطيئته وسأل الله مغفرتها، فغفر له الله ذنبه، إنه هو الغفور الرحيم.” والطبري قال: “أقر على نفسه بالذنب ولم يعذرها، وسأل الله أن يستره ويصفح عنه.” والقرطبي أضاف: “هذه الآية أصل في الاعتراف بالذنب، وأنه من شرط التوبة.” فتأمل يا عزيزي القارئ: التوبة ليست كلمات طويلة ولا طقوس معقدة، بل هي لحظة صدق مع الله، اعتراف بخطئك، ولجوء إليه. موسى عليه السلام قال جملة واحدة، لكن بصدقها غُفر له. وهذا هو الدرس: إذا شعرت بالندم، لا تُثقل على نفسك، فقط ارفع قلبك وقل: \"ربي، إني ظلمت نفسي فاغفر لي\". وستجد باب الرحمة مفتوحًا، لأن ربك هو الغفور الرحيم.",
      "english_content": "“He said, ‘My Lord, indeed I have wronged myself, so forgive me,’ and He forgave him. Indeed, He is the Forgiving, the Merciful.” [Al-Qasas: 16] Look, my dear reader. This verse captures a raw and profound moment of regret in the life of a noble prophet—Moses (peace be upon him). After he struck the Copt and unintentionally caused his death, Moses felt the heavy weight of what had happened. His reaction was immediate: “My Lord, indeed I have wronged myself.” No excuses, no justifications, no attempt to shift the blame. He didn’t say, “It was an accident,” or “I was only defending.” Instead, he confessed openly: I wronged myself. That is the first step of true repentance—honesty with one’s own soul. Then he turned to Allah with a simple plea: “So forgive me.” Just two words in Arabic (فاغفر لي), but they carried all the depth of sorrow, humility, and longing for Allah’s mercy. And the beauty is in Allah’s immediate response: “and He forgave him.” There was no delay, no waiting, no hesitation. Allah covered his mistake and relieved his heart right away. The verse closes with reassurance for every soul: “Indeed, He is the Forgiving, the Merciful.” This means that the reason for forgiveness is not the greatness of our words, but the greatness of Allah’s nature. He is Al-Ghafūr—the One who covers sins again and again without limit. He is Ar-Rahīm—the One who shows mercy even when we are least deserving, transforming regret into relief and closeness. Ibn Kathir explained: “He confessed his sin and asked Allah to forgive him, and Allah forgave him, for He is the Forgiving, the Merciful.” Al-Tabari noted: “He acknowledged his fault without making excuses, and sought pardon, so Allah concealed it for him.” And Al-Qurtubi added: “This verse is a foundation for acknowledging one’s sins, for confession is among the conditions of true repentance.” So reflect, my dear reader: repentance does not need to be a long ritual or complicated words. It is about a moment of truth. Admit your fault sincerely, call upon Allah from the heart, and His forgiveness will meet you right there. Like Moses, all you need is a heartfelt, “My Lord, I wronged myself, so forgive me.” And you will find that the door of mercy has never been closed, for your Lord is truly the Forgiving, the Merciful."
    },
    {
      "id": 9,
      "title": "التحريم ٨",
      "verse_text": "﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ تُوبُوٓاْ إِلَى ٱللَّهِ تَوۡبَةٗ نَّصُوحًا عَسَىٰ رَبُّكُمۡ أَن يُكَفِّرَ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيُدۡخِلَكُمۡ جَنَّـٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ يَوۡمَ لَا يُخۡزِي ٱللَّهُ ٱلنَّبِيَّ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥۖ نُورُهُمۡ يَسۡعَىٰ بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَـٰنِهِمۡ يَقُولُونَ رَبَّنَآ أَتۡمِمۡ لَنَا نُورَنَا وَٱغۡفِرۡ لَنَآۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ﴾ [التحريم: ٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية نداء صريح لكل مؤمن ومؤمنة، نداء يحمل الرحمة والرجاء في أعظم صورة: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ تُوبُوٓاْ إِلَى ٱللَّهِ تَوۡبَةٗ نَّصُوحًا﴾. الله لا يطلب أي توبة، بل توبة نصوحًا، أي خالصة صادقة، لا رجوع بعدها، فيها ندم على الماضي، وعزم على عدم العودة، وإصلاح لما يمكن إصلاحه. ثم يضع لك الأمل: ﴿عَسَىٰ رَبُّكُمۡ أَن يُكَفِّرَ عَنكُمۡ سَيِّـَٔاتِكُمۡ﴾. \"عسى\" من الله يقين، أي أن رجاءكم مؤكد. النتيجة أن الله يمحو عنكم ذنوبكم، يطهركم من أوزاركم. وليس هذا فقط، بل ﴿وَيُدۡخِلَكُمۡ جَنَّـٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ﴾. التوبة ليست مجرد نجاة من العقوبة، بل طريق إلى أعظم فوز: جنات الخلود. ثم يصف لك المشهد يوم القيامة: ﴿يَوۡمَ لَا يُخۡزِي ٱللَّهُ ٱلنَّبِيَّ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥۖ﴾. كأن الله يطمئن قلبك أنك لن تكون في موقف خزي ولا عار، بل ستكون في موكب النور مع النبي ﷺ وأهل الإيمان. وهذا النور قال عنه: ﴿نُورُهُمۡ يَسۡعَىٰ بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَـٰنِهِمۡ﴾، أي أن أعمالهم الصالحة في الدنيا تتحول إلى نور يهديهم في ظلمة يوم القيامة، نور يسبقهم ويحيط بهم. وفي لحظة من أروع لحظات العبد، يرفع المؤمنون دعاءهم: ﴿رَبَّنَآ أَتۡمِمۡ لَنَا نُورَنَا وَٱغۡفِرۡ لَنَآۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ﴾. كأنهم يخشون أن ينطفئ نورهم أو أن ينقص، فيطلبون من الله أن يتمه ويثبته. ابن كثير قال: “توبة نصوحًا: أن يقلع عن الذنب في الحاضر، ويندم على ما مضى، ويعزم على ألا يعود إليه في المستقبل.” وقال القرطبي: “هي التوبة التي لا عودة بعدها، كما لا يعود اللبن في الضرع.” والسعدي قال: “هذا أمر من الله لعباده المؤمنين بالإنابة إليه بالتوبة النصوح الجامعة لجميع ما يلزم فيها.” فتأمل يا عزيزي القارئ: الآية تقول لك بوضوح، لا تيأس من ذنبك، لا تغرق في ندمك بلا أمل، فقط تب إلى الله توبة صادقة، وسيكفّر عنك خطاياك، ويبدلها نورًا يسعى بين يديك يوم القيامة. وستكون مع النبي ﷺ وأهل الإيمان، رافعًا دعاءك: \"ربنا أتمم لنا نورنا واغفر لنا\". هذه ليست أمنية بعيدة، بل وعد من الله لكل من صدق في توبته.",
      "english_content": "“O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow, on the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, ‘Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.’” [At-Tahrim: 8] Look, my dear reader. This verse is a direct call to every believer weighed down by mistakes: repent to Allah with sincere repentance. Not just a momentary apology, but a repentance that is deep, true, and enduring—a turning back that involves regret over the past, abandoning the sin in the present, and a firm resolve never to return. And then comes the promise: “Perhaps your Lord will remove from you your misdeeds.” From Allah, perhaps means certainty. He will wipe away sins, erase their stains, and free you from their weight. But He doesn’t stop there: “and admit you into gardens beneath which rivers flow.” Repentance is not only an escape from punishment, it is a path to eternal joy and honor. The verse paints the scene of the Day of Judgment: “on the Day when Allah will not disgrace the Prophet and those who believed with him.” Imagine being among that company, not disgraced, not humiliated, but standing in dignity with the Messenger of Allah ﷺ. Then comes one of the most beautiful descriptions: “Their light will proceed before them and on their right.” This is the light of faith and deeds, illuminating their path across the darkness of the Day of Judgment. Every prayer, every charity, every tear shed in repentance becomes light that surrounds them. And in that moment, they call out in a prayer filled with humility and hope: “Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.” Even with light already shining, they fear its loss and beg Allah to complete it for them—because they know salvation is only secure by His mercy. Ibn Kathir said: “A sincere repentance is to abandon the sin in the present, regret what has passed, and resolve never to return.” Al-Qurtubi explained: “It is a repentance with no return to sin, just as milk does not return to the udder.” Al-Saʿdi added: “It is repentance that gathers all its conditions, which leads to the erasure of sins and the increase of light on the Day of Resurrection.” So reflect, my dear reader: this verse is not just a command, it is a promise and a vision. If you repent sincerely, your sins are not only forgiven, they are erased, your heart is filled with light, and you are welcomed into eternal gardens. And on that great Day, you will walk with the Prophet and the believers, your path glowing, your prayer accepted: “Our Lord, perfect for us our light and forgive us.”"
    },
    {
      "id": 10,
      "title": "البقرة ٢٨١",
      "verse_text": "﴿وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ﴾ [البقرة: ٢٨١]",
      "content": "انظر يا عزيزي القارئ، هذه الآية قيل إنها آخر ما نزل من القرآن، فكانت بمثابة الخاتمة والوصية الأخيرة من رب العالمين لعباده. آية واحدة تحمل رهبة عظيمة ونداءً عميقًا للقلوب: ﴿وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِ﴾. تخيّل هذا اليوم الذي لا مهرب فيه ولا ستر، يوم تُعرض فيه على خالقك بلا واسطة ولا حاجب، وترجع إلى من يعرف خفايا نفسك وما أخفته صدورك. ثم يأتي الوعد بالعدل الكامل: ﴿ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ﴾. كل ما عملت في حياتك، صغيرًا أو كبيرًا، حسنًا أو سيئًا، ستراه حاضرًا. لا يغيب عنك عمل، ولا يضيع منك جهد. ستُعطى جزاءك وافياً غير منقوص. لكن لتطمئن القلوب، ختمت الآية بالعدل المطلق: ﴿وَهُمۡ لَا يُظۡلَمُونَ﴾. لا ظلم في الحساب، لا عقوبة بلا ذنب، ولا حسنة تُهمل. كل شيء بميزان دقيق عادل. ابن كثير قال: “هذه آخر آية نزلت من القرآن، وهي آية عظيمة جامعة، أمر الله فيها بالتقوى وحذّر من يوم الرجوع إليه، وأخبر بالعدل في الجزاء.” والطبري قال: “أي اتقوا الله أن تلقوه وقد خالفتم أمره، فإنه يوم توفى فيه النفوس أعمالها، إن خيرًا فخير وإن شرًا فشر.” والقرطبي قال: “أجمع العلماء أنها آخر آية نزلت، وهي جامعة في الوصية بالتقوى والرجوع إلى الله.” فتأمل يا عزيزي القارئ: هذه الآية تخاطب شعور الندم مباشرة. كأنها تقول لك: قبل أن يأتي اليوم الذي تُرجع فيه إلى الله وترى كل شيء، بادر الآن بالتوبة. لا تجعل ذنوبك تنتظرك هناك، عُد إلى الله قبل أن تُعاد إليه. فالندم الحقيقي هو الذي يقودك إلى العمل اليوم، قبل أن يصبح الندم غدًا بلا فائدة.",
      "english_content": "“And fear a Day when you will be returned to Allah. Then every soul will be compensated for what it earned, and they will not be wronged.” [Al-Baqarah: 281] Look, my dear reader. Many scholars said this was the very last verse revealed in the Qur’an, making it a final farewell message from the Lord of the worlds to His servants. One short verse, but it carries the full weight of eternity: “And fear a Day when you will be returned to Allah.” Imagine that Day—there will be no escape, no veil, no distraction. You will stand before your Creator, the One who knows every whisper of your soul and every hidden moment of your life. Then comes the assurance of perfect justice: “Then every soul will be compensated for what it earned.” Nothing will be overlooked—every good deed, no matter how small, will be rewarded, and every wrongdoing will be accounted for unless forgiven. You will see the record of your life laid bare, and you will be given your due without any omission. And to remove fear of unfairness, Allah seals the verse with comfort: “and they will not be wronged.” No one will be punished without cause, no good deed will be wasted, no effort will vanish. The balance on that Day is precise, flawless, and just. Ibn Kathir said: “This is the last verse revealed from the Qur’an. It is comprehensive, commanding piety, warning of the Day of Return to Allah, and informing that every soul will be given its full due.” Al-Tabari explained: “Fear meeting Allah while disobeying Him, for it is the Day when every soul will be paid in full for its deeds, good for good, and bad for bad.” And Al-Qurtubi added: “The scholars are unanimous that this was the last verse revealed, a concise and final counsel of taqwa and returning to Allah.” So reflect, my dear reader: this verse speaks directly to the heart of regret. It is as if Allah is saying to you: don’t wait until the Day when every deed is exposed to feel sorry. Let your regret move you now, while you still have time to repent, to turn back, to change. On that Day, regret without action will be too late. But today, your regret can be the doorway to forgiveness and mercy."
    },
    {
      "id": 11,
      "title": "آل عمران ١٣٣",
      "verse_text": "﴿وَسَارِعُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا ٱلسَّمَـٰوَٰتُ وَٱلۡأَرۡضُ أُعِدَّتۡ لِلۡمُتَّقِينَ﴾ [آل عمران: ١٣٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية كأنها نداء عاجل لكل من يشعر بالندم ويريد تصحيح مساره. الله سبحانه يقول: ﴿وَسَارِعُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ﴾، كلمة \"سارعوا\" تعطي إحساسًا بالعجلة، كأن الغفران كنز أمامك، والوقت قصير، والندم وحده لا يكفي، بل يحتاج أن يتحول إلى سرعة في التوبة والعمل. ثم يفتح لك الأفق: ﴿وَجَنَّةٍ عَرۡضُهَا ٱلسَّمَـٰوَٰتُ وَٱلۡأَرۡضُ﴾. الجنة ليست مكانًا ضيقًا محدودًا، بل عرضها كالسماوات والأرض، لتشعر أن مكانك محفوظ مهما كثرت ذنوبك، وأنك لست وحدك في سباق المغفرة. ثم يحدد لمن أُعِدت: ﴿أُعِدَّتۡ لِلۡمُتَّقِينَ﴾. التقوى ليست العصمة من الذنب، بل الخوف من الله بعد الذنب، والإسراع إلى التوبة. ابن عباس قال: “سارعوا إلى مغفرة من ربكم: يعني بادروا بالأعمال الصالحة.” وقال الطبري: “سابقوا بالطاعة ربكم إلى الجنة.” والقرطبي قال: “فيها إشارة إلى أن الندم لا يكفي، بل لا بد معه من عمل صالح.” فتأمل يا عزيزي القارئ: الآية تخاطبك في لحظة ندمك لتقول لك: لا تكتفِ بالحسرة، بل حوّلها إلى حركة، إلى سباق نحو المغفرة. الله لم يقل \"امشوا\" بل قال \"سارعوا\". كأن الذنوب نار تشتعل، والسبيل إلى النجاة هو أن تهرع إلى الله، لتجد عنده مغفرة واسعة وجنة عرضها السماوات والأرض.",
      "english_content": "“And hasten to forgiveness from your Lord and a Garden as wide as the heavens and earth, prepared for the righteous.” [Aal-Imran: 133] Look, my dear reader. This verse is like an urgent call to every soul weighed down by regret. Allah says: “And hasten to forgiveness from your Lord.” The word hasten carries urgency, as if forgiveness is a treasure right before you, but time is short. Regret by itself is not enough—it must be turned into action, into a quick return, into eager repentance and deeds that erase the past. Then Allah opens the horizon of hope: “and a Garden as wide as the heavens and earth.” Paradise is not a narrow place with limited space—it is as vast as the entire expanse of the skies and the earth. This is to tell you that your place is already prepared, no matter how many sins you carry, as long as you turn back. You are not competing for a tiny corner; there is room for all who answer His call. Finally, He says: “prepared for the righteous.” But righteousness here does not mean perfection or sinlessness. It means those who fear Allah after they sin, those who rush back in repentance, those who let their regret lead them to sincerity and change. Ibn ʿAbbās said: “Hasten to forgiveness from your Lord: meaning hasten with good deeds.” Al-Tabari explained: “Race with obedience to your Lord towards Paradise.” And Al-Qurtubi noted: “This shows that regret alone is not enough—there must be repentance accompanied by righteous action.” So reflect, my dear reader. This verse is speaking directly to you in your regret. It is saying: don’t linger in sorrow. Don’t walk slowly back—run. Allah did not say “go” or “move,” He said “hasten.” Treat your sins like a fire and your repentance like the only escape. If you turn to Him now, quickly and sincerely, you will find not just forgiveness, but a Paradise so vast it embraces all who come."
    },
    {
      "id": 12,
      "title": "آل عمران ١٢٩",
      "verse_text": "﴿وَلِلَّهِ مَا فِي ٱلسَّمَـٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ﴾",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتي لتذكرك في لحظة الندم أن الأمر كله بيد الله. ﴿وَلِلَّهِ مَا فِي ٱلسَّمَـٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ﴾، أي أن الكون كله ملك له، وأنت ضمن هذا الملك، لا تخرج عن سلطانه ولا عن رحمته. فلا تعتقد أن ذنبك جعلك خارج دائرة عنايته. ثم يقول: ﴿يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ﴾. هذه الكلمات قد تبدو لأول وهلة مرعبة: المغفرة والعذاب كلاهما بيده، لكن إذا تأملت تجد فيها بابًا للرجاء. لأن الله هو الذي يشاء، ومشيئته مرتبطة بحكمته ورحمته، لا بالهوى ولا بالظلم. فإذا أقبلت عليه بتوبة صادقة، كانت مشيئته لك مغفرة لا عذابًا. ثم ختم الآية بطمأنة عظيمة: ﴿وَٱللَّهُ غَفُورٞ رَّحِيمٞ﴾. فهو لا يغفر على مضض، بل يغفر عن سعة وكرم. وهو لا يرحم قليلًا، بل رحمته وسعت كل شيء. وكأن الآية تريد أن تقول لك: لا تعتمد على نفسك ولا على أعمالك وحدها، بل ضع قلبك بين يدي الله، فهو الغفور الرحيم. ابن كثير قال: “هو المالك لجميع الأشياء، والمتصرف فيها، وهو الذي يغفر لمن يشاء ويعذب من يشاء بحكمته وعدله، وهو مع ذلك غفور رحيم.” وقال الطبري: “إنما يغفر لمن يشاء أن يغفر له إذا تاب وآمن، ويعذب من يشاء إذا أصرّ وكفر.” فتأمل يا عزيزي القارئ: هذه الآية تضعك في ميزان الحقيقة. ذنبك مهما كان كبيرًا، فالله أكبر. رجوعك إليه هو الفيصل، فإن عدت، جعل مشيئته لك مغفرة ورحمة. فلا تجعل الندم يقودك إلى يأس، بل اجعله يقودك إلى باب الله، فهو الغفور الرحيم.",
      "english_content": "“To Allah belongs whatever is in the heavens and whatever is in the earth. He forgives whom He wills and punishes whom He wills. And Allah is Forgiving and Merciful.” [Aal-Imran: 129] Look, my dear reader. This verse reminds you, in the midst of regret, of the reality that everything belongs to Allah. “To Allah belongs whatever is in the heavens and whatever is in the earth.” Every creature, every moment, every secret—everything is His. And you, with all your sins and sorrow, are still within His ownership, still under His mercy. Your mistake has not pushed you outside His kingdom. Then He declares: “He forgives whom He wills and punishes whom He wills.” At first, these words might sound frightening—both forgiveness and punishment are entirely in His hands. But when you reflect, you realize that His will is not random, nor is it unjust. It is bound by His perfect wisdom and vast mercy. And He Himself has promised that those who repent sincerely will be forgiven. So if you turn back, His will for you is forgiveness, not punishment. Finally, Allah seals the verse with reassurance: “And Allah is Forgiving and Merciful.” He does not forgive reluctantly, but out of generosity. He does not show mercy sparingly, but expansively—His mercy covers every sincere heart that returns. It is as if the verse tells you: don’t rely only on yourself or your deeds, but entrust your heart to Allah. He is the One who erases sins and embraces His servants in compassion. Ibn Kathir explained: “He is the Owner of all things, the One who manages them. He forgives whom He wills and punishes whom He wills by His wisdom and justice, and yet He is Forgiving and Merciful.” Al-Tabari said: “He forgives those whom He wills if they repent and believe, and punishes those whom He wills if they persist and disbelieve.” So reflect, my dear reader. This verse places your regret in perspective: no matter how big your sin feels, Allah is greater. If you return to Him, His will for you is mercy, not wrath. Let your regret drive you not into despair, but toward His door—for He is truly the Forgiving, the Merciful."
    },
    {
      "id": 13,
      "title": "غافر ٧",
      "verse_text": "﴿ٱلَّذِينَ يَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيُؤۡمِنُونَ بِهِۦ وَيَسۡتَغۡفِرُونَ لِلَّذِينَ ءَامَنُواْ رَبَّنَا وَسِعۡتَ كُلَّ شَيۡءٖ رَّحۡمَةٗ وَعِلۡمٗا فَٱغۡفِرۡ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِيمِ﴾ [غافر: ٧]",
      "content": "هذه الآية من أعظم آيات الرجاء والطمأنينة، وكأنها تُلقي في قلب التائب بردًا وسلامًا. تخيّل أن الملائكة المقرّبين، حملة العرش، الذين هم أقرب الخلق إلى الله وأعظمهم مكانة، لا ينسونك أنت العبد الضعيف المذنب. بينما أنت غارق في ذنوبك تحاول العودة، هم يرفعون دعاءً صادقًا: اغفر له، ارحمه، وقه عذاب الجحيم. الآية تُظهر رحمة الله الواسعة التي شملت كل شيء، قبل أن تذكر الاستغفار للعباد. وكأن الرحمة تحيطك قبل أن تطرق بابها. وما شرط القبول؟ أن تتوب وتتبع سبيل الله، لا كمال ولا عصمة، بل توبة صادقة واتباع الطريق المستقيم. في هذا المشهد، لا تكون وحيدًا في ندمك. الكون كله يشاركك رجاءك: الملائكة، حملة العرش، يسبّحون ويذكرون الله، وفي ذات الوقت يستغفرون لك. هذه ليست كلمات، بل شهادة على أن خط رجعتك مفتوح دائمًا، وأنك مهما أثقلت كاهلك الذنوب، هناك دعاء من أطهر الخلق يرفع اسمك إلى السماء. إنها رسالة وجدانية بليغة: إن الله لا يطرد تائبًا، بل يجعل أكرم خلقه يشفعون له بالدعاء. فما أعظم الكرم، وما أوسع الأمل.",
      "english_content": "\"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of the Hellfire.\" [Ghafir: 7] And here lies the beauty of this verse: it paints a picture of the most honored angels—those who carry the Throne of the Almighty and those around it—constantly glorifying their Lord, believing in Him, and at the same time remembering you. They call upon Allah not only for themselves, but for every believer, especially those who repent and return. It is as if heaven itself intercedes for the broken heart, for the soul heavy with regret, whispering: “Do not give up. The angels closest to your Lord are asking Him to forgive you and shield you from the Fire.” This verse is like a blanket of mercy. Allah’s mercy has already encompassed all things, and His knowledge has already counted every sin, every tear, and every sigh. Yet, within that knowledge and mercy lies forgiveness for those who simply turn back and walk His path again. It is not perfection that is asked of you, but repentance and return. And in that return, you are not alone—those who never sin, who are the purest of creation, the carriers of the Throne, are praying for your safety, your forgiveness, and your eternal peace."
    },
    {
      "id": 14,
      "title": "النحل ١١٩",
      "verse_text": "﴿ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا السُّوءَ بِجَهَالَةٍ ثُمَّ تَابُوا مِنْ بَعْدِ ذَٰلِكَ وَأَصْلَحُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ﴾ [النحل: ١١٩]",
      "content": "عزيزي القارئ، هذه الآية العظيمة تفتح أبواب الأمل أمام قلبٍ أنهكه الندم، وتهمس في أذنه بأن الله لا يغلق بابه مهما ثقلت الخطايا. تأمل كيف وصف الله الذنوب بأنها \"بجهالة\"، فحتى لو ارتكب الإنسان المعصية بعلم، فإنها في حقيقتها جهل، جهل بعظمة الله، جهل بعاقبة الذنب، جهل بما يفوته العبد من لذة الطاعة ونور القرب. ثم جعل الله التوبة والإصلاح طريق العودة، ليعلمك أن الندم وحده ليس كافيًا، بل لا بد أن يتبعه إصلاح في العمل والسلوك، وكأنك تُعلن أمام الله أنك لم تندم بالكلام فقط بل بالفعل أيضًا. قال الإمام الطبري رحمه الله: \"كل من عصى الله خطأً كان أو عمدًا فهو في جهالة حتى ينزع عنها بالتوبة\". وقال ابن كثير: \"المراد أن من وقع في خطيئة فإنه جاهل في فعله، سواء كان بعلم أو بغير علم، ثم إذا تاب وأناب أصلح الله له حاله وغفر ذنبه\"، فتأمل كيف أجمع العلماء على أن باب التوبة مفتوح مادام هناك رجوع صادق. عزيزي القارئ، هذه الآية تشبه يدًا حانية تُربّت على قلبك وتقول: لا تيأس، لو أنك أثقلت كاهلك بالذنوب، فإن الله غفور رحيم، يغسل القلب من أدرانه، ويحييه من جديد. وكل لحظة ندم صادقة هي في حقيقتها دعوة من الله لك بأن تعود، فلا تجعلها تذهب سدى.",
      "english_content": "\"Then, indeed your Lord - to those who have done evil in ignorance and then repented after that and corrected themselves - indeed, your Lord, thereafter, is Forgiving and Merciful.\" [An-Nahl: 119] Dear reader, this verse is a door of hope for every heart burdened by regret. Allah Almighty makes it clear that His mercy remains open, no matter how great the weight of sin. He describes the act of wrongdoing as “ignorance.” Even if someone sins knowingly, in its essence it is ignorance—ignorance of Allah’s greatness, ignorance of the consequences of sin, and ignorance of the sweetness of obedience that is lost in its place. Yet Allah did not abandon the sinner without a path; He laid out the way back through repentance and correction, so that regret becomes not only words but a change in life and action, a living sign of sincerity. Imam al-Tabari said: “Everyone who disobeys Allah, whether out of mistake or deliberate choice, is in ignorance until he turns back in repentance.” Ibn Kathir explained: “What is meant is that whoever falls into sin is ignorant in his act, whether he knew or not, but if he repents and turns back, Allah will correct his state and forgive his sin.” All the scholars pointed toward this truth: the gate of forgiveness is never closed so long as repentance is sincere. Dear reader, this verse is like a soft hand placed on your heart, whispering: Do not despair. Even if your soul has been burdened with sins, Allah is Forgiving and Merciful, ready to cleanse your heart and revive it. Every genuine tear of regret is itself a sign that Allah is calling you back to Him. Do not waste that call; answer it, and you will find Him waiting with mercy and forgiveness."
    },
    {
      "id": 15,
      "title": "الأنفال ٢٩",
      "verse_text": "﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تَتَّقُوا۟ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ﴾ [الأنفال: ٢٩]",
      "content": "انظر يا عزيزي القارئ، هذه الآية العظيمة من سورة الأنفال تأتي لتضع بين يديك سرّ الخروج من دوامة الندم والذنب، لتفتح لك باب التوبة واليقين. الله جل جلاله يخاطب المؤمنين مباشرة: ﴿إِن تَتَّقُوا۟ ٱللَّهَ﴾، أي إذا اتقيتم ربكم وصدقتم في التوبة ورجعتم إليه بقلوب منكسرة، فإن الجزاء عظيم يفوق الخيال. الوعد الأول: ﴿يَجۡعَل لَّكُمۡ فُرۡقَانٗا﴾. قال ابن عباس: فرقانًا أي مخرجًا من الشبهات والشدائد. وقال مجاهد: هو النور الذي يميز به المؤمن بين الحق والباطل. تأمل هذا يا قارئي العزيز: التوبة ليست فقط غفران ذنب ماضٍ، بل هي هدية من الله تُعطيك بصيرة في المستقبل، تزرع في قلبك نورًا يريك الطريق الصحيح فلا تعود للتخبط الذي كنت فيه. الوعد الثاني: ﴿وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ﴾. هنا يطمئنك الله أن آثار الذنوب الماضية تمحى، وتزال أوزارها، وكأنها لم تكن. ليست مجرد مغفرة، بل تكفير يمحو الأثر الثقيل الذي كان يجرح روحك ويثقل قلبك. الوعد الثالث: ﴿وَيَغۡفِرۡ لَكُمۡ﴾. الغفران ستر من الله ورحمة عظيمة، يغطي به ذنبك فلا يفضحك في الدنيا ولا في الآخرة. ابن كثير قال: أي يستر ذنوبكم ويصفح عن خطاياكم. ثم تأتي الخاتمة المهيبة: ﴿وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ﴾. أي كل هذه العطايا ليست لأنك تستحقها بعملك القليل، بل هي من فضل الله العظيم الذي يغمر عباده إذا صدقوا في رجوعهم. تأمل يا عزيزي القارئ: التوبة والندم الحقيقي على الذنب ليس نهاية الطريق، بل بدايته. إذا رجعت إلى الله بتقوى صادقة، أعطاك الله ثلاثة مفاتيح: فرقانًا يهديك في حياتك، تكفيرًا لسيئاتك، ومغفرةً لذنوبك، ثم فوق ذلك كله فضله العظيم الذي لا يحد. هذه الآية تجعل من الندم نقطة انطلاق لحياة جديدة، مليئة بالنور والطمأنينة والقرب من الله.",
      "english_content": "\"O you who have believed, if you fear Allah, He will grant you a criterion and will remove from you your misdeeds and forgive you. And Allah is the possessor of great bounty.\" [Al-Anfal: 29] Look, my dear reader, this majestic verse from Surah Al-Anfal lays before you the secret of escaping the weight of regret and sin, opening the door of repentance and certainty. Allah, exalted and glorious, addresses the believers directly: “If you fear Allah…”—meaning if you return to Him with sincere hearts, humbled in repentance, He will reward you with gifts far beyond your imagination. The first promise: “He will grant you a criterion.” Ibn Abbas explained that this criterion is a way out of doubts and hardships, while Mujahid said it is a light by which the believer distinguishes between truth and falsehood. Reflect on this, my dear reader: repentance is not just about erasing past sins, it is a divine gift that plants clarity in your heart, giving you vision for the future so you never stumble as before. The second promise: “and will remove from you your misdeeds.” Here Allah assures you that the weight of your past sins is erased, their traces wiped away, as if they never existed. It is not only forgiveness but purification, lifting the burden that once scarred your soul and troubled your heart. The third promise: “and forgive you.” Forgiveness is Allah’s covering and mercy, shielding you so that your sins are not exposed in this world nor in the Hereafter. Ibn Kathir commented: “That is, He will conceal your sins and pardon your faults.” And then comes the majestic conclusion: “And Allah is the possessor of great bounty.” This means that all these blessings are not because you deserve them through your limited deeds, but purely from Allah’s boundless grace and immense generosity, which He bestows upon His servants when they turn back to Him sincerely. Think deeply, my dear reader: true repentance and heartfelt regret over sin are not the end of the journey, but the beginning of it. If you return to Allah with genuine piety, He grants you three treasures—guiding light, the cleansing of sins, and complete forgiveness—then He wraps all of that in His infinite bounty. This verse transforms regret into hope, and despair into a new beginning filled with light, tranquility, and nearness to Allah."
    }
  ]
}