{
  "feeling": "خائف",
  "verses": [
    {
      "id": 1,
      "title": "البقرة ١١٢ / Al-Baqarah 112",
      "verse_text": "يقول الله تعالى: ﴿بَلَىٰ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦۖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾ [البقرة: ١١٢]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تُخاطب القلب الذي يملؤه الخوف من المستقبل أو من الحساب، وتطمئنه أن الطريق إلى الأمن والطمأنينة واضح: أن تُسلم وجهك لله، أي أن تُخضع نفسك كلها له، ظاهرًا وباطنًا، نيةً وعملاً. كلمة \"أسلم وجهه\" فيها معنى الاستسلام الكامل، كأنك تقول: وجهي يا رب، أي ذاتي وهويتي وحياتي كلها لك. ثم لا يكفي مجرد الاستسلام، بل لا بد أن يكون مع إحسان: أن تعبد الله كأنك تراه، أن تُتقن عملك، أن تُخلص قلبك، أن تُحسن في حق ربك وفي حق الناس. عندها فقط يُبشرك الله: ﴿فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦ﴾. تخيّل أن أجرك ليس عند بشر، ولا عند مؤسسة، بل عند الله نفسه، رب العالمين، الضامن الذي لا يُضيّع أجر المحسنين. ثم تأتي البشارة العظمى: ﴿وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾. كأنها الآية تُمسك بيدك وتقول: إذا أسلمت وجهك لله وأحسنت، فلن تخاف مما سيأتي، ولن تحزن على ما مضى. لا خوف من المستقبل ولا حزن على الماضي، بل حياة مطمئنة في الدنيا، وأمان كامل في الآخرة. ابن كثير قال: \"أي من أخلص عمله لله، وأحسن في عمله، فله ثوابه عند ربه، ولا خوف عليهم مما يستقبلونه، ولا هم يحزنون على ما خلفوه.\" والطبري قال: \"أسلم وجهه لله: أخلص له العبادة، وهو محسن فيها.\" والسعدي قال: \"فهذا الذي ضمن الله له الأجر، وأمنه من المخاوف والأحزان.\" فكأن الله يقول لك يا عزيزي القارئ: إذا أردت أن يزول عنك الخوف والحزن، فاجعل وجهك لله، وأحسن فيما تفعل. لا تبحث عن الطمأنينة عند غيره، فإنها لا تُعطى إلا عند باب الله.",
      "english_content": "“Yes, whoever submits his face in Islam to Allah while being a doer of good will have his reward with his Lord. And no fear will there be concerning them, nor will they grieve.” [Al-Baqarah: 112] Listen, dear reader, this verse speaks directly to the heart that is filled with fear about the future or about the Day of Judgment. It reassures you that the path to peace and safety is clear: to submit your face to Allah—that is, to surrender your whole self to Him, outwardly and inwardly, in intention and in action. The phrase “submits his face” carries the meaning of total surrender, as if you are saying: My face, O Lord—my very identity, my whole being, my life—is Yours. But surrender alone is not enough. It must come with ihsan—with excellence and sincerity. To worship Allah as if you see Him, to perfect your actions, to purify your heart, to do good toward both your Creator and His creation. Then—and only then—Allah gives you this promise: “He will have his reward with his Lord.” Imagine that your reward is not from people, nor from any worldly source, but from Allah Himself—the Lord of the Worlds—the One who never fails to give the best to those who do good. And then comes the greatest reassurance: “No fear will there be concerning them, nor will they grieve.” It’s as if the verse takes you by the hand and says: If you surrender to Allah and do good, then you will no longer fear what lies ahead, nor grieve over what has passed. No fear of the future, no sorrow for the past. Instead, you will live a tranquil life in this world and complete safety in the Hereafter. Ibn Kathir said: “Whoever makes his deeds sincerely for Allah and perfects them, his reward is with his Lord. No fear will they have of what is to come, nor will they grieve over what has passed.” Al-Tabari said: “Submitting the face means dedicating worship purely to Allah while perfecting it.” Al-Sa‘di said: “This is the one to whom Allah guaranteed reward and safety from fears and sorrows.” So it is as if Allah Himself is telling you: If you want fear and sorrow to leave your heart, then turn your whole face to Me and do good. Don’t seek peace anywhere else—for it is only given at My door."
    },
    {
      "id": 2,
      "title": "السجدة ٥ / As-Sajda 5",
      "verse_text": "الله تعالى يقول: ﴿يُدَبِّرُ ٱلۡأَمۡرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلۡأَرۡضِ ثُمَّ يَعۡرُجُ إِلَيۡهِ فِي يَوۡمٖ كَانَ مِقۡدَارُهُۥٓ أَلۡفَ سَنَةٖ مِّمَّا تَعُدُّونَ﴾ [السجدة: ٥]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تضع أمامك مشهدًا يملأ القلب بالرهبة والخوف من عظمة الله، لكنها أيضًا تملؤه بالطمأنينة حين تتأمل أن كل الأمور بيد الله وحده. يقول الله إنه هو وحده الذي يدبر الأمر كله، من السماء إلى الأرض، لا يخرج شيء عن إرادته ولا يفلت من علمه. ما تراه من أحداث كبرى أو صغرى في حياتك، من ولادة وموت، من فرح وحزن، من رزق وضيق، كله تحت تدبير الله. ثم يضيف: ﴿ثُمَّ يَعۡرُجُ إِلَيۡهِ﴾ أي أن كل ما قدّره الله وصنعه في هذا الكون يعود إليه، كأن دورة الوجود كلها تبدأ من عنده وتنتهي عنده، هو الأول والآخر. وهنا يذكّرك الله باليوم الآخر: ﴿فِي يَوۡمٖ كَانَ مِقۡدَارُهُۥٓ أَلۡفَ سَنَةٖ مِّمَّا تَعُدُّونَ﴾. هذا تصوير لعظمة الحساب عند الله، يوم واحد عنده كألف سنة من حساب البشر. فأنت ترى حياتك طويلة، وأيامك متتابعة، لكن عند الله الأمر مختلف، الزمن كله مطويّ تحت قدرته، واليوم عنده قد يساوي قرونًا مما تعيشه البشرية. ابن كثير قال: \"يخبر تعالى عن عظمته وجلاله أن ملائكته تصعد إليه بالأمر الذي يدبره في خلقه في يوم كان مقداره ألف سنة مما تعدون.\" والطبري قال: \"أي أن ما يدبره الله من أمر السماء إلى الأرض، ثم يعود إليه في يوم طويل عظيم، يقدّره الناس بألف سنة.\" والسعدي قال: \"هذا فيه بيان عظمة الله وسعة سلطانه، وأن أمره نافذ في جميع العوالم.\" فتأمل يا عزيزي القارئ، كيف تحمل الآية معنى الخوف العميق: أن الله محيط بكل شيء، وأن تدبير الكون ليس في يد أحد سواه. لا أحد يملك مصيرك غيره، ولا أحد يقدر أن يغيّر ما قضاه لك. والخوف هنا ليس رعبًا بلا أمل، بل خوف يوقظ القلب ويجعلك تدرك: إن كان كل شيء في يده، فلا ملجأ إلا إليه، ولا أمان إلا في طاعته، ولا رجاء إلا برحمته.",
      "english_content": "“He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.” [As-Sajda: 5] Look, dear reader, this verse unfolds before you a scene that fills the heart with awe and fear of Allah’s greatness, yet also with peace when you realize that everything is in His hands. Allah tells us that He alone manages every affair, from the heavens down to the earth. Nothing slips away from His decree, nothing escapes His knowledge. Every event you witness in your life—birth and death, joy and sorrow, provision and hardship—all of it is part of His arrangement. Then He says: “then it will ascend to Him.” Meaning that everything He decrees, every command, every outcome in creation eventually returns to Him. The entire cycle of existence begins with Him and ends with Him—He is the First and the Last. And here Allah reminds you of the Day of Judgment: “in a Day, the extent of which is a thousand years of those which you count.” This is a glimpse of the majesty of that Day. One single Day with Allah is like a thousand years in our human reckoning. What feels like long lifetimes to us are, before Allah, like a passing moment. Ibn Kathir said: “It is informing of His greatness, that His angels ascend to Him with the commands He decrees over His creation, in a Day whose extent is a thousand years by your count.” Al-Tabari said: “It means the matters Allah decrees from heaven to earth return to Him in a Day vast and immense, estimated by mankind as a thousand years.” Al-Sa‘di said: “This points to Allah’s greatness and vast dominion, and that His command encompasses all realms.” So reflect, dear reader: this verse plants in the heart a kind of fear that awakens you. Allah surrounds all things, and the management of the entire universe belongs only to Him. No one holds your destiny but Him. No one can alter what He has decreed for you. And this fear is not despair—it is the fear that makes you run to Him, that makes you realize there is no safety except in obeying Him, no refuge except in His mercy, no peace except in surrendering to His will."
    },
    {
      "id": 3,
      "title": "الزمر ٣٦ / Az-Zumar 36",
      "verse_text": "يقول الله تعالى: ﴿أَلَيْسَ ٱللَّهُ بِكَافٍ عَبْدَهُ وَيُخَوِّفُونَكَ بِٱلَّذِينَ مِن دُونِهِۦۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٖ﴾ [الزمر: ٣٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تخاطب أعماق قلبك في لحظات الخوف من البشر أو من المجهول. الله هنا يوجه سؤالًا تقريريًا يحمل الجواب في ذاته: ﴿أَلَيْسَ ٱللَّهُ بِكَافٍ عَبْدَهُ﴾؟ أي أليس الله وحده كافيًا لعبده المؤمن، يحميه، يسنده، يطمئنه، يغنيه عن كل خوف؟ كأن الآية تقول لك: إن كان الله معك، فلماذا القلق؟ ولماذا الاضطراب؟ ثم يصف حال الكافرين الذين كانوا يهددون النبي ﷺ بالمشركين والأصنام والقوى الظاهرة، فيقول: ﴿وَيُخَوِّفُونَكَ بِٱلَّذِينَ مِن دُونِهِۦ﴾، أي يحاولون أن يزرعوا في قلبك الخوف من غير الله. لكن هذه القوى كلها أوهى من بيت العنكبوت أمام قوة الله. ويؤكد الله الحقيقة العظمى: ﴿وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٖ﴾. إذا حُجب الإنسان عن نور الله، فلن يهديه أحد مهما عظُم سلطانه أو علمه. أما من تولاه الله فلا يقدر أحد أن يضله. ابن كثير قال: “أليس الله بكاف عبده، أي هو كافٍ من عبده، وهو محمد ﷺ، أعداءه. وقال: من يضلل الله فما له من هاد أي لا يهديه أحد بعد الله.” الطبري قال: “أي الله كافي عبده محمد أمر من خافه من قريش، ويخوّفونه بآلهتهم التي لا تضر ولا تنفع.” والسعدي قال: “فيها طمأنة لعباده المؤمنين، أن من توكل على الله كفاه، ومن خافه أمنه، ومن استعاذ به أعاذه.” فتأمل يا عزيزي القارئ، كيف تربّي الآية في قلبك خوفًا صحيحًا، وخوفًا باطلًا. الخوف الصحيح أن تخاف الله وحده، لأنه هو القادر، هو الكافي، هو المهيمن. والخوف الباطل هو أن تُشغل قلبك بمن لا يملك لك ضرًا ولا نفعًا. فإذا غمر قلبك هذا المعنى، تبدد خوفك من الناس، ومن المستقبل، ومن أي قوة في الدنيا، لأن الله يكفيك، ومن يكفه الله، فقد وجد الطمأنينة الكاملة وسط الخوف.",
      "english_content": "“Is not Allah sufficient for His servant? Yet they threaten you with those [they worship] other than Him. And whoever Allah leaves astray – for him there is no guide.” [Az-Zumar: 36] Look, dear reader, this verse speaks directly to your heart in those moments of fear—fear of people, of circumstances, or of the unknown. Allah asks a question that already contains the answer: “Is not Allah sufficient for His servant?” In other words, if Allah is with you, why should you be anxious? Why should you be unsettled? If He is the One protecting and sustaining you, then no fear has any power over you. Then Allah describes the disbelievers at the time of the Prophet ﷺ: “Yet they threaten you with those [they worship] other than Him.” They tried to frighten him with idols, with their false gods, with worldly powers. But all of these were powerless illusions, weaker than a spider’s web in front of Allah’s might. Finally, Allah reminds us of the ultimate truth: “And whoever Allah leaves astray – for him there is no guide.” If a person turns away and Allah allows his heart to be veiled, then no power on earth can guide him back. But if Allah holds someone by His light, no one can ever misguide him. Ibn Kathir said: “Is not Allah sufficient for His servant, meaning He is sufficient for His servant Muhammad ﷺ against his enemies. And whoever Allah leaves astray – there is no guide for him after Allah.” Al-Tabari said: “Allah is sufficient for His servant Muhammad regarding those of Quraysh he feared, while they tried to frighten him with their powerless gods.” Al-Sa‘di said: “This verse reassures the believers: whoever relies on Allah, He will suffice him; whoever fears Him, He will protect him; whoever seeks refuge in Him, He will shelter him.” So reflect, dear reader: this verse teaches you the difference between true fear and false fear. True fear is of Allah alone, because He alone has power. False fear is of people, of worldly threats, of imagined harms that cannot touch you without His permission. When this truth settles in your heart, fear of people and of the future dissolves—because Allah is enough for you. And whoever has Allah’s sufficiency has found perfect peace in the midst of fear."
    },
    {
      "id": 4,
      "title": "النحل ١٢٨ / An-Nahl 128",
      "verse_text": "يقول الله تعالى: ﴿إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَٱلَّذِينَ هُم مُّحۡسِنُونَ﴾ [النحل: ١٢٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتي كخاتمة لسورة النحل التي تُسمى سورة النعم، حيث عدّد الله فيها آلاءه العظيمة وآياته في الكون، ثم ختم بهذه البشارة العميقة. كأن الله يقول لك: بعد أن عرفت نعمه وآلاءه، الطريق الأمان لك هو أن تكون من المتقين المحسنين، لأن معيّتك الخاصة سترافقك. المعية هنا ليست معية عامة، بل معية خاصة: ﴿إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ﴾، أي مع الذين اتقوا معاصيه وابتعدوا عن حدوده، وجعلوا بينهم وبين غضب الله وقاية. التقوى هي أن تجعل بينك وبين النار حاجزًا من طاعة الله. ثم يضيف: ﴿وَٱلَّذِينَ هُم مُّحۡسِنُونَ﴾، أي لم يكتفوا بالوقاية من الشرور، بل تجاوزوا ذلك إلى الإحسان، أن يعبدوا الله كأنهم يرونه، أن يعاملوا الناس بأجمل ما يكون، أن يردّوا السيئة بالحسنة. ابن كثير قال: “أي إن الله مع المتقين المحسنين بمعونته ونصره وتأييده.” والطبري قال: “إن الله مع الذين اتقوا معية خاصة: يحفظهم ويعينهم.” والقرطبي قال: “هذه معية الكرامة والحفظ والنصرة.” والسعدي قال: “هذه معية خاصة، تقتضي النصر والتأييد والحفظ والهداية.” فتأمل، يا عزيزي القارئ: في لحظات الخوف، قد تبحث عن سند، عن أحد يقف بجانبك، عن كلمة تطمئن قلبك. لكن الله يقول لك: إن كنت متقيًا ومحسنًا فأنا معك. معيّته تعني أن خوفك يزول، لأنك تعلم أن من معك هو القوي، الحافظ، الناصر، الذي بيده مقاليد كل شيء. كأن الآية تخاطبك مباشرة: لا تدع الخوف يملأ قلبك، اجعل بينك وبين غضب الله وقاية بالتقوى، وتزيّن بالإحسان في عملك ومع الناس، وستجد أنك لست وحدك، بل الله معك، وهذه أعظم طمأنينة يمكن أن يذوقها قلب.",
      "english_content": "“Indeed, Allah is with those who fear Him and those who are doers of good.” [An-Nahl: 128] Look, dear reader, this verse comes at the end of Surah An-Nahl, the chapter of blessings, where Allah recounts His countless favors and signs in creation. Then He seals it with this profound promise: if you want true safety and comfort after recognizing all His gifts, then be among the God-fearing and the doers of good—for they are the ones who carry His special companionship. This companionship is not the general one that includes all creation. No, it is a special companionship: “Indeed, Allah is with those who fear Him.” This means He is with them in protection, in support, in guidance. To fear Him here means to build a shield between yourself and His anger, to avoid His prohibitions and hold on to His commands. Then Allah adds: “and those who are doers of good.” They don’t just avoid wrong; they rise higher, living in excellence, worshiping Allah as if they see Him, treating others with the best of manners, and even responding to harm with kindness. Ibn Kathir said: “Allah is with the God-fearing and the doers of good through His aid, His support, and His help.” Al-Tabari said: “This is a special companionship: Allah protects them, helps them, and guides them.” Al-Qurtubi said: “This is the companionship of honor, protection, and victory.” Al-Sa‘di explained: “This companionship entails divine support, preservation, guidance, and assistance.” So reflect, dear reader: in moments of fear, when you search for someone to stand by you, someone to reassure you, Allah tells you: if you fear Me and do good, I am with you. His being with you means fear dissolves—because the One who is with you is the Mighty, the Protector, the Helper, the One who holds control over everything. It’s as if the verse is speaking to you personally: don’t let fear consume you. Instead, guard yourself with piety, adorn yourself with goodness, and you will find that you are never alone. Allah Himself is with you—and that is the greatest comfort a heart could ever know."
    },
    {
      "id": 5,
      "title": "طه ٤٦ / Taha 46",
      "verse_text": "يقول الله تعالى: ﴿قَالَ لَا تَخَافَآ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾ [طه: ٤٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية نزلت في سياق حديث الله لموسى وأخيه هارون عليهما السلام حين أمرهما أن يذهبا إلى فرعون الطاغية. طبيعي أن يملأ الخوف قلبيهما، فهما اثنان ذاهبان إلى ملك جبار متكبر يملك السطوة والبطش. لكن هنا تأتي الكلمة الإلهية التي تهدّئ القلوب: ﴿لَا تَخَافَآ﴾، أي لا تدعا الخوف يسيطر عليكما، لأني أنا معكما. ثم يزيد الطمأنينة: ﴿إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ﴾. هذه المعية الخاصة التي تعني الحماية الكاملة. الله يسمع كل كلمة تُقال لكما، ويرى كل فعل يُفعل بكما. فلا ظلم يخفى عليه، ولا بطش يغيب عنه. وهذا كافٍ لأن يذيب الخوف من القلب. ابن كثير قال: “أي لا تخافا من فرعون، فإني معكما بعوني ونصري وتأييدي.” والطبري قال: “معكما أسمع قول فرعون وجنده، وأرى أفعالهم، فلا يصلون إليكما بمكروه.” والقرطبي قال: “أي معكما بالحفظ والرعاية.” والسعدي قال: “هذه معية خاصة، تقتضي كمال التأييد والنصر والوقاية.” فتأمل يا عزيزي القارئ: هذه الآية ليست لموسى وهارون فقط، بل هي رسالة لكل مؤمن يقف في موقف ضعف أو يواجه بطشًا أو ظلمًا: لا تخف، لأن الله معك. خوفك يتبخر حين تدرك أن من يسمع ويرى هو الله، ومن معك هو الجبار القهار. كأن الآية تقول لك مباشرة: لا تجعل خوفك من البشر يكبر، لأن معك من يراك ويسمعك ويحميك. هذه الكلمة وحدها تكفي أن تجعل قلبك مطمئنًا مهما كان الموقف صعبًا.",
      "english_content": "“[Allah] said, ‘Do not fear; indeed, I am with you both. I hear and I see.’” [Taha: 46] Look, dear reader, this verse comes in the scene when Allah sent Moses and his brother Aaron (peace be upon them) to confront Pharaoh, the tyrant king. Naturally, their hearts were filled with fear—they were just two men standing before a ruler with immense power, authority, and cruelty. But then came the divine words that calmed every trembling heart: “Do not fear.” In other words, don’t let fear take control of you, for I am with you. Then Allah deepens the reassurance: “Indeed, I am with you both. I hear and I see.” This is not just general knowledge; it is the special nearness of protection and care. Allah is telling them: I hear every word said against you, I see every move made toward you, and no harm will reach you except by My will. This divine companionship was enough to dissolve their fear and strengthen their resolve. Ibn Kathir said: “Do not fear Pharaoh, for I am with you through My help, My support, and My victory.” Al-Tabari said: “I am with you, hearing Pharaoh and his soldiers’ words and seeing their deeds, so they will not harm you.” Al-Qurtubi explained: “This means I am with you in protection and care.” Al-Sa‘di said: “This is the special companionship of Allah, which guarantees full support, victory, and protection.” So reflect, dear reader: this verse is not only for Moses and Aaron, but also a message to every believer facing hardship, injustice, or fear. Allah is telling you: Do not be afraid, I am with you. And when the One who is with you is the Almighty, the All-Seeing, the All-Hearing, then truly, fear melts away. It is as if the verse is whispering to you directly: don’t let human threats overpower you, for Allah Himself sees you, hears you, and protects you. This single assurance is enough to turn even the darkest moment into a calm certainty."
    },
    {
      "id": 6,
      "title": "القصص ٢١ / Al-Qasas 21",
      "verse_text": "يقول الله تعالى: ﴿فَخَرَجَ مِنۡهَا خَآئِفٗا يَتَرَقَّبُ قَالَ رَبِّ نَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ﴾ [القصص: ٢١]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تصوّر لحظة عصيبة عاشها موسى عليه السلام بعدما قتل القبطي خطأً، فأصبح مهدّدًا بالخطر، لا يعرف متى ينكشف أمره أو يُؤخذ غدرًا. يقول الله: ﴿فَخَرَجَ مِنۡهَا خَآئِفٗا يَتَرَقَّبُ﴾، أي خرج من المدينة وهو خائف، يتلفّت في الطرقات، يترقب الأخبار، يعيش لحظة الخوف البشري الطبيعي. هذا الخوف يذكرك بأن الأنبياء بشر، يمرون بما يمر به الناس من قلق واضطراب. لكن لحظة الخوف تحوّلت فورًا إلى لحظة لجوء: ﴿قَالَ رَبِّ نَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ﴾. لم يلجأ موسى إلى حيلة أو إلى قومٍ يحتمون به، بل رفع قلبه مباشرة إلى الله. الخوف هنا صار محرّكًا للالتجاء إلى الله، ودعاؤه كان اختصارًا لكل مشاعره: يا رب، أنت وحدك من يقدر أن ينجيني من الظالمين. ابن كثير قال: “أي خرج منها خائفًا على نفسه، مترقبًا ما يكون من ذلك.” والطبري قال: “يتلفّت وراءه هل يطلبه أحد، وقال رب نجني: أي خلصني من فرعون وقومه.” والقرطبي قال: “هذا دعاء في حال الخوف، وهو التوكل على الله عند الاضطرار.” والسعدي قال: “خوفه لم يزده إلا لجوءًا إلى ربه واستعانةً به، وذلك شأن المؤمنين.” فتأمل يا عزيزي القارئ: كم مرة يمر بك خوف، ربما من مستقبل غامض، أو من ظلم الناس، أو من موقف يثقل قلبك. هذه الآية تعطيك الدرس: اجعل خوفك جسرًا إلى الدعاء، لا قيدًا يشلك. قُل كما قال موسى: رب نجني، وستجد أن الله يسمعك ويكفيك.",
      "english_content": "“So he left it, fearful and anticipating [exposure]. He said, ‘My Lord, save me from the wrongdoing people.’” [Al-Qasas: 21] Look, dear reader, this verse captures one of the most intense moments in the life of Moses (peace be upon him). After unintentionally killing the Egyptian man, he suddenly found himself in danger. His secret could be revealed at any moment, and the threat of Pharaoh’s punishment was real. Allah describes his state: “fearful and anticipating,” meaning he walked out of the city full of fear, looking around cautiously, unsure when danger might strike. This shows us that prophets, though chosen by Allah, also experienced human fear and anxiety. But immediately, that fear turned into reliance. “He said, ‘My Lord, save me from the wrongdoing people.’” Instead of seeking safety in tricks or human allies, he lifted his heart directly to Allah. His prayer was simple yet powerful—an honest cry for rescue from injustice. Ibn Kathir said: “He went out fearful for himself, anticipating what might happen.” Al-Tabari explained: “He was looking behind him, expecting to be pursued, and he said, ‘My Lord, save me from Pharaoh and his people.’” Al-Qurtubi noted: “This is the prayer of someone in fear, showing full reliance upon Allah at the moment of desperation.” Al-Sa‘di commented: “His fear only increased his turning to his Lord and seeking His aid, and this is the way of the believers.” So reflect, dear reader: how many times do you face fear—fear of an uncertain future, fear of people’s harm, or fear from a heavy situation? This verse teaches you the way: let your fear be a bridge to supplication, not a chain that paralyzes you. Say as Moses said: “My Lord, save me,” and you will find Allah hearing you, protecting you, and carrying you through."
    },
    {
      "id": 7,
      "title": "التوبة ٥١ / At-Taubah 51",
      "verse_text": "يقول الله تعالى: ﴿قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ﴾ [التوبة: ٥١]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تعطيك مفتاح الطمأنينة في مواجهة الخوف. الله يأمر نبيه أن يقول للمؤمنين: لا تقلقوا من تهديدات الناس ولا من مؤامرات الأعداء، لأن كل ما يُصيبكم إنما هو ما كتب الله لكم، لا عليكم. انتبه للتعبير: ﴿مَا كَتَبَ ٱللَّهُ لَنَا﴾، لم يقل \"علينا\"، بل \"لنا\"، أي أن قضاء الله في النهاية خير لنا وإن بدا مؤلمًا، لأن فيه حكمة ورحمة خفية. ثم يضيف: ﴿هُوَ مَوۡلَىٰنَا﴾، أي الله هو سيدنا وحامينا وناصرنا، لا أحد غيره يملك الأمر. إذا استقر هذا المعنى في قلبك، ستدرك أن الخوف من المخلوق لا معنى له، لأنك تحت ولاية الخالق. وختمها بقوله: ﴿وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ﴾، أي على الله وحده يعتمد المؤمنون، لأن التوكل هو السلاح الذي يبدّد الخوف. التوكل ليس ترك الأسباب، بل أن تفعل ما تستطيع، ثم تسلّم قلبك كله لله. ابن كثير قال: “أي لن يصيبنا إلا ما كتب الله لنا من الخير والشر، ونحن عبيده وفي ملكه، وهو ولينا ونعم المولى ونعم النصير.” والطبري قال: “أي لن ينزل بنا إلا ما سبق به القضاء، وهو لنا خير.” والقرطبي قال: “هذه الآية أصل في التوكل والتفويض إلى الله، وأن ما يقضي فهو للمؤمن خير.” والسعدي قال: “فيها أعظم بشارة للمؤمنين أن ما أصابهم فهو خير لهم، ونصر لهم على أعدائهم، وتكفير لسيئاتهم.” فتأمل يا عزيزي القارئ: هذه الآية كأنها تضع يدها على قلبك الخائف وتقول لك: لا تخف من الغد، ولا من الناس، ولا من الحوادث، لأن كل ما يأتيك مكتوب لك، لا ضدك، مكتوب بحكمة مولاك الذي لا يظلمك. فإذا استودعت قلبك هذا المعنى، زال الخوف وحل محله اليقين والطمأنينة.",
      "english_content": "“Say, ‘Never will we be struck except by what Allah has decreed for us; He is our Protector.’ And upon Allah let the believers rely.” [At-Taubah: 51] Look, dear reader, this verse gives you the key to peace of heart in the face of fear. Allah commands His Prophet ﷺ to tell the believers: do not worry about the threats of people, nor about the schemes of enemies, for nothing will reach you except what Allah has already written for you, not against you. Notice the wording: “what Allah has decreed for us,” not “upon us.” This means that even what may appear painful carries good in the end—it is for your benefit, filled with wisdom and mercy, even if you cannot see it in the moment. Then comes the reassurance: “He is our Protector.” Allah alone is our Master, our Guardian, our Helper. When this truth settles in your heart, fear of creation loses its grip, because you live under the protection of the Creator. The verse concludes: “And upon Allah let the believers rely.” This is the weapon against fear—trust in Allah. True reliance does not mean abandoning effort; rather, it means taking the steps you can, but resting your heart entirely with Him. Ibn Kathir said: “Nothing will strike us except what Allah has written of good or harm. We are His servants in His kingdom, and He is our Guardian, the best Protector and the best Helper.” Al-Tabari explained: “Only what Allah has decreed in His prior knowledge will come to us, and it is ultimately good for us.” Al-Qurtubi noted: “This verse is a foundation of reliance and surrender to Allah, teaching that whatever He decrees is for the believer’s good.” Al-Sa‘di said: “This is the greatest glad tidings for the believers: that everything that reaches them is good, whether victory, or expiation of sins, or elevation of ranks.” So reflect, dear reader: it is as if this verse places a hand gently over your anxious heart and tells you—do not fear tomorrow, do not fear people, do not fear events—for every moment that touches you is written for you, not against you, by your Lord who never wrongs you. With this certainty, fear dissolves, and in its place comes peace, trust, and unshakable confidence in Allah’s decree."
    },
    {
      "id": 8,
      "title": "الزخرف ٦٨ / Az-Zukhruf 68",
      "verse_text": "يقول الله تعالى: ﴿يَـٰعِبَادِ لَا خَوۡفٌ عَلَيۡكُمُ ٱلۡيَوۡمَ وَلَآ أَنتُمۡ تَحۡزَنُونَ﴾ [الزخرف: ٦٨]",
      "content": "انظر يا عزيزي القارئ، هذه الآية من أرقّ النداءات في القرآن، نداء مليء بالحنان الإلهي. الله سبحانه يخاطب عباده المؤمنين يوم القيامة: ﴿يَـٰعِبَادِ﴾، نداء مفعم بالقرب والرحمة، فيه إضافة العبودية إليه تشريفًا لهم. تخيل أن الله العظيم يناديك يوم القيامة: يا عبدي. أي منزلة أعظم من هذا؟ ثم يطمئن قلوبهم في ذلك اليوم العصيب: ﴿لَا خَوۡفٌ عَلَيۡكُمُ ٱلۡيَوۡمَ وَلَآ أَنتُمۡ تَحۡزَنُونَ﴾. الخوف عادةً يكون من المستقبل، والحزن يكون على الماضي. في ذلك اليوم، الله يرفع عنك الاثنين: لا خوف مما هو آتٍ، ولا حزن على ما فات. كل مصدر قلق يذوب، كل ذكرى مؤلمة تُمحى، كل خوف من مصير مجهول يُستبدل بأمان كامل. ابن كثير قال: “هذا تبشير من الله لعباده المؤمنين يوم القيامة، أنهم آمنون من كل خوف، سالمون من كل حزن.” والطبري قال: “لا تخافون مما تستقبلون، ولا تحزنون على ما مضى.” والقرطبي قال: “أي لا تخافون من عذاب ولا عقاب، ولا تحزنون على ما خلّفتم وراءكم.” والسعدي قال: “هذه أعظم بشارة للمتقين، أن الله يناديهم يوم القيامة بهذا النداء الذي يطمئن قلوبهم.” فتأمل يا عزيزي القارئ: كم من خوف يثقل صدرك في الدنيا، وكم من حزن يرهق قلبك. هذه الآية تبشرك أن يوم لقاء الله، لن يبقى شيء من ذلك. كأنها رسالة تقول لك: اصبر على الخوف والحزن في الدنيا، فموعدك يوم يناديك ربك بنفسه: لا خوف عليك اليوم، ولا أنت تحزن.",
      "english_content": "“O My servants, no fear will there be concerning you this Day, nor will you grieve.” [Az-Zukhruf: 68] Look, dear reader, this verse is one of the most tender calls in the Qur’an, a call filled with divine mercy. Allah Himself addresses His believing servants on the Day of Judgment: “O My servants.” This intimate phrase carries honor and closeness—for what rank could be higher than for the Almighty to call you “My servant” on that great Day? Then He soothes their hearts in the most terrifying of scenes: “No fear will there be concerning you this Day, nor will you grieve.” Fear is always tied to the future, while grief is bound to the past. In this single sentence, Allah removes both: no fear about what is coming, no grief about what has passed. Every source of anxiety dissolves. Every painful memory is erased. Every dread of an unknown fate is replaced with perfect peace and security. Ibn Kathir said: “This is Allah’s glad tidings to His believing servants on the Day of Judgment—that they will be safe from every fear and free of every sorrow.” Al-Tabari explained: “You will not fear what lies ahead, nor will you grieve over what has passed.” Al-Qurtubi noted: “You will not fear punishment or torment, nor grieve over what you left behind in the world.” Al-Sa‘di said: “This is the greatest good news for the righteous: Allah Himself will call them with these words, filling their hearts with reassurance.” So reflect, dear reader: how many fears weigh on you in this world, how many griefs sit heavy in your heart. This verse is your promise that, on the Day you meet your Lord, none of that will remain. It is as if the verse whispers: endure your fears and sorrows now, for your appointment is with a Day when Allah Himself will call out to you: no fear upon you today, nor will you grieve."
    },
    {
      "id": 9,
      "title": "التوبة ٢٦ / At-Taubah 26",
      "verse_text": "يقول الله تعالى: ﴿ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا وَعَذَّبَ ٱلَّذِينَ كَفَرُواْۚ وَذَٰلِكَ جَزَآءُ ٱلۡكَـٰفِرِينَ﴾ [التوبة: ٢٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية جاءت في الحديث عن غزوة حنين، حين اغترّ المسلمون بكثرتهم في البداية فاضطربت صفوفهم، وكاد الخوف يسيطر عليهم، لكن الله قلب الحال. يقول سبحانه: ﴿ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُ﴾، أي الطمأنينة والهدوء والثبات، أنزله على قلب رسوله ﷺ أولًا ليكون ثابتًا مطمئنًا، ثم على قلوب المؤمنين من بعده. هذه السكينة ليست شعورًا عاديًا، بل هبة إلهية تُطفئ نار الخوف وتزرع في القلب يقينًا عجيبًا. ثم قال: ﴿وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا﴾، أي من الملائكة الذين نصروا المؤمنين وقاتلوا معهم خفيًا. فليس النصر بالقوة وحدها، بل بمدد الغيب الذي يسوقه الله لعباده. وفي المقابل، قال: ﴿وَعَذَّبَ ٱلَّذِينَ كَفَرُواْ﴾، أي أوقع بهم العذاب والهزيمة، ليظهر الفرق بين من نزلت عليهم السكينة ومن حلّ بهم الغضب. ثم ختم بقوله: ﴿وَذَٰلِكَ جَزَآءُ ٱلۡكَـٰفِرِينَ﴾، أي أن الهزيمة والخزي جزاء من أعرض عن الله ورسوله. ابن كثير قال: “أي أنزل سكينته على رسوله وعلى المؤمنين، أي الطمأنينة والثبات والوقار، وأنزل جنودًا من الملائكة لم تروهم.” والطبري قال: “السكينة هي الأمن الذي أنزله الله في قلوبهم بعد الفزع.” والقرطبي قال: “أي نصرهم بالملائكة، وأنزل في قلوبهم الصبر.” والسعدي قال: “هذه السكينة من أكبر نعم الله على عباده، تملأ قلوبهم إيمانًا ويقينًا عند الشدائد.” فتأمل يا عزيزي القارئ: كم مرة يسيطر الخوف على قلبك عند الشدائد، وتظن أنك ضعيف أو أنك بلا سند. هذه الآية تعلمك أن السكينة تنزل من عند الله لا من نفسك، وأن النصر يأتي بالاعتماد على الله لا على العدد والعدة فقط. كأنها تقول لك: إذا واجهت خوفًا، فالسكينة بيد الله، يضعها في قلبك متى شاء، فإذا نزلت زال الخوف، وثبتت قدمك، وجاءك النصر من حيث لا تحتسب.",
      "english_content": "“Then Allah sent down His tranquility upon His Messenger and upon the believers, and sent down soldiers [angels] whom you did not see.” [At-Taubah: 26] Look, dear reader, this verse was revealed in the context of the Battle of Hunayn. At the beginning, the Muslims were impressed by their large numbers, but fear and confusion shook their ranks. At that moment, Allah turned the tide. He says: “Then Allah sent down His tranquility.” This tranquility—sakīnah—is not an ordinary feeling, but a divine gift: calmness, steadiness, and inner peace that put out the fire of fear and filled their hearts with firm certainty. It descended first upon the Prophet ﷺ, so that he stood firm and confident, and then upon the believers who followed him. Then Allah says: “and sent down soldiers [angels] whom you did not see.” These were angels sent to support the believers and fight alongside them unseen. The victory was not by numbers or strength alone, but by the unseen help that Allah brings to His servants when they trust in Him. On the other side, Allah punished the disbelievers with defeat and humiliation, showing the difference between those who received tranquility and those who faced His anger. Ibn Kathir said: “Allah sent down tranquility upon His Messenger and the believers, meaning calmness, steadiness, and dignity, and He sent angels whom they did not see.” Al-Tabari explained: “Tranquility is the security and peace that Allah placed in their hearts after their panic.” Al-Qurtubi noted: “He supported them with the angels and instilled patience in their hearts.” Al-Sa‘di said: “This tranquility is one of the greatest blessings of Allah upon His servants—it fills their hearts with faith and certainty during hardships.” So reflect, dear reader: how often does fear overtake your heart in moments of trial, making you feel weak or abandoned? This verse teaches you that tranquility comes only from Allah—it is not something you generate yourself. When He sends it down, fear disappears, your heart is strengthened, and victory comes from places you never expected"
    },
    {
      "id": 10,
      "title": "ق ١٦ / Qaaf 16",
      "verse_text": "يقول الله تعالى: ﴿وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ﴾ [ق: ١٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية من أعظم ما يُطمئن قلب المؤمن في لحظات الخوف والوحدة. الله سبحانه يقول: ﴿وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ﴾، أي نحن نعلم أصل نشأته من العدم، ونعلم تفاصيل خلقه، فلا يخفى علينا شيء من أمره. ثم يقول: ﴿وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥ﴾، أي نعلم حتى الخطرات التي تدور في داخله، ما يهمس به قلبه، ما يقلقه وما يخيفه وما يخطر بباله ولم يبح به لأحد. ثم تأتي الكلمة التي تُذيب كل شعور بالوحدة والخوف: ﴿وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ﴾. حبل الوريد هو أقرب ما في جسدك إليك، به حياتك، ومع ذلك الله أقرب إليك منه. هذه ليست قرب مكان، بل قرب علم وإحاطة ورعاية. معك في كل لحظة، يعلم أنين قلبك قبل أن ينطق لسانك، ويرى خوفك قبل أن يظهر على وجهك. ابن كثير قال: “أي هو مطلع على خطرات ابن آدم ولطائف أموره، أقرب إليه من حبل وريده.” والطبري قال: “أقرب إليه بعلمه من نفسه.” والقرطبي قال: “هذا قرب بالعلم والقدرة والإحاطة، لا قرب مسافة.” والسعدي قال: “هذا فيه أعظم تسلية للعبد، أن ربه أقرب إليه من كل أحد، يعلم ما توسوس به نفسه.” فتأمل يا عزيزي القارئ: في لحظات خوفك، قد تظن أنك وحدك، أو أنك لا تستطيع أن تبوح بما في داخلك لأحد. لكن هذه الآية تقول لك: لست وحدك أبدًا، لأن الله أقرب إليك من نفسك، من دمك الذي يجري في عروقك. لا يخفى عليه خوفك، ولا يضيع عنده قلقك. فإذا استشعرت هذا القرب، تبدّد الخوف، لأنك بين يدي من لا يغيب عنك لحظة.",
      "english_content": "“And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein.” [Qaaf: 16] Look, dear reader, this verse is one of the most powerful sources of comfort in moments of fear or loneliness. Allah begins: “We have created man,” reminding you that He knows your very origin, your details, your weaknesses—nothing about you is hidden from Him. Then He says: “and know what his soul whispers to him,” meaning even the secret thoughts of your heart, the worries you never voice, the anxieties that stir silently inside you—Allah knows them all. Then comes the phrase that melts away every sense of isolation: “We are closer to him than [his] jugular vein.” The jugular vein is your very lifeline, closer to you than anything in your body. Yet Allah tells you that He is nearer than that. This is not physical closeness but a closeness of knowledge, awareness, care, and protection. He is with you at every moment—hearing your sighs before they escape, seeing your fears before they show on your face. Ibn Kathir said: “He is aware of the innermost whispers of the son of Adam and the subtleties of his affairs, closer to him than his own jugular vein.” Al-Tabari explained: “He is nearer to him by His knowledge than man is to himself.” Al-Qurtubi noted: “This nearness is by knowledge, power, and full awareness—not by distance.” Al-Sa‘di said: “This is the greatest consolation for the servant, to know that his Lord is closer to him than anyone else, knowing even what his own soul whispers.” So reflect, dear reader: in moments of fear, when you feel no one understands you or when you cannot share what burdens your heart, this verse speaks to you directly: you are never alone. Allah is closer to you than your own self, closer than the blood that flows in your veins. None of your fears are hidden from Him, none of your worries are lost. When you feel this closeness, fear dissolves, because you realize you are always in the care of the One who never leaves you."
    },
    {
      "id": 11,
      "title": "الطلاق ٣ / At-Talaq 3",
      "verse_text": "يقول الله تعالى: ﴿وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا﴾ [الطلاق: ٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية من أعظم الآيات التي تُسكن القلب عند الخوف من المستقبل أو من ضيق الحال. الله يقول: ﴿وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۚ﴾، أي من سلّم أمره لله واعتمد عليه حق الاعتماد، كفاه الله كل ما يخافه ويحذره. كلمة \"حسبه\" تعني كافيه، أي يكفيه الله عن كل أحد. ثم يطمئن قلبك أكثر: ﴿إِنَّ ٱللَّهَ بَـٰلِغُ أَمۡرِهِۦۚ﴾، أي أن أمر الله نافذ، لا يرده شيء، سيبلغ ما أراده حتمًا، فلا تتصور أن هناك من يستطيع أن يمنع ما قضاه الله لك من رزق أو نصر أو فرج. ثم يختم بقوله: ﴿قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا﴾، أي أن لكل شيء موعدًا مقدرًا لا يتقدم ولا يتأخر. فلا تستعجل ولا تقلق، لأن الفرج له وقت حدده الله بحكمته، ولن يخطئك ما كتب لك. ابن كثير قال: “من توكل على الله كفاه ما أهمه من أمر دنياه وآخرته.” والطبري قال: “حسبه: أي كافيه.” والقرطبي قال: “أي من فوض أمره إلى الله كفاه الله ما نزل به.” والسعدي قال: “هذه الآية جامعة لسبب كل خير ودفع كل شر، وهي التوكل على الله.” فتأمل يا عزيزي القارئ: في لحظة خوفك من الغد، من الرزق، من النتائج، هذه الآية تقول لك: كفى بالله وكيلًا. اجعل قلبك معلقًا به، وسيكفيك. لا شيء يضيع عند الله، ولا شيء يفوته، وكل شيء عنده بقدر، حتى لحظة الفرج التي تنتظرها محسوبة لك بدقة، قادمة في وقتها المناسب.",
      "english_content": "“And whoever relies upon Allah – then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.” [At-Talaq: 3] Look, dear reader, this verse is among the most reassuring words in the Qur’an for a heart gripped by fear of the future or by the weight of uncertainty. Allah declares: “And whoever relies upon Allah – then He is sufficient for him.” Whoever entrusts his affairs sincerely to Allah, resting his heart in Him while still taking the means, Allah will take care of all that troubles him. The word sufficient here means fully enough—Allah Himself becomes the one who protects, provides, and relieves. Then Allah strengthens this promise: “Indeed, Allah will accomplish His purpose.” Whatever He decrees must come to pass. No power can prevent His command, no obstacle can block His will. If He has written relief, it will reach you; if He has written protection, it will shield you. Finally, Allah closes with: “Allah has already set for everything a [decreed] extent.” This means that every matter—whether joy or hardship, ease or trial—has its appointed time. Nothing comes too early, nothing is delayed. The relief you wait for is already measured, the hardship you fear already has an end. Ibn Kathir said: “Whoever relies on Allah, He will suffice him in his worldly and religious matters.” Al-Tabari explained: “Sufficient means Allah will take care of his needs and protect him from what he fears.” Al-Qurtubi noted: “This verse is a foundation of reliance upon Allah, promising sufficiency for whoever surrenders to Him.” Al-Sa‘di said: “This verse gathers the cause of all good and the protection from all evil: reliance upon Allah.” So reflect, dear reader: in moments of fear about tomorrow, about sustenance, about outcomes, this verse is like a shield for your heart. It whispers: Allah is enough for you. Nothing escapes His timing, and your relief is already measured and on its way. When you entrust yourself to Him, you are never unprotected, never forgotten."
    },
    {
      "id": 12,
      "title": "الفتح ٤ / Al-Fath 4",
      "verse_text": "يقول الله تعالى: ﴿هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَـٰنٗا مَّعَ إِيمَـٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا﴾ [الفتح: ٤]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تكشف لك سرّ الطمأنينة في قلب المؤمن حين يواجه الخوف. الله يقول: ﴿هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ﴾، أي أن هذا السكون والطمأنينة واليقين الذي يطفئ القلق لم يأت من داخلهم فقط، بل هو نزل من عند الله مباشرة. السكينة هدية سماوية تُسكب في القلب فتبدّل خوفه أمنًا، واضطرابه راحة، وقلقه ثباتًا. ثم يبين الغاية: ﴿لِيَزۡدَادُوٓاْ إِيمَـٰنٗا مَّعَ إِيمَـٰنِهِمۡ﴾، أي أن هذه الطمأنينة لا تكتفي بإزالة الخوف، بل تزيد الإيمان عمقًا وثباتًا. فالابتلاء قد يضعف البعض، لكنه عند المؤمن يزيده يقينًا لأن الله يغمر قلبه بسكينته. ثم يذكرك الله بحقيقة تذيب كل خوف: ﴿وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَٰتِ وَٱلۡأَرۡضِ﴾. أي أن كل القوى، كل الجنود، كل ما في السماوات والأرض بيد الله. فلا يرهقك خوف من عدو، لأن عدوك نفسه لا يملك جندًا إلا بإذن الله. وختم الآية بقوله: ﴿وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا﴾، أي أنه يضع السكينة في الوقت المناسب بعلمه، ويجري الأمور بحكمة، فلا تتعجب من تأخر الطمأنينة أحيانًا، فهي تأتي في اللحظة التي يقدّرها الحكيم العليم. ابن كثير قال: “أنزل الطمأنينة في قلوبهم فازدادوا يقينًا إلى يقينهم.” والطبري قال: “السكينة: الأمن والثبات أنزله الله في قلوبهم.” والقرطبي قال: “السكينة ما يسكن به القلب عند الخوف ويزول به الاضطراب.” والسعدي قال: “هذه السكينة من أجل نعم الله على عباده، بها يزدادون إيمانًا على إيمانهم.” فتأمل يا عزيزي القارئ: الخوف شعور طبيعي، لكنه عند المؤمن لا يبتلعه، لأن الله يسكب في قلبه شيئًا لا يفسره الطب ولا التجربة، بل هو عطاء سماوي: السكينة. فإذا نزلت، لم يعد للخوف سلطان، وصار قلبك يزداد إيمانًا على إيمان.",
      "english_content": "“It is He who sent down tranquility into the hearts of the believers that they would increase in faith along with their faith.” [Al-Fath: 4] Look, dear reader, this verse reveals the secret of peace in the heart of a believer when faced with fear. Allah says: “It is He who sent down tranquility into the hearts of the believers.” This tranquility—sakīnah—is not something they created themselves, but a gift directly from Allah. It is a divine calmness poured into the heart, transforming fear into security, restlessness into ease, and anxiety into steadfastness. Then Allah shows the purpose: “that they would increase in faith along with their faith.” This tranquility doesn’t just remove fear—it deepens faith. Trials might break some people, but for the believer, every challenge becomes a chance for stronger certainty, because Allah fills his heart with peace at just the right moment. Then Allah reminds us of a truth that dissolves fear completely: “And to Allah belong the soldiers of the heavens and the earth.” Every force, every power, every army belongs to Him. So why fear an enemy, when that enemy himself has no strength except by Allah’s permission? And finally, He seals the verse: “And ever is Allah Knowing and Wise.” Meaning He grants tranquility with perfect knowledge of your state, and with wisdom about the exact time you need it. Sometimes it comes just as the trial intensifies, because Allah knows that is the very moment your heart needs it most. Ibn Kathir said: “He sent tranquility into their hearts, increasing their certainty upon certainty.” Al-Tabari explained: “Tranquility is security and firmness that Allah placed in their hearts.” Al-Qurtubi wrote: “It is what makes the heart still in fear and removes agitation.” Al-Sa‘di said: “This tranquility is one of Allah’s greatest favors—it increases the believers’ faith upon faith.” So reflect, dear reader: fear is natural, but it does not control the believer. Why? Because Allah pours into his heart something beyond human capacity—His tranquility. Once it descends, fear loses its grip, and faith grows stronger, more radiant, and unshakable."
    },
    {
      "id": 13,
      "title": "هود ٥٦ / Hood 56",
      "verse_text": "يقول الله تعالى: ﴿إِنِّي تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّي وَرَبِّكُمۡۚ مَا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُ بِنَاصِيَتِهَآۚ إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ﴾ [هود: ٥٦]",
      "content": "انظر يا عزيزي القارئ، هذه الآية هي كلمات نبي الله هود عليه السلام لقومه عندما جاهرهم بالحق ولم يبالِ بتهديداتهم ولا بطغيانهم. تخيّل المشهد: رجل واحد يواجه أمة كاملة من الجبابرة، ومع ذلك يقول بكل يقين: ﴿إِنِّي تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّي وَرَبِّكُمۡ﴾. أي أني جعلت أمري كله عند الله، هو ربي وربكم، فهو أحق أن يُخشى ويُعتمد عليه منكم ومن آلهتكم. ثم جاء بالبرهان الذي يذيب الخوف: ﴿مَا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُ بِنَاصِيَتِهَآ﴾. أي ما من مخلوق على الأرض إلا والله مالك أمره، ممسك بزمام حياته، لا يتحرك إلا بإذنه. فالذي يهددك أو يخيفك، هو نفسه بيد الله، لا يقدر أن يمسك بسوء إلا إن أذن الله. وختم بقوله: ﴿إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ﴾، أي أن ربي عادل، لا يظلم أحدًا، يمضي في حكمه على طريق مستقيم، فلا يخذل من توكل عليه ولا يتركه لقمة في يد عدوه. ابن كثير قال: “أي هو المالك المتصرف في جميع الدواب وغيرها، لا معقب لحكمه.” والطبري قال: “أخذ بناصيتها: أي في قبضته وسلطانه.” والقرطبي قال: “في الآية أعظم دليل على التوكل وتفويض الأمر إلى الله.” والسعدي قال: “هذا التوكل مبني على علم العبد بأن جميع الخلق مربوبون مدبَّرون بيد الله.” فتأمل يا عزيزي القارئ: حين تشعر بالخوف من شخص أو من قوة ما، هذه الآية تذكرك أن كل دابة، كل مخلوق، كل من تهابه، إنما هو بيد الله، لا يستطيع أن يتحرك إلا بأمره. فإذا أودعت نفسك عند الله وتوكلت عليه، صرت في حصن حصين لا تصل إليه يد المخلوقين.",
      "english_content": "“Indeed, I have relied upon Allah, my Lord and your Lord. There is no creature but that He holds its forelock. Indeed, my Lord is on a straight path.” [Hud: 56] Look, dear reader, these are the words of the Prophet Hud (peace be upon him) to his people when he stood alone before their arrogance and threats. Imagine the scene: one man confronting an entire nation of tyrants, yet he declares with unwavering certainty: “Indeed, I have relied upon Allah, my Lord and your Lord.” Meaning: I have handed over my affairs to Allah, the One who owns me and owns you as well. If He is my Lord and yours, then He is the only One worthy of fear and reliance. Then comes the statement that dissolves all fear: “There is no creature but that He holds its forelock.” Every being that walks the earth is under Allah’s full control, held firmly in His grasp. The one who threatens you, the one who frightens you—he himself is in Allah’s hand and cannot move except by His permission. Hud concludes: “Indeed, my Lord is on a straight path.” This means that Allah’s rule is just, His command is wise, and His way is straight. He never wrongs anyone, never abandons those who trust Him, and never allows oppressors to escape His justice. Ibn Kathir said: “He is the Owner and Disposer of all creatures, and none can resist His command.” Al-Tabari explained: “Holding the forelock means they are all under His grasp and authority.” Al-Qurtubi noted: “This verse is the strongest proof of reliance and entrusting all affairs to Allah.” Al-Sa‘di said: “True reliance is built upon knowing that all creation is managed and ruled entirely by Allah.” So reflect, dear reader: whenever you fear a person, a force, or a threat, remember this verse. Every creature, every oppressor, every enemy is held by Allah’s hand. If you entrust yourself to Him, you are shielded by a fortress no one can penetrate. Reliance upon Him is not weakness—it is the greatest strength."
    },
    {
      "id": 14,
      "title": "البقرة ٢٥٧ / Al-Baqarah 257",
      "verse_text": "يقول الله تعالى: ﴿ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَـٰتِۗ أُوْلَـٰٓئِكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَـٰلِدُونَ﴾ [البقرة: ٢٥٧]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تحمل لك وعدًا عظيمًا بالأمان والطمأنينة في مواجهة الخوف. الله يقول: ﴿ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ﴾، أي أن الله نفسه يتولى أمر المؤمنين، يحفظهم، يرعاهم، ينصرهم. فالمؤمن ليس وحده أبدًا، بل في كنف وليّ عظيم لا يُغلب. ثم يصف أثر هذه الولاية: ﴿يُخۡرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ﴾. الظلمات هنا تشمل ظلمات الجهل، والشك، والخوف، والذنوب، وكل ما يثقل القلب. والنور هو نور الإيمان، اليقين، الطمأنينة، الهداية. كأن الله يقول: أنا لا أترككم في ظلمة الخوف، بل أرفعكم إلى نور الطمأنينة. في المقابل، يذكر حال الكافرين: ﴿وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّـٰغُوتُ﴾. الطاغوت يرمز لكل قوة باطلة تُضلّ وتستعبد. هؤلاء يخرجون أتباعهم من نور الفطرة والهداية إلى ظلمات متعددة من الضياع. والنتيجة: ﴿أُوْلَـٰٓئِكَ أَصۡحَـٰبُ ٱلنَّارِ هُمۡ فِيهَا خَـٰلِدُونَ﴾. ابن كثير قال: “الله ولي المؤمنين أي ناصرهم وهاديهم، يخرجهم من الظلمات إلى النور، وأما الكفار فأولياؤهم الطاغوت يضلونهم.” والطبري قال: “الظلمات: الشك والكفر، والنور: الإيمان واليقين.” والقرطبي قال: “هذه أعظم بشارة للمؤمنين، أن الله وليهم في الدنيا والآخرة.” والسعدي قال: “من أعظم آثار ولاية الله للمؤمنين: أنه يخرجهم من كل ما يكرهه الله إلى كل ما يحبه الله.” فتأمل يا عزيزي القارئ: هذه الآية تقول لك ببساطة، إذا كنت من أهل الإيمان، فالله نفسه وليك. هل يبقى للخوف مكان في قلب يتولاه الله؟ الخوف من الناس، من المستقبل، من المصير… كله يتلاشى حين تدرك أنك في رعاية وليّ لا يُعجزه شيء.",
      "english_content": "“Allah is the Protector of those who have believed. He brings them out from darknesses into the light.” [Al-Baqarah: 257] Look, dear reader, this verse carries one of the greatest promises of safety and peace for the believer. Allah declares: “Allah is the Protector of those who have believed.” This means He Himself takes charge of their affairs—guarding them, guiding them, granting them victory. The believer is never alone, for he is under the care of a Protector who can never be overcome. Then Allah describes the effect of this divine guardianship: “He brings them out from darknesses into the light.” These darknesses include ignorance, doubt, fear, sins, and every burden that weighs on the heart. The light is the light of faith, certainty, guidance, and inner peace. It is as if Allah is telling you: I will not leave you drowning in the darkness of fear—I will lift you into the light of tranquility. In contrast, Allah mentions the disbelievers in the rest of the verse: “But those who disbelieve—their allies are the false gods. They bring them out of the light into darknesses. Those are the companions of the Fire; they will abide therein eternally.” Their so-called protectors lead them away from the light of their natural disposition and into layers of misguidance. Ibn Kathir said: “Allah is the Ally of the believers, their Helper and Guide. He brings them out of darkness into light. As for the disbelievers, their allies are the false gods who mislead them.” Al-Tabari explained: “The darknesses are doubt and disbelief, and the light is faith and certainty.” Al-Qurtubi noted: “This is the greatest glad tidings for the believers—that Allah Himself is their Protector in this world and the Hereafter.” Al-Sa‘di said: “One of the greatest effects of Allah’s guardianship is that He moves His servant from everything Allah dislikes to everything He loves.” So reflect, dear reader: this verse tells you plainly—if you are among the believers, Allah Himself is your Protector. Can fear remain in a heart that Allah guards? Fear of people, of tomorrow, of your fate—all of it fades away when you know you are under the care of the One from whom nothing escapes."
    },
    {
      "id": 15,
      "title": "الأحزاب ٣ / Al-Ahzab 3",
      "verse_text": "يقول الله تعالى : ﴿وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا﴾ [الأحزاب: ٣]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تأتي في سياق أمر الله لنبيه ﷺ بالصبر والثبات أمام أذى الكافرين والمنافقين. الله يوجّهه إلى أعظم سلاح يبدّد الخوف: التوكل. يقول: ﴿وَتَوَكَّلۡ عَلَى ٱللَّهِ﴾، أي اجعل اعتمادك عليه وحده، فوّض أمرك إليه، وثق أن ما عنده خير مما عند الناس. ثم يزيد المعنى طمأنينة: ﴿وَكَفَىٰ بِٱللَّهِ وَكِيلٗا﴾. كلمة وكيل تعني الكفيل الذي يتكفّل بأمورك كلها، يحفظك، يدبّر لك، يكفيك. أي أن الله وحده يكفيك عن كل أحد، فمهما كثر الخوف من حولك، وجود الله وكيلًا عنك يكفيك. ابن كثير قال: “أي فوِّض أمرك إلى الله وتوكل عليه، فإنه كافيك وناصرك.” والطبري قال: “كفى بالله وكيلًا: أي قيمًا بأمرك حافظًا لك.” والقرطبي قال: “فيها الأمر بالتوكل الذي هو أصل كل مقام، وهو الاعتماد على الله في كل شيء.” والسعدي قال: “التوكل على الله جامع لأسباب السعادة، وهو يطمئن القلب ويزيل عنه الاضطراب.” فتأمل يا عزيزي القارئ: في أشد لحظات الخوف، يكفيك أن تذكّر نفسك بهذه الكلمة: الله وكيلك. وكيلك الذي لا ينام، ولا يغفل، ولا يعجز. هو من يدبّر أمرك ويكفيك كل ما تخشاه. التوكل هنا ليس مجرد كلمة، بل يقين يملأ القلب فيبدّد الخوف ويزرع الطمأنينة.",
      "english_content": "“And rely upon Allah; and sufficient is Allah as Disposer of affairs.” [Al-Ahzab: 3] Look, dear reader, this verse comes in the context of Allah commanding His Prophet ﷺ to remain patient and steadfast against the harm of the disbelievers and hypocrites. Allah directs him to the greatest weapon that dissolves fear: reliance upon Him. “And rely upon Allah” means entrust your matters to Him, depend upon Him fully, and believe with certainty that what is with Him is better than what is in the hands of people. Then Allah strengthens this command with reassurance: “and sufficient is Allah as Disposer of affairs.” The word wakīl (Disposer of affairs) means the One who takes charge of all matters, who preserves you, protects you, and provides for you. It is as if Allah is telling you: I alone am enough to handle all that concerns you—My guardianship outweighs every threat. Ibn Kathir said: “Entrust your affairs to Allah and rely on Him, for He will suffice you and grant you victory.” Al-Tabari explained: “Sufficient is Allah as Disposer of affairs, meaning He is the caretaker of your matters and the One who preserves you.” Al-Qurtubi noted: “This verse is a command for reliance, which is the foundation of every spiritual station—it is to depend upon Allah in all things.” Al-Sa‘di wrote: “Relying upon Allah gathers all the causes of happiness. It brings peace to the heart and removes its anxieties.” So reflect, dear reader: in your hardest moments of fear, it is enough to remind yourself of this truth—Allah is your wakīl. Your guardian, your protector, the One who never sleeps, never forgets, never fails. He is the One who arranges your affairs better than you ever could. Reliance upon Him is not a weakness—it is the strength that plants peace deep in the heart and makes fear vanish."
    },
    {
      "id": 16,
      "title": "القمر ١٠ / Al-Qamar 10",
      "verse_text": "يقول الله تعالى: ﴿فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٞ فَٱنتَصِرۡ﴾",
      "content": "انظر يا عزيزي القارئ، هذه الآية القصيرة تختصر شعور الخوف والضعف الذي قد يعيشه الإنسان، وكيف يحوله المؤمن إلى قوة بلجوئه إلى الله. نوح عليه السلام بعدما قضى قرونًا يدعو قومه ويلاقي منهم الاستهزاء والعناد والتكذيب، لم يجد في نفسه قوةً بعد ذلك، فقال الكلمة التي تخرج من قلب منكسر، لكنه معلق بالله: ﴿أَنِّي مَغْلُوبٞ فَٱنتَصِرۡ﴾. كلمة مغلوب هنا تحمل كل معاني العجز، الضعف، قلة الحيلة، تراكم الهموم والخوف من بطش القوم، لكن نوح لم يستسلم، بل حوّل هذا الانكسار إلى دعاء. لم يقل: \"أنا مغلوب\" فقط، بل قال: فانتصر، أي يا رب أنت القوي، أنا الضعيف، أنت القادر، وأنا العاجز. هذا التوجه جعل خوفه قوة، ويأسه رجاءً. ابن كثير قال: “هذا دعاء من نوح عليه السلام لما طال عليه البلاء وكثر الأذى.” والطبري قال: “قال: إني قد غلبني قومي ولم أقدر على دفعهم عن نفسي، فانتصر لي منهم.” والقرطبي قال: “فيها دليل على أن دعاء المظلوم مستجاب ولو بعد حين.” والسعدي قال: “هذا من أعظم الأدعية عند الشدائد، فيه إظهار غاية الافتقار إلى الله والتوكل عليه.” فتأمل يا عزيزي القارئ: هذه الآية تعلمك أنك حين تخاف أو تشعر أنك محاصر أو مغلوب على أمرك، فليس عليك إلا أن ترفع يدك وتقول كما قال نوح: إني مغلوب فانتصر. لست وحدك، أنت تملك بابًا يُفتح به النصر من السماء.",
      "english_content": "“So he called upon his Lord, ‘Indeed, I am overpowered, so help!’” [Al-Qamar: 10] Look, dear reader, this short verse captures the essence of fear, weakness, and helplessness—and how faith transforms them into strength. Noah (peace be upon him), after centuries of calling his people and enduring their mockery, rejection, and stubbornness, reached a point of complete exhaustion. His words are simple but loaded with meaning: “Indeed, I am overpowered.” That one word—overpowered—carries the weight of his despair, his sense of being outnumbered, his fear of their oppression, and the crushing burden of his mission. Yet he didn’t stop there. He turned his weakness into a plea: “so help!” In that moment, he handed all his fear and defeat to Allah, declaring: You are the Mighty, I am the weak; You are the Capable, I am the helpless. I cannot, but You can. Ibn Kathir said: “This was the supplication of Noah when the trial had lasted long and the harm had multiplied.” Al-Tabari explained: “He said, ‘My people have overpowered me and I cannot repel them by myself, so help me against them.’” Al-Qurtubi noted: “This verse is proof that the prayer of the oppressed is answered, even if after some time.” Al-Sa‘di wrote: “This is one of the greatest supplications in hardship—it shows the utmost neediness and reliance upon Allah.” So reflect, dear reader: how often do you feel overwhelmed, crushed, or trapped by circumstances you cannot control? This verse teaches you what to do in that moment: turn your defeat into a prayer. Say as Noah said: “I am overpowered, so help!” And you will find that Allah responds, opening doors of relief and victory from places you could never imagine."
    },
    {
      "id": 17,
      "title": "الشورى ١٩ / Ash-Shura 19",
      "verse_text": "يقول الله تعالى: ﴿ٱللَّهُ لَطِيفُۢ بِعِبَادِهِۦ يَرۡزُقُ مَن يَشَآءُۖ وَهُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ﴾ [الشورى: ١٩]",
      "content": "انظر يا عزيزي القارئ، هذه الآية تُسكن قلبك في لحظات الخوف من المستقبل أو القلق على الرزق. الله يصف نفسه بأنه ﴿لَطِيفُۢ بِعِبَادِهِۦ﴾، أي أنه يتعامل معهم بلطف خفي لا يدركونه أحيانًا، يدبّر شؤونهم بحكمة ورحمة، يهيّئ لهم الأسباب دون أن يشعروا. لطفه ليس فقط في النعم الظاهرة، بل في تلك التفاصيل الصغيرة التي تحميك وتوجّهك من حيث لا تدري. ثم يقول: ﴿يَرۡزُقُ مَن يَشَآءُ﴾. فالخوف من ضيق العيش، أو المستقبل المجهول، يذوب أمام هذه الحقيقة: رزقك بيد الله وحده، هو يفتح لك أبوابه متى شاء وكيف شاء، فلا سلطان لأحد أن يمنعه عنك. ويختم الآية بقوله: ﴿وَهُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ﴾. أي أن لطفه لا يعني ضعفًا أو عجزًا، بل هو اللطيف في رحمته، القوي في قدرته، العزيز الذي لا يُغلب. يجمع بين الرفق بك والقدرة المطلقة على حمايتك ونصرك. ابن كثير قال: “لطيف بعباده أي بار بهم رحيم بهم، يرزق من يشاء ويهدي من يشاء.” والطبري قال: “اللطيف: الذي يلطف بعباده فيرزقهم من حيث لا يعلمون.” والقرطبي قال: “لطيف: أي رفيق بعباده، لا يعجل بالعقوبة، يرزقهم برفق.” والسعدي قال: “لطفه هو إيصال مصالح عباده إليهم من حيث لا يحتسبون.” فتأمل يا عزيزي القارئ: حين تخاف من الغد، أو يقلقك رزقك وأمانك، هذه الآية تخاطبك: الله لطيف بك، يعلم ضعفك، يتولاك برحمته، يرزقك بقدرته، ويحميك بعزته. ليس عليك إلا أن تسلّم قلبك له، وسيكفيك بلطفه الذي لا يخطئ موضعه أبدًا.",
      "english_content": "“Allah is Subtle with His servants; He provides for whom He wills. And He is the Powerful, the Exalted in Might.” [Ash-Shura: 19] Look, my dear reader, this verse brings peace to the heart when fear or anxiety about the future arises. Allah describes Himself as Subtle with His servants — meaning He deals with them in ways they may not perceive. His subtlety lies in arranging their affairs with hidden mercy and wisdom, often through causes and outcomes they do not recognize at first. Then He says: “He provides for whom He wills.” This statement removes the fear of poverty or uncertainty about sustenance. Your provision is not in the hands of people, nor tied to worldly circumstances; it is solely in the hands of Allah. He grants it when He wills and how He wills, and no one can prevent what He decrees. The verse concludes: “And He is the Powerful, the Exalted in Might.” His subtle mercy does not stem from weakness or inability, but from strength and might. He is gentle in His care, yet supreme in His power, combining mercy with absolute ability to protect and to grant. Ibn Kathir explained: “Subtle with His servants: kind and merciful with them, providing for whom He wills and guiding whom He wills.” Al-Tabari said: “The Subtle One: who brings provision to His servants in ways they do not know.” Al-Qurtubi said: “Subtle: gentle with His servants, not rushing to punish them, providing for them with gentleness.” And Al-Sa‘di said: “His subtlety is that He brings His servants’ benefits to them from where they do not expect.” So, dear reader, when you fear tomorrow, when worries of provision and safety weigh on your heart, this verse whispers reassurance: Allah is subtle with you, knowing your weakness, guiding your path, providing for you with His power, and protecting you with His might. Your role is to trust Him fully — and His subtle care will never miss its mark."
    },
    {
      "id": 18,
      "title": "الأنعام ١٧ / Al-An’am 17",
      "verse_text": "يقول الله تعالى: ﴿وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِن يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ﴾ [الأنعام: ١٧]",
      "content": "هذه الآية الكريمة ترسم للمؤمن قاعدة كبرى في حياته، قاعدة تزيل الخوف وتبعث الطمأنينة: أن الله وحده هو المتصرف في الضر والنفع. إن أصابك ضرّ من مرض، أو همّ، أو خوف، أو ضيق، فلا يوجد أحد في الدنيا كلها يملك كشفه عنك إلا الله. لا طبيب، ولا صديق، ولا قريب، ولا مال، ولا جاه. الكاشف واحد، هو الله. وإن أصابك الله بخير من رزق أو صحة أو سعادة أو هداية، فهو القادر على منحه، ولا أحد يستطيع أن يمنع فضله عنك. الخير كله بيده، والقدرة كلها له. ابن كثير قال: “لا يكشف الضر إلا هو، ولا يجلب الخير إلا هو، فالأمر كله بيده.” والطبري قال: “إن أصابك الله بشدة أو بلاء، فلا يكشف ذلك إلا هو، وإن أنعم عليك بخير فلا مانع لفضله.” هذه الآية تبعث في النفس طمأنينة عجيبة، فهي تذكرك أن الأمر كله عند الله، وأنك لست في يد الناس ولا في يد الظروف، بل في يد إله رحيم عليم قدير. هي آية تعطي الخائف أمانًا، والمضطرب سكينة، وتعلّم المؤمن ألا يلتفت إلا إلى ربه في كل شأنه.",
      "english_content": "“And if Allah touches you with adversity, none can remove it except Him; and if He touches you with good – then He is over all things competent.” [Al-An’am: 17] This verse lays down a profound principle for the believer’s life, a principle that removes fear and fills the heart with tranquility: that Allah alone controls harm and benefit. If you are afflicted with adversity—be it illness, worry, fear, or hardship—there is no one in the entire world who can lift it from you except Allah. Not a doctor, not a friend, not a relative, not wealth, not status. The One and Only who removes it is Allah. And if Allah grants you good—whether provision, health, happiness, or guidance—then it is by His power alone, and no one can withhold His bounty from you. All goodness is in His Hand, and all ability belongs to Him. Ibn Kathir said: “None removes harm except Him, and none brings good except Him; the entire matter is in His Hand.” And Al-Tabari said: “If Allah afflicts you with hardship or trial, none can lift it but Him; and if He blesses you with good, there is no preventer of His favor.” This verse gives the soul a strange serenity, reminding you that the entire affair lies with Allah. You are not in the hands of people nor in the hands of circumstances, but in the Hands of a Merciful, All-Knowing, All-Powerful Lord. It is a verse that grants security to the fearful, calm to the anxious, and teaches the believer to turn only to his Lord in all matters."
    }
  ]
}