{
  "feeling": "رسالة",
  "verses": [
    {
      "id": 1,
      "title": "الإسراء ٩ / Al-Isra 9",
      "verse_text": "يقول الله تعالى: ﴿إِنَّ هَـٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا﴾ [الإسراء: ٩]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية من أعظم ما قيل عن القرآن، لأنها لا تصفه فقط ككتاب، بل كـ رسالة حيّة تهديك أنت بالذات. الله سبحانه وتعالى يفتتح الكلام بـ: ﴿إِنَّ هَـٰذَا ٱلۡقُرۡءَانَ﴾، كأنه يشير إليه أمامك الآن ويقول لك: هذا الذي بين يديك ليس كتابًا عاديًا، بل نور، دليل، خريطة لحياتك.\n\nثم يصفه بغاية ما يتمنى أي إنسان في رحلته: ﴿يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ﴾. \"أقوم\" ليست مجرد طريق مستقيم، بل الطريق الأكثر اعتدالًا، الأكثر صلاحًا، الأكثر ثباتًا، الطريق الذي لا عوج فيه ولا انحراف. يعني أن القرآن لا يقودك لأي مسار، بل يقودك للمسار الأمثل في كل شيء: في عبادتك، في أخلاقك، في قراراتك، في حياتك اليومية. كم من الطرق يراها الإنسان أمامه؟ طريق للشهوة، طريق للمال، طريق للجاه… لكن القرآن يمسك بيدك ويقول: هذا هو الطريق الأقوم.\n\nثم يأتي الجزء الثاني الذي يملأ القلب بالرجاء: ﴿وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ﴾. القرآن ليس كتاب تحذير فقط، بل كتاب بشرى. هو يبشرك وأنت في الدنيا، يقول لك إن كل سجدة، كل صدقة، كل دمعة من خشية الله، كل لحظة صبر على الطاعة، كلها ليست ضائعة. القرآن يسجلها ويبشرك أنك بها تدخل تحت وعد الله.\n\nأما البشرى فهي أعظم من أي بشرى دنيوية: ﴿أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا﴾. كلمة \"كبير\" هنا ليست وصفًا مبهمًا، بل معناها أن الأجر أعظم مما تتخيل. ابن كثير يقول: \"أي الجنة يوم القيامة وما فيها من النعيم المقيم.\" والطبري يقول: \"أجرًا عظيمًا لا انقطاع له ولا فناء.\" والقرطبي يزيد: \"الأجر الكبير هو النجاة من النار والفوز بالجنة، وهو أعظم أمل للمؤمن.\"\n\nفتأمل يا عزيزي القارئ: هذه الآية ليست خبرًا عامًّا، بل رسالة مباشرة لك. إن كنت تبحث عن الطريق الصحيح وسط متاهات الدنيا، فاعلم أن القرآن يهديك للأقوم. وإن كنت تعمل صالحًا وتشعر أن لا أحد يقدّر جهدك، فالقرآن يبشرك أن أجرك كبير عند الله، أكبر من الدنيا وما فيها.\n\nوتأمل كيف يربط القرآن بين \"الهداية\" و\"البشرى\". الهداية ليست مجرد أوامر ونواهٍ، بل هي الطريق الذي يجلب لك البشرى والفرح في النهاية. كأن الله يقول لك: \"اتبع هداي، وستصل إلى البشرى التي تحلم بها، الأجر الكبير الذي لا يزول.\"\n\nوهنا يتجلى معنى الرسالة: أن القرآن ليس كتاب تاريخ ولا قصص ماضٍ، بل كتاب حيّ يخاطبك الآن. كلما فتحت هذه الآية كأنها تقول: \"أيها القارئ، أنت على موعد مع الأقوم، ومع بشرى من الله، ومع أجر كبير.\"\n\nابن السعدي رحمه الله لخّص المعنى فقال: \"يهدي للتي هي أقوم: أي أعدل من جميع الطرق، وهو العلم بالحق والعمل به، ويبشر المؤمنين الذين يعملون الصالحات بأن لهم أجرًا كبيرًا، وهو الجنة وما فيها من النعيم.\"\n\nفانظر كيف اجتمع في هذه الآية ثلاثة عناصر: الهداية، البشرى، الأجر. هذه هي الرسالة كلها: أن تسير على طريق مستقيم، تُبشَّر في الدنيا، وتُجزى في الآخرة.\n\nيا عزيزي القارئ، لو سألك أحد يومًا: ما الذي يريده القرآن منك؟ فاقرأ له هذه الآية. إنها خلاصة الرسالة، إنها خطاب الله إليك: \"تمسّك بي، أنا أهديك للأقوم، وأبشّرك بأجر كبير عندي.\"",
      "english_content": "“Indeed, this Qur’an guides to that which is most just and right, and gives good tidings to the believers who do righteous deeds that they will have a great reward.” [Al-Isra: 9]\n\nDear reader, this verse is among the greatest words ever revealed about the Qur’an, because it does not simply describe it as a book, but as a living message meant to guide you personally. Allah begins with: “Indeed, this Qur’an” — as if He points to it right in front of you and says: This is not an ordinary book; this is light, guidance, a map for your life.\n\nThen he tells us what it does: “guides to that which is most just and right.” Notice the wording — not just “a straight path,” but the most upright, most balanced, most flawless path. The Qur’an does not pull you towards any random road, it leads you to the best one — in worship, in morals, in decisions, in every detail of life. Think about how many paths a person sees before him: the path of desires, wealth, power… but the Qur’an takes your hand and says: This is the straightest one.\n\nAnd then comes the part that fills the heart with hope: “and gives good tidings to the believers who do righteous deeds.” The Qur’an is not a book of warnings only — it is also a book of glad tidings. It tells you, while you are still here in this world, that none of your efforts are wasted: every prayer, every charity, every tear of fear before Allah, every moment of patience — all of it is recorded and will blossom into reward.\n\nAnd what is that reward? Allah calls it “a great reward.” Ibn Kathir explains: “It means Paradise, with its everlasting bliss.” Al-Tabari says: “A reward that never ends and never fades.” And Al-Qurtubi adds: “It is salvation from the Fire and the eternal joy of Paradise.” In other words, it is far beyond what you could ever imagine.\n\nDear reader, look carefully at how this verse combines three elements: guidance, glad tidings, and reward. This is the entire message of the Qur’an in one breath: it shows you the straightest way, it comforts you with glad tidings along the journey, and it promises you a reward that is beyond measure.\n\nAl-Sa‘di beautifully summarized: “It guides to the most just of all paths — knowledge of the truth and acting upon it — and it gives glad tidings to the believers who act righteously that they shall have a great reward, namely Paradise and its delights.”\n\nSo, dear reader, if anyone ever asked you: What does the Qur’an want from me? — This verse is the answer. It is God’s direct address to your heart: Hold on to Me, I will guide you to what is best, I will give you glad tidings in this life, and I will grant you a great reward in the Hereafter."
    },
    {
      "id": 2,
      "title": "البقرة ١٥٣ / Al-Baqarah 153",
      "verse_text": "يقول الله تعالى: ﴿يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ ٱسْتَعِينُواْ بِٱلصَّبْرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ﴾ [البقرة: ١٥٣]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية العظيمة نزلت لتكون بلسمًا ودواءً لكل قلب ينهكه التعب أو يثقله الهم. إنها ليست مجرد وصية عابرة، بل هي خطاب مباشر من الله لك أنت، أيها المؤمن، يخاطبك باسمك الإيماني: ﴿يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ﴾. عندما تسمع هذا النداء في القرآن، تذكّر أنه نداء مخصّص لك، نداء شرف وتكريم، نداء يضعك في موضع المتلقي المباشر لوصية الرحمن.\n\nثم تأتي الوصية: ﴿ٱسْتَعِينُواْ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ﴾. الله يعلم ضعفك، ويعلم أن دروب الحياة ليست سهلة، وأن طريق الإيمان محفوف بالابتلاءات، لذلك لم يتركك بلا زاد ولا سلاح، بل أعطاك سلاحين عظيمين: الصبر و الصلاة. الصبر هنا ليس فقط تحمّلًا سلبيًا، بل هو ثبات في المواقف، قوة في مواجهة الابتلاء، ضبط للنفس أمام شهواتها، ورباطة جأش أمام المحن. أما الصلاة فهي الحبل الذي يصلك بالله، هي الملجأ الذي تعود إليه خمس مرات في اليوم لتسكب دموعك، لتبوح بضعفك، ولتجد الراحة والسكينة.\n\nابن كثير يقول في تفسيره: \"استعينوا بالصبر على أموركم كلها، ومن أعظمها أداء الفرائض، وترك المحارم، وعلى المصائب، وخصّ الصلاة بالذكر لأنها أعظم العون على كل أمر.\" والطبري يوضح: \"اجعلوا الصبر عونكم في شدائدكم، والصلاة مستندكم عند نزول البلاء، فإنها تنهى عن الفحشاء والمنكر وتفتح أبواب الرحمة.\" والقرطبي يضيف: \"قرن الصبر بالصلاة لأن العبد يحتاج إليهما دائمًا؛ فبالصبر تثبت النفس على الطاعة، وبالصلاة يستمد العبد من ربه القوة والعون.\"\n\nثم يأتي وعد لا يشبه أي وعد: ﴿إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ﴾. تأمل يا عزيزي القارئ: الله لا يقول هنا إنه يحبهم فقط أو يثيبهم، بل يقول إنه معهم. \"المعية\" هنا ليست معية مكان، بل معية خاصة بالرعاية، بالتأييد، بالنصر، بالعناية. أن تكون في معية الله، يعني أن يمدك بالطمأنينة في قلبك، بالنور في دربك، بالقوة في ضعفك. أي عزاء أعظم من هذا؟ وأي دعم أكرم من هذا؟\n\nتأمل حال الصحابة رضوان الله عليهم حين نزلت هذه الآية. كانوا في بداية الإسلام يواجهون الاضطهاد، الخوف، القتل، الحصار. لم يكن عندهم قوة مادية، لكن الله أعطاهم معية أعظم من كل الجيوش: معية الله بالصبر والصلاة. وكان النبي ﷺ إذا حزبه أمر فزع إلى الصلاة، ليجسد لنا عمليًا كيف تكون الصلاة ملجأ القلب عند الضيق.\n\nيا عزيزي القارئ، هذه الآية تضع بين يديك سرّ الطمأنينة في الدنيا: أن تجعل الصبر والصلاة جناحين تحلّق بهما فوق همومك. فإذا اجتمعا في قلبك، لن يكسرك حزن، ولن يزلزلك بلاء، لأن الله وعد أن يكون معك.\n\nفكأن الله يقول لك في هذه اللحظة: \"إذا أثقلك الحزن، إذا أحاطت بك المصائب، إذا شعرت بالوحدة أو الانكسار، لا تيأس. استعن بالصبر، استعن بالصلاة، وستجدني معك. ومعي، لن يضرك شيء.\"\n\nهذه هي رسالة الله لك: طريق القوة يبدأ من الصبر والصلاة، وينتهي بمعية الله التي لا تضاهى.",
      "english_content": "“O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.” [Al-Baqarah: 153]\n\nDear reader, this mighty verse was revealed as a balm and remedy for every heart worn down by exhaustion or weighed by sorrow. It is not a passing counsel, but a direct address from Allah to you — yes, to you, the believer — calling you by the noblest of titles: “O you who have believed.” Whenever you hear this call in the Qur’an, remember: it is a personal honor, a divine summons meant for you, placing you as the direct recipient of the Lord’s guidance.\n\nThen comes the counsel: “Seek help through patience and prayer.” Allah knows your weakness, He knows that the paths of life are not easy, and that the road of faith is lined with tests. He did not leave you without provisions or weapons — instead, He placed in your hands two of the greatest tools: patience and prayer. Patience here is not passive endurance, but steadiness in moments of hardship, strength in the face of trials, discipline against desires, and resilience when calamities strike. And prayer is the lifeline that connects you to Allah, the refuge you return to five times a day to shed your tears, pour out your weakness, and find rest and serenity.\n\nIbn Kathir explains: “Seek help through patience in all your affairs — foremost in fulfilling obligations, avoiding sins, and enduring trials. And prayer was singled out because it is the greatest aid in every matter.” Al-Tabari says: “Let patience be your aid in hardships, and prayer your support in times of calamity, for it restrains from immorality and opens the doors of mercy.” Al-Qurtubi adds: “Patience was coupled with prayer because the servant is always in need of both: patience to remain firm in obedience, and prayer to draw strength from his Lord.”\n\nThen comes a promise unlike any other: “Indeed, Allah is with the patient.” Reflect, dear reader: Allah does not say here that He merely loves them or rewards them, but that He is with them. This “withness” is not about place, but about special support — with care, aid, victory, and mercy. To be in the company of Allah means that He fills your heart with tranquility, lights your path, and strengthens you in your weakest moments. What comfort could be greater? What support could be nobler?\n\nThink of the companions of the Prophet ﷺ when this verse was revealed. They were at the dawn of Islam, facing persecution, fear, boycott, even death. They had no worldly power, but Allah gave them something greater than armies: His companionship, earned through patience and prayer. And the Prophet ﷺ, whenever something weighed heavily on him, would rush to prayer — showing us in practice how prayer becomes the heart’s refuge in times of distress.\n\nDear reader, this verse places in your hands the secret of peace in this world: to make patience and prayer your two wings, carrying you above your burdens. When both are rooted in your heart, no grief can break you, no trial can shake you, because Allah has promised to be with you.\n\nIt is as if Allah is telling you at this very moment: “If sorrow overwhelms you, if hardship surrounds you, if you feel lonely or broken — do not despair. Seek help through patience, seek help through prayer, and you will find Me with you. And with Me, nothing can harm you.”\n\nThis is the eternal message of Allah for you: the path of strength begins with patience and prayer, and it ends with the incomparable companionship of Allah. -----------------------------------------------\nالشعور: رسالة\nاسم الآيه: الضحى ١١ / Ad-Duha 11\nنص الآيه: يقول الله تعالى: ﴿وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ﴾ [الضحى: ١١]\n\nالتفسير: هذه الآية الكريمة تأتي في ختام سورة الضحى، السورة التي نزلت على قلب النبي ﷺ في وقتٍ حرج من حياته، حين فتر الوحي فاشتد عليه الألم، وبدأ المشركون يهمسون بأن ربَّه قد تركه وودَّعه. فجاءت السورة نوراً يبدد ظلام الحزن، وبشارةً تطمئن قلب النبي وتثبت فؤاده، بل وتفتح أمامه أبواب الأمل. وبعد أن ذكّره الله بنعمه عليه في طفولته ويُتمه وضلاله وفقره، ختمها بهذه التوجيهات الثلاثة: فلا تقهر اليتيم، ولا تنهر السائل، وأمّا بنعمة ربك فحدِّث.\n\nهذه الآية تحمل رسالة عميقة للقلب المؤمن. فالله جل وعلا يأمر نبيَّه أن يُعلن النعم، لا من باب الفخر ولا التباهي، ولكن من باب الشكر، والتذكير بها، واستخدامها في طاعة الله. أن تُحدِّث بنعمة الله يعني أن تعترف بها أولاً في قلبك، أن ترى أن كل خير جاءك إنما هو من فضل ربك. ثم تتحدث عنها بلسانك بما يذكّرك ويذكّر الناس بفضل الله، وتنشر أثرها بالفعل فتجعل نعم الله جسراً إلى طاعته، لا وسيلة للغفلة والكبر.\n\nالمفسرون أوضحوا معاني هذا الحديث بالنعم. قال ابن كثير: “أي كما كنت يتيماً فآواك الله، وضالاً فهداك، وعائلاً فأغناك، فحدِّث بنعم الله عليك، واشكره عليها.” وقال القرطبي: “المراد أن تشكر ربك وتثني عليه، وتظهر آثار نعمته، فإن كتمان النعمة جحود، وإظهارها شكر.” أما الطبري فيقول: “حدّث الناس بما أنعم الله به عليك من الدين والوحي والرسالة، لتدلّهم على الحق الذي هداك الله إليه.”\n\nومن هنا نفهم أن أعظم النعمة التي أُمر النبي بالتحديث بها هي نعمة الوحي والرسالة، لأن بها يُنقذ الله العباد من الظلمات إلى النور. فهي ليست مجرد نعم دنيوية كالغنى أو الكفاية، بل أعظم نعم الله على البشر. وهكذا يكون الحديث عن النعمة دعوةً إلى الحق، وتبليغاً للرسالة، وشهادةً بأن الفضل كله من الله.\n\nوعلى المستوى الشخصي، الآية تضع قاعدة في حياة كل مؤمن: أن يشكر الله على ما أنعم به عليه، وأن لا يخجل من نسب النعم إلى ربِّه. إذا وفقك الله لطاعة، فاذكر أنها من فضله، وإذا أعانك في ضيق، فاذكر لطفه، وإذا رزقك سعة، فاذكر كرمه. ولا تجعل النعمة تُنسيك المُنعِم.\n\nوهناك بُعد نفسي عظيم في هذه الآية: فالإنسان إذا تحدث بنعم الله، امتلأ قلبه طمأنينةً وسكينة، لأنه يتذكر أن الله لم يتركه لحظة، بل أنعم عليه مراراً. وإظهار النعم يُعينك على تجاوز الأحزان، تماماً كما كان الغرض في سياق السورة أن يذكّر النبي ﷺ برعاية الله له في الماضي ليطمئن قلبه في الحاضر والمستقبل.\n\nفكأن هذه الآية تقول لك: “إن كنت في حزن أو ضيق، فانظر إلى ما أنعم الله به عليك، وتحدث به، ستجد أن هذه الذكرى تملأ قلبك شكراً ورضاً وتُذهب عنك الأسى.”\n\nإذن، ﴿وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ﴾ ليست مجرد دعوة لذكر النعم، بل هي رسالة إيمانية شاملة: أن تجعل حياتك كلها شكراً، وأن يكون لسانك ترجمان قلبك المقر بفضل الله، وأن يكون عملك مظهراً لهذا الشكر.\n\nوبهذا ختمت سورة الضحى بآية تُحوِّل الضعف إلى قوة، والحزن إلى رضا، واليأس إلى أمل، عبر مفتاح بسيط: أن ترى نعمة الله، وتحدّث بها.\n\nAllah says: \"But as for the favor of your Lord, report [it].\" [Ad-Duha: 11]\n\nThis noble verse comes at the conclusion of Surat Ad-Duha, the chapter revealed to the Prophet ﷺ during a difficult moment of his life, when revelation had paused, and the whispers of the disbelievers claimed that his Lord had abandoned him. The surah came as a radiant light, dispelling sorrow and strengthening his heart, reminding him of God’s care in the past and assuring him of His continued mercy. After recalling the blessings of protection in his childhood, guidance, and provision, Allah sealed the surah with three commands: do not oppress the orphan, do not repel the seeker, and as for the favor of your Lord – proclaim it.\n\nThis verse carries a profound spiritual message. Allah commands His Prophet not to hide the blessings, but to acknowledge and share them—not for pride or boasting, but as a form of gratitude and as a reminder to himself and to others of Allah’s mercy. To “speak of the favor” means first to recognize it sincerely within one’s heart, then to mention it with the tongue in a way that glorifies the Giver, and finally to show it through action by using those blessings in the service of God.\n\nThe commentators explained this verse in beautiful detail. Ibn Kathir said: “Just as you were an orphan and Allah sheltered you, lost and He guided you, poor and He enriched you, so proclaim His blessings upon you and thank Him for them.” Al-Qurtubi explained: “The meaning is to give thanks to your Lord, to praise Him, and to make His favors apparent. To conceal them is ingratitude, and to show them is gratitude.” Al-Tabari added: “Speak to the people of what Allah has bestowed upon you of religion, revelation, and prophethood, so that they may be guided by what guided you.”\n\nThus, the greatest favor which the Prophet ﷺ was commanded to proclaim is the blessing of revelation itself, the Qur’an and the message of guidance. Through it, humanity is taken from darkness to light. Proclaiming this favor means calling people to truth, delivering the message faithfully, and always attributing every good to Allah.\n\nOn a personal level, this verse establishes a principle for every believer: always attribute your blessings to Allah. If He grants you provision, health, knowledge, or faith, acknowledge that it is from Him. If He saves you from hardship, let your heart and tongue testify to His mercy. Speaking of the favor is not arrogance—it is gratitude, provided that the heart remains humble and the words glorify the Giver, not the self.\n\nThere is also a profound psychological wisdom here: when a person reflects on God’s blessings and speaks of them, sorrow and despair fade, and gratitude and hope take their place. This was the purpose in the context of the surah: to remind the Prophet ﷺ of God’s care in the past so that his heart would be comforted about the present and future.\n\nIt is as though this verse is telling you: “Whenever sadness weighs on you, recall what God has given you, and proclaim it. Let your heart overflow with gratitude, and you will find comfort.”\n\nTherefore, \"But as for the favor of your Lord, report [it]\" is not simply about naming blessings—it is a comprehensive message: to live a life of gratitude, to let your tongue be a witness to God’s grace, and to let your actions mirror that thankfulness.\n\nAnd thus, Surat Ad-Duha closes with a key that turns weakness into strength, sorrow into contentment, and despair into hope—through a simple yet profound act: remembering and speaking of the favor of your Lord."
    },
    {
      "id": 3,
      "title": "الشرح ١-٢ / Al-Inshirah 1-2",
      "verse_text": "يقول الله تعالى: ﴿أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ ١ وَوَضَعْنَا عَنكَ وِزْرَكَ ٢﴾ [الشرح: ١-٢]",
      "content": "هذه الآيات المباركة تفتح سورة الشرح، وهي سورة جاءت لتسكب الطمأنينة في قلب النبي ﷺ، وتؤكد له أن ربه لم يتركه لحزنه أو مشقته، بل أنعم عليه بأعظم النعم.\n\nيقول الله: ﴿أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ﴾، والمعنى: ألم نوسع صدرك يا محمد للإيمان، وننوره باليقين، ونملأه بالحكمة والسكينة؟ فشرح الصدر ليس مجرد انشراح نفسي، بل هو انفتاح روحي يتسع به القلب لحمل رسالة عظيمة مثل رسالة الإسلام. يقول ابن عباس: “شرح الله صدره للإسلام وللوحي حتى احتمل ما لم يحتمله بشر قبله ولا بعده.” وقال القرطبي: “أي ملأه نورًا وهدى، حتى صار واسعًا للعلم والمعرفة.” فهذا الشرح هو الذي جعله صابرًا أمام أذى الناس، راضيًا بحكم الله، ثابتًا في طريقه.\n\nثم قال سبحانه: ﴿وَوَضَعْنَا عَنكَ وِزْرَكَ﴾، أي خففنا عنك ثقلًا كان يرهق ظهرك. والمفسرون قالوا إن المقصود هو الذنوب الصغيرة التي قد تقع من النبي ﷺ بغير قصد، فيغفرها الله ويزيل أثرها، ليبقى قلبه طاهرًا نقيًا. وقال بعضهم: هو ثقل الدعوة وأعباؤها، التي خففها الله عنه بمعونته وتيسيره، فكأن الله يقول: لقد أعناك على حمل الرسالة، فلا يثقل قلبك همها.\n\nهذا المعنى عميق يا عزيزي القارئ: فكل إنسان يحمل في قلبه “وزرًا” ما، ثِقلاً من الذنوب، أو من هموم الحياة، أو من أعباء المسؤولية. وهذه الآية تذكرك أن الله وحده هو القادر على أن يضع عنك هذا الحمل، أن يخفف عنك ما يرهقك، وأن يبدل ضيق صدرك سعة ونورًا.\n\nابن كثير قال: “أي حططنا عنك ذنوبك وثقلناك الذي أثقل ظهرك، فغفرها لك وأزاحها عنك.” والطبري قال: “أي خففنا عنك أعباء الرسالة بما أعناك عليها، فلم يبق لها ثقل في صدرك.”\n\nوهنا يظهر لك سر من أسرار القرب من الله: أن صدرك يشرح كلما اقتربت من ذكره وطاعته، وأن وزرك يخف كلما لجأت إليه تائبًا. إنها دعوة لك أن تجعل قلبك موصولًا بالله دائمًا، لأنه وحده من يشرح الصدر ويضع الوزر.\n\nفتأمل يا عزيزي القارئ: إن كنت مثقلًا بالذنوب، أو غارقًا في الهموم، أو محاصرًا بالأحزان، فاذكر أن ربك هو الذي شرح صدر نبيه ووضع عنه وزره، وهو القادر أن يصنع بك مثل ذلك إن لجأت إليه. هذه الآيات جاءت لتقول لك: لا تحزن، الله معك، سيشرح صدرك، وسيخفف عنك أثقالك، كما فعل مع أحب خلقه إليه.",
      "english_content": "“Did We not expand for you your breast? (1) And We removed from you your burden (2) [Al-Inshirah: 1-2]”\n\nThese verses, dear reader, open Surah Ash-Sharh (The Relief), and they come as a divine embrace to the Prophet ﷺ, assuring him that his Lord has not abandoned him to sorrow or hardship, but has blessed him with the greatest of blessings.\n\nAllah says: “Did We not expand for you your breast?”—meaning: Did We not open your heart to faith, fill it with light, wisdom, and certainty, and make it vast enough to carry the weight of revelation? The expansion of the breast here is not just emotional relief, but a profound spiritual enlightenment that empowered the Prophet ﷺ to endure what no ordinary human could. Ibn Abbas explained: “Allah expanded his chest for Islam and for the Qur’an, so he could bear what others could not.” Al-Qurtubi added: “He filled it with light and guidance, making it wide for knowledge and understanding.” This is why his heart remained patient under harm, steadfast under trials, and radiant with divine tranquility.\n\nThen Allah says: “And We removed from you your burden.” This refers, as many scholars noted, to the sins—small human slips—that Allah forgave, purifying his heart and keeping it spotless. Others said it means the immense weight of the mission and its responsibilities, which Allah lightened by His help and support, so the Prophet ﷺ was never left to bear it alone.\n\nDear reader, reflect on this deeply: every soul carries a “burden”—whether sins, regrets, or the crushing load of life’s hardships. And just as Allah relieved His Prophet of his burden, He is able to ease yours. Ibn Kathir said: “He forgave his sins, removed their trace, and made his back light.” Al-Tabari said: “He supported him in his mission so that it no longer weighed heavily on him.”\n\nThe lesson for you is clear: when you return to Allah in humility, He expands your chest with faith, lifts your burdens with mercy, and replaces heaviness with relief. Your closeness to Him determines how much peace fills your heart.\n\nSo, dear reader, if you feel your chest is tight with worries, or your shoulders heavy with unseen weights, know that the One who expanded the chest of Muhammad ﷺ and removed his burden can do the same for you. These verses whisper to you: turn back to Him, and you will find relief, expansion, and a lightened heart."
    },
    {
      "id": 4,
      "title": "الإسراء ٨٢ / Al-Isra 82",
      "verse_text": "يقول الله تعالى: ﴿وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَۙ وَلَا يَزِيدُ ٱلظَّـٰلِمِينَ إِلَّا خَسَارٗا﴾ [الإسراء: ٨٢]",
      "content": "يا عزيزي القارئ، هذه الآية تكشف لك وجهًا آخر من وجوه القرآن، لا باعتباره كتاب تشريع فقط، ولا قصصًا للتسلية، بل باعتباره دواءً إلهيًا يلمس القلوب ويشفي الأرواح. يقول الله تعالى: \"وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ\"، فالقرآن شفاء. لكنه شفاء من أي شيء؟ هنا تتعدد أقوال العلماء وتتنوع، لكنها كلها تلتقي عند حقيقة واحدة: أنه شفاء من أمراض الظاهر والباطن.\n\nقال ابن كثير: \"يهدي به من اتبعه من الضلالة، ويقيه به من الجهالة، ويخرجه من الظلمات إلى النور، وهو شفاء لما في الصدور من الشكوك والشبه والريب.\" فالشفاء هنا أول ما يكون شفاءً للقلب من الحيرة، للصدر من الضيق، وللروح من القلق والاضطراب. حين تقرأ القرآن بصدق، تجد همومك تخف، جروحك الروحية تلتئم، وأفكارك تتنقى من الغبار. ولهذا قال مجاهد: \"شفاء من الشرك والنفاق.\"\n\nلكن ليس الأمر معنويًا فقط؛ بل كثير من السلف رأوا أن الآية تشمل أيضًا الشفاء الحسي. فقد ورد أن الصحابة كانوا يرقون بالقرآن المرضى، فكان الله يشفيهم. ألم تقرأ قصة الفاتحة حين رقى بها الصحابي سيد القوم الذي لدغته عقرب، فقام كأن لم يكن به بأس؟ فهذا من بركة هذا الكتاب.\n\nثم تأتي الكلمة الثانية: \"ورحمة للمؤمنين\". ليست مجرد شفاء مؤقت، بل رحمة دائمة. الرحمة هنا أوسع من الشفاء؛ لأنها تشمل الحماية، الطمأنينة، والسكينة. المؤمن يجد في القرآن حضنًا يأويه، ولطفًا يغمره، وبشارة تضيء له الطريق. القرآن لا يعالج المرض فقط، بل يمنع عودته، لأنه يزرع في القلب نورًا يجعل صاحبه ثابتًا في مواجهة الحياة.\n\nأما الطرف الآخر، فالآية تقول: \"ولا يزيد الظالمين إلا خسارا\". وهذا أمر عجيب: نفس الآيات التي تشفي وتطمئن المؤمن، هي نفسها التي تزيد الكافر والمعاند خسرانًا وضلالًا. كيف ذلك؟ لأن القرآن يفضح ظلمهم ويقيم عليهم الحجة، فإذا كذبوا به ازدادوا بُعدًا وعنادًا. قال الطبري: \"كلما سمعوا من القرآن شيئًا ازدادوا به كفرًا إلى كفرهم، لأنه لا يدخل قلوبهم نور الإيمان.\"\n\nفتأمل يا عزيزي القارئ: أنت الآن أمام مرآة، القرآن إما أن يكون لك شفاء ورحمة، أو يكون عليك خسارة وحجة. الاختيار يتوقف على قلبك: أهو قلب مؤمن مقبل، أم قلب معاند معرض؟\n\nوهنا سر عظيم: الله لم يقل \"القرآن كله شفاء\" بل قال: \"من القرآن ما هو شفاء\". وهذا ليس للتبعيض كما توهم البعض، بل للتنويع: أي أن منه سورًا وآيات مخصوصة تكون لها خصوصية في الشفاء مثل الفاتحة وآيات الرقية. لكن المعنى الأوسع أن كله شفاء بحسب حالك: فإذا أردت الطمأنينة وجدت آيات السكينة، وإذا أردت التوبة وجدت آيات الندم، وإذا أردت الهداية وجدت آيات النور.\n\nيا قارئي العزيز، اجعل هذه الآية خارطة لك: إذا ضاق صدرك فاقرأ، إذا ضعفت نفسك فاقرأ، إذا أثقلت الذنوب قلبك فاقرأ. اجعل القرآن دواءك اليومي، كما تتناول الطعام لتقوى، تناول آياته لتستقيم. فهو الشفاء الذي لا يعجز، والرحمة التي لا تنقطع.",
      "english_content": "\"And We send down in the Qur'an that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss. [Al-Isra: 82]\n\nMy dear reader, this verse uncovers another face of the Qur’an—not only as a book of laws, nor as stories for reflection, but as a divine remedy that touches hearts and heals souls. Allah says: “And We send down in the Qur’an that which is healing and mercy for the believers”. The Qur’an is a healing. But healing from what? Scholars have given different perspectives, yet they all converge on one truth: that it heals both the seen and unseen illnesses.\n\nIbn Kathir said: “It guides those who follow it from misguidance, protects them from ignorance, and brings them out from darkness into light. It is healing for what is in the hearts of doubts, suspicions, and uncertainties.” So the first layer of healing is spiritual—curing the confusion of the heart, the suffocation of the chest, and the unrest of the soul. When you recite the Qur’an with sincerity, you find your worries lighter, your wounds closing, and your thoughts purified. Mujahid said: “It is healing from shirk and hypocrisy.”\n\nBut it is not only spiritual. Many of the early generations understood this verse as including physical healing too. The Companions used the Qur’an to cure the sick through ruqyah (recitation of verses). You might recall the story of a Companion who recited Al-Fatihah over a tribal chief bitten by a scorpion—he stood up as if nothing had happened. Such is the barakah (blessing) of this Book.\n\nThen comes the second gift: “and mercy for the believers.” This is broader than healing. Healing removes pain, but mercy envelops, comforts, and nurtures. It is a source of constant safety and tranquility. A believer finds in the Qur’an a refuge, a shade, and a light of hope that sustains him. It does not only treat the illness but protects against its return, filling the heart with steadfastness and serenity.\n\nAs for the other side, the verse continues: “but it does not increase the wrongdoers except in loss.” The same words that guide and soothe the believer can become a burden for the denier. How? Because the Qur’an exposes their injustice and establishes proof against them. Al-Tabari said: “Every time they hear something from the Qur’an, they increase in disbelief upon disbelief, because no light of faith enters their hearts.”\n\nReflect, dear reader: the Qur’an is like a mirror. For you, it can be healing and mercy, but for the stubborn rejecter, it is loss and regret. The choice is yours—how does your heart approach it?\n\nAnd notice a subtle point: Allah did not say “the entire Qur’an is healing” but rather “from the Qur’an, that which is healing.” This is not to limit it but to highlight that certain passages—like Al-Fatihah or specific verses—are particularly powerful in healing. Yet in a broader sense, the whole Qur’an can be your cure, depending on your state: when you seek comfort, you’ll find verses of tranquility; when you repent, verses of forgiveness; when you are lost, verses of guidance.\n\nSo, my dear reader, let this verse be your map: when your chest feels tight, read; when your soul feels weak, read; when sins weigh heavily, read. Take the Qur’an as your daily medicine, just as you take food for strength. It is the healing that never fails, and the mercy that never ends."
    },
    {
      "id": 5,
      "title": "آل عمران ٧٤ / Aal-Imran 74",
      "verse_text": "يقول الله تعالى: ﴿يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُۚ وَاللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ﴾ [آل عمران: ٧٤]",
      "content": "عزيزي القارئ، هذه الآية الكريمة تأتي في سياق الحديث عن تفضيل الله لبعض عباده بنعمة الإيمان والهداية، وكيف أن الرحمة ليست شيئًا يُنال بالقوة أو بالحيلة، بل هي محض اصطفاء من الله وتفضل. يقول تعالى: ﴿يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ﴾. أي أن الله جل وعلا هو المالك المطلق للرحمة والهداية، يهبها لمن يشاء من عباده، لا اعتراض على حكمه، ولا رد لقضائه، ولا سؤال عن مشيئته، لأنه العليم بمن يستحق، والحكيم في عطائه ومنعه.\n\nالطبري يقول في تفسيره: “يخص برحمته من يشاء، أي يوفق من يشاء لدينه، ويهديه للإسلام، وذلك رحمة من الله عظيمة لا ينالها العبد إلا بتوفيق الله.” وابن كثير قال: “أي يهدي من يشاء إلى الحق ويضله من يشاء بعدله، ولهذا قال: ﴿والله ذو الفضل العظيم﴾، أي واسع الفضل عظيم المنّة.” أما القرطبي فأضاف: “هذه الآية أصل في أن الهداية محض تفضل من الله، ليست بالعمل وحده ولا بالعقل، بل هي عطاء من الله لمن علم فيه الخير.”\n\nتأمل يا عزيزي القارئ، كيف يربينا القرآن على التواضع أمام هذا الحق. كم من إنسان ذكي قوي الفكر، واسع العلم، لكنه ضل الطريق لأنه لم يُرد الله به خيرًا. وكم من إنسان بسيط لا يملك من أدوات الدنيا شيئًا، لكنه رُزق نور الإيمان، فصار قلبه مستنيرًا بذكر الله. إنها رحمة يختص الله بها من يشاء.\n\nلكن هذا لا يعني أن نركن إلى الكسل أو نترك الأخذ بالأسباب، بل إن مشيئة الله مرتبطة بحكمة. فمن أقبل على الله بصدق، وطرق بابه بالتوبة، وسعى لنيل مرضاته، فالله أكرم من أن يرده. قال تعالى: ﴿وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا﴾. فالرحمة لا تُنال اعتباطًا، بل تُطلب، وتُسعى لها، وتُغتنم، ثم يأتي التوفيق من الله.\n\nوأما قوله: ﴿وَاللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ﴾، فهي تذكير ببحر عطايا الله الذي لا ساحل له. هو سبحانه يعطي بلا حدود، ويرزق بلا حساب، ويغفر بلا قيد لمن يشاء. وإذا فتح الله على عبدٍ باب فضله، فإنه يغمره بخير الدنيا والآخرة.\n\nابن عاشور أشار إلى أن ذكر الفضل العظيم هنا بعد الرحمة، دليل على أن الرحمة ليست من باب العدل المستحق، بل من باب الفضل الخالص. أي أنك مهما عملت واجتهدت فلن تدخل الجنة بعملك، وإنما بفضل الله ورحمته. وقد جاء في الحديث الصحيح أن النبي ﷺ قال: «لن يدخل أحدكم الجنة بعمله.» قالوا: ولا أنت يا رسول الله؟ قال: «ولا أنا إلا أن يتغمدني الله بفضل ورحمة».\n\nفتأمل يا عزيزي القارئ، كيف تُعطيك هذه الآية سكينة وطمأنينة: أنت لا تتعامل مع ربٍ شديد العقوبة فقط، بل مع رب يفيض فضله، ويوزع رحمته، ويختص من يشاء بمغفرته وهداه. وهذا يبعث في قلبك الأمل مهما بلغت ذنوبك، لأن الله قد يفتح لك باب رحمته في لحظة صدق واحدة.\n\nإن هذه الآية تعلمك ألا تيأس من نفسك، ولا تحتقر عطايا الله، ولا تظن أن الفضل بعيد عنك. كل ما تحتاجه أن تطرق الباب بإخلاص، وتطلب من الكريم، فهو ذو الفضل العظيم، يعطي من غير حساب.",
      "english_content": "\"He selects for His mercy whom He wills. And Allah is the possessor of great bounty.\" [Aal-Imran: 74]\n\nMy dear reader, this noble verse comes in the context of reminding us that mercy, guidance, and divine favor are not gained through force, intellect, or human effort alone. They are gifts from Allah, freely granted to whomever He wills. Allah says: “He selects for His mercy whom He wills.” This means that true faith, inner peace, and guidance are acts of divine selection. No one can demand them, and no one can prevent them when Allah decrees them.\n\nAl-Tabari explains: “He selects for His mercy whom He wills, meaning He guides whom He wills to His religion and grants him success to embrace Islam, and that is among the greatest mercies of Allah.” Ibn Kathir says: “He guides whom He wills to the truth and misguides whom He wills by His justice. That is why Allah said: ‘And Allah is the possessor of great bounty.’ Meaning, His bounty is vast and His grace is immense.” And Al-Qurtubi adds: “This verse is a foundation that guidance is purely from the grace of Allah. It is not achieved by deeds alone nor by intellect, but rather as a gift from Allah to those in whom He knows good.”\n\nReflect, dear reader, on how this verse humbles the soul. You may see people of immense intelligence and deep knowledge, yet they wander far from truth because Allah did not will guidance for them. And you may see others with little knowledge or worldly status, yet Allah fills their hearts with faith and light. This is the essence of the divine mercy that Allah selects for whomever He wills.\n\nBut this does not mean we sit idle. The mercy of Allah is sought, and His favor is pursued with effort. Whoever knocks sincerely at His door, repents truthfully, and strives to please Him, Allah—out of His vast mercy—will not turn away. As Allah promises: “And those who strive for Us – We will surely guide them to Our ways.” Thus, His will to grant mercy comes in perfect wisdom: it meets the effort of the seeker with divine grace.\n\nThe closing part of the verse says: “And Allah is the possessor of great bounty.” This reminds us that everything Allah grants is out of His limitless generosity, not because anyone deserves it in full. Even Paradise itself is not earned by deeds alone, but by His mercy and grace. The Prophet ﷺ said: “None of you will enter Paradise by his deeds alone.” They said, “Not even you, O Messenger of Allah?” He said: “Not even me, unless Allah envelops me with His mercy and grace.”\n\nMy dear reader, let this verse sink into your heart: Allah’s mercy is not restricted, nor is His bounty limited. He may choose to grant it to you at the very moment you turn sincerely to Him, no matter how burdened your past may be. So never despair, never think you are too far, for Allah is “the possessor of great bounty.” His door is always open, His mercy always flowing, and His grace always greater than your sins."
    },
    {
      "id": 6,
      "title": "السجدة ١٧ / As-Sajdah 17",
      "verse_text": "يقول الله تعالى: ﴿فَلَا تَعْلَمُ نَفْسٞ مَّآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ﴾ [السجدة: ١٧]",
      "content": "عزيزي القارئ، هذه الآية الكريمة من أعظم ما ورد في تصوير نعيم الآخرة، وهي باب واسع للأمل والطمأنينة لكل قلب يشتاق إلى رحمة الله ورضوانه. إن الله سبحانه وتعالى يفتح لنا هنا نافذة على الغيب، نافذة صغيرة لكنها كافية لتملأ القلب بالشوق والرجاء. يقول ربنا جل وعلا: ﴿فَلَا تَعْلَمُ نَفْسٞ﴾ أي لا يوجد نفس في الدنيا – مهما بلغت معرفتها وعلومها – تستطيع أن تتخيل أو تدرك حقيقة ما أعده الله لعباده الصالحين في الجنة.\n\nالطبري رحمه الله قال: “لا يعلم أحد ما أخفى الله لأوليائه في الآخرة من النعيم والكرامة التي تقر أعينهم، وذلك جزاء لما كانوا يعملون في الدنيا من طاعة الله.” وابن كثير قال: “أي فلا يعلم أحد عظمة ما أخفي لهم من النعيم المقيم واللذات التي لم ترها عين ولم تسمع بها أذن ولم تخطر على قلب بشر.” أما القرطبي فقد نقل عن الحسن البصري قوله: “أخفى القوم أعمالهم، فأخفى الله لهم ما لم تر عين ولم تسمع أذن ولم يخطر على قلب بشر.”\n\nتأمل معي يا عزيزي القارئ: الجزاء من جنس العمل. هم في الدنيا كابدوا أعمالاً خالصة بين يدي الله، ربما لا يراها أحد ولا يقدرها أحد. صبروا، بكوا، جاهدوا أنفسهم، تصدقوا في السر، غفروا في لحظة غضب، تركوا شهوة حرام لأجل الله. كل تلك الأعمال كانت خفية لا يعلمها إلا الله، فجعل الله جزاءهم نعيمًا خفيًا لا يعلمه أحد إلا أن يكشفه الله لهم يوم القيامة.\n\nوهنا يظهر جمال التعبير القرآني: ﴿مَآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ﴾. أي شيء يقر عين الإنسان، يملأ قلبه بالرضا، ويُنسيه كل هم وحزن ومشقة، قد أعده الله لهم. كلمة \"قرة أعين\" في اللغة تعني السعادة التامة التي تثبت العين من شدّة الفرح فلا تتحرك، وكأن العين وجدت ما يطمئنها فلا تبحث بعده عن شيء آخر.\n\nوجاء في الحديث القدسي الذي أخرجه البخاري ومسلم: قال رسول الله ﷺ: “قال الله عز وجل: أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر.” ثم تلا قول الله تعالى: ﴿فَلَا تَعۡلَمُ نَفۡسٞ مَّآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ﴾. فهذا الحديث يفسر الآية، ويبين أن النعيم الموعود لا يُتصور ولا يُحد بحدود الدنيا.\n\nومن لطيف المعنى يا عزيزي القارئ أن الآية لم تحدد ما هو هذا النعيم، بل تركته مبهمًا: “ما أخفي لهم.” وهذا الإبهام مقصود، لأنه يزيد الشوق، ويجعل القلوب متلهفة لرؤية ما وراء هذا الغيب العظيم. فالإنسان بطبعه إذا سمع عن شيء مجهول عظيم، تضاعف شوقه إليه. فما بالك إذا كان ذلك المجهول هو الجنة ونعيمها الذي لا ينفد؟\n\nابن القيم رحمه الله يعلق على هذه الآية في \"الوابل الصيب\" فيقول: “تأمل كيف قابل الله إخفاءهم لطاعاتهم وعباداتهم، بإخفاء ما أعد لهم من جزاء. فمن ستر نفسه بين يدي الله، ستره الله يوم القيامة بستره، وأكرمه بما لم يخطر له ببال.”\n\nإذن، يا عزيزي القارئ، هذه الآية دعوة لك أن تتأمل: كل دمعة صادقة خرجت من قلبك في جوف الليل، كل سجدة أديتها بخشوع، كل صبر تحملته لأجل دينك أو أهلك أو مبدئك، لم يذهب هدرًا. كلها محفوظة في كتاب الله، وموعدك أن ترى جزاءها عيانًا يوم القيامة، جزاءً لم يخطر على بالك يومًا.\n\nهذه الآية وحدها كافية أن تنزع الحزن من قلب المؤمن، وتزرع فيه الطمأنينة. فما قيمة متاع الدنيا الزائل أمام \"قرة أعين\" أعدها الله لك بيده، رحمةً وكرمًا، جزاءً بما كنت تعمل؟",
      "english_content": "“And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do.” [As-Sajdah: 17]\n\nMy dear reader, this verse is among the most powerful in portraying the unseen delights of the Hereafter, a verse that opens before us a door of hope and longing. Allah, Exalted is He, tells us that no soul, no matter its knowledge or imagination, can ever comprehend the reality of what He has prepared for His righteous servants.\n\nAl-Tabari said: “No one knows what Allah has concealed for His allies in the Hereafter of joy and honor that will comfort their eyes, and that is a recompense for their deeds in this world.” Ibn Kathir added: “It means: none knows the greatness of what is hidden for them of everlasting bliss, pleasures that no eye has seen, no ear has heard, and no heart has ever imagined.” Al-Qurtubi narrated from al-Hasan al-Basri: “They concealed their deeds, so Allah concealed for them what no eye has seen, no ear has heard, and no heart has imagined.”\n\nReflect, my dear reader: the reward is of the same kind as the deed. In this life, they performed acts sincerely for Allah, often hidden from people’s sight. They bore patiently, forgave when angry, gave charity in secret, resisted temptation, and turned back to Allah in moments of weakness. None saw their struggle but Allah. And so, their recompense is a reward hidden from every eye until the Day when Allah Himself unveils it for them.\n\nNotice the wording: “of comfort for eyes.” In Arabic, “Qurrat A’yun” describes joy so complete that it settles the eyes, stopping their restless searching. It is the happiness that fills the soul with such peace that it no longer longs for anything else.\n\nThe Prophet ﷺ explained this verse in a hadith qudsi recorded in al-Bukhari and Muslim: “Allah says: I have prepared for My righteous servants what no eye has seen, no ear has heard, and what has never crossed the heart of a human being.” Then he recited this verse. The hadith clarifies that this reward is utterly beyond our worldly experience or imagination.\n\nIbn al-Qayyim beautifully comments that the vagueness in the verse — “what has been hidden for them” — is intentional, for it increases longing. The unknown pulls the heart more strongly than what is defined. And what a longing it is, when the hidden promise is Paradise itself.\n\nSo, my dear reader, take comfort: not a single tear shed in the night, not a single act of patience, not a single hidden prayer or sacrifice will be lost. All of it is stored with Allah, waiting for you as treasures unseen. When you meet Him, you will discover that every hardship was worth it, every sacrifice was multiplied, and every moment of sincerity has blossomed into “comfort for the eyes.”"
    },
    {
      "id": 7,
      "title": "الطلاق ٢-٣ / At-Talaq: 2-3",
      "verse_text": "يقول الله تعالى: ﴿وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا ٢ وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا﴾ [الطلاق: ٢-٣]",
      "content": "اسمع يا عزيزي القارئ، هذه الآيتان من أعظم الآيات التي تُسكب في قلبك يقينًا وراحة عند الشدائد. هما كالجسر بين ضيق الدنيا وسعة رحمة الله، وكأنهما تقولان لك: مهما ضاقت بك الطرق، ومهما تعقّدت الأمور، هناك دائمًا \"مخرج\" يصنعه الله لك إذا اتقيته.\n\nابن كثير قال: “أي من اتقى الله فيما أمره به وترك ما نهاه عنه، جعل له فرجًا ومخرجًا من كل كرب وضيق، ورزقه من حيث لا يحتسب، أي من جهة لا تخطر بباله ولا رجاء له فيها.” الطبري أضاف: “المخرج يكون من كل ما ضاق على العبد أمره.” والقرطبي قال: “هي أرجى آية في كتاب الله، لأن الله عمّ بقوله: (يجعل له مخرجًا) كل كرب وضيق.”\n\nفتأمل، يا عزيزي القارئ، كيف جعل الله الشرط واضحًا: ﴿وَمَن يَتَّقِ ٱللَّهَ﴾، أي أن تجعل بينك وبين معاصيه حاجزًا، فتراقبه في السر والعلن، وتجعل خوفه ورضاه ميزان خطواتك. والنتيجة موعودة: ﴿يَجۡعَل لَّهُۥ مَخۡرَجٗا﴾.\n\nثم يضيف ربك ما يطمئن قلبك أكثر: ﴿وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ﴾. الرزق ليس فقط مالًا، بل رزق في الطمأنينة، في البركة، في العلاقات، في العمل، في السعادة. ومن أعجب ما في هذه الجملة أنها تفتح لك باب المفاجآت من عند الله، رزق يأتيك من أبواب لم تخطر لك، لتدرك أن التدبير بيده وحده.\n\nأما الجملة الثالثة فهي قلب الآيتين: ﴿وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۚ﴾. أي من فوض أمره إلى الله واعتمد عليه بصدق، فإن الله يكفيه، يكفيه في همه، في رزقه، في عدوه، في ضعفه. ليس المقصود أن تجلس وتترك العمل، بل أن تعمل وتعلم أن النتائج بيد الله وحده.\n\nويأتي الخاتمة الحاسمة: ﴿إِنَّ ٱللَّهَ بَـٰلِغُ أَمۡرِهِۦۚ﴾، أي أن أمر الله نافذ لا يُعجزه شيء، فما قضاه لك سيصل إليك مهما وقف الناس ضده، وما منعه عنك فلن تناله ولو اجتمع أهل الأرض كلهم.\n\nثم يزيد الطمأنينة بقوله: ﴿قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا﴾، لتتذكر أن حياتك ليست فوضى، وأن حزنك، وخوفك، وانتظارك، ورزقك، كلها مقدّرة بحكمة من لا يخطئ التدبير.\n\nيا عزيزي القارئ، اجعل هذه الآية زادك عند الضيق، ورددها كلما أُغلقت أمامك الأبواب. وتذكر أن الذي يفتح المخارج من رحم الأزمات هو الله، وأن الرزق بيده لا بيد أحد من خلقه، وأن التوكل عليه هو النجاة الحقيقية.",
      "english_content": "“And whoever fears Allah – He will make for him a way out (2) And will provide for him from where he does not expect. And whoever relies upon Allah – then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent. (3)” [At-Talaq: 2-3]\n\n\nMy dear reader, these two verses are among the most reassuring words that Allah revealed, a balm for every heart overwhelmed with fear, uncertainty, or distress. They are like a promise written directly to you: no matter how tangled life becomes, no matter how narrow the path feels, Allah has already prepared a way out for those who live with His consciousness in their hearts.\n\nIbn Kathir explained: “Whoever fears Allah by obeying Him and avoiding what He forbade, Allah will make for him a way out of every worry and difficulty, and will provide for him from sources he never imagined.” Al-Tabari said: “The ‘way out’ includes every relief from hardship that presses on a servant.” And Al-Qurtubi beautifully described this verse as “the most hopeful verse in the Book of Allah, for His words ‘He will make for him a way out’ are all-encompassing for every tightness and sorrow.”\n\nLook closely, dear reader, at how the verse begins: And whoever fears Allah – whoever guards himself by fearing Allah, keeping His commands, and staying away from His prohibitions. That is the key. Then comes the promise: He will make for him a way out – He will surely make for him an exit, even when every worldly path seems blocked.\n\nAnd then the verse gives an even greater comfort: And will provide for him from where he does not expect – sustenance will come from where you never expected. Not only material provision, but also provision of peace, support, wisdom, and relief. Sometimes, it arrives from places you never imagined, just so you remember that the Provider is Allah alone.\n\nThe next line is the heart of these verses: And whoever relies upon Allah – then He is sufficient for him – whoever truly relies on Allah, He will be enough for him. This doesn’t mean abandoning effort, but working while knowing that the outcome is only in Allah’s hands. When you surrender your fears to Him, you discover that His care is more than sufficient.\n\nThe verse seals this promise with: Indeed, Allah will accomplish His purpose – Allah’s decree will always reach completion. What he has written for you will come, no matter who tries to stop it. And what He has withheld will never reach you, even if all of creation joined to bring it.\n\nFinally, Allah reassures you: Allah has already set for everything a [decreed] extent – He has already set a measure and timing for everything. Your hardship, your waiting, your relief, and your provision are all carefully decreed. Nothing is random; everything unfolds with perfect wisdom.\n\nSo, my dear reader, let these verses be your anchor in every storm. Remember that with taqwa (consciousness of Allah) comes a guaranteed exit. With trust in Him comes sufficiency. And with His decree comes certainty, never chaos. If today feels heavy, know that your Lord has already written your relief."
    },
    {
      "id": 8,
      "title": "النحل ١٨ / An-Nahl 18",
      "verse_text": "يقول الله تعالى: ﴿وَإِن تَعُدُّوا نِعْمَتَ ٱللَّهِ لَا تُحْصُوهَاۗ إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ﴾ [النحل: ١٨]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية كأنها تمسك بيدك وتُريك بحرًا لا ساحل له: بحر نعم الله عليك. تقول لك: لو حاولت أن تعدّ نعم الله، نعمةً نعمة، لما استطعت؛ لأنك ستكتشف في كل لحظة نعمًا تتوالد من رحم نعم، وخيراتٍ تتفجّر من أبوابٍ لم تنتبه إليها. حتى لفظ الآية جاء بصيغة المفرد: ﴿نِعْمَتَ ٱللَّهِ﴾، والمفسّرون قالوا: هو مفرد يراد به الجنس، أي مجموع النِّعم الظاهرة والباطنة، الدينية والدنيوية، الماضية والحاضرة والآتية.\n\nابن كثير يقول: “أي لو حاولتم إحصاء نعم الله عليكم ما قدرتم على ذلك ولا تطيقونه.” والطبري يقرر المعنى نفسه: “لا يقدر أحد أن يستوفي عَدَّ نعم الله لكثرتها وتجدّدها.” والقرطبي يوسّع الدائرة فيقول: “نعمه سبحانه على العباد لا تُعدّ ولا تُحصى: في أبدانهم وعقولهم وأديانهم وأرزاقهم، ظاهرةً وباطنةً.” والسعدي يلفت النظر إلى أن النفس تغفل عن أعظم النعم لأنها مألوفة: النفس الذي يدخل ويخرج بلا ثمن، نبض القلب الذي لا تستأذنه، ستر الله الذي يغشى العيوب، هداية الإيمان التي تُقيم الميزان في الداخل.\n\nتأمل يا عزيزي: كم نِعمة تجري الآن في جسدك لا تشعر بها؟ عين تبصر، أذن تسمع، قلب يخفق بانتظام، جهاز مناعة يحارب عنك دون أن تعلم، خلايا تُجدَّد، جِلْد يلتئم، عقل يربط بين الصور والمعاني. وكم نعمة في خارجك؟ أسرة تؤنسك، صديق يَصدُقك، رزق يأتيك من طريقٍ لم تَخُطّه قدماك، موقفٌ عصيبٌ نجّاك الله منه بسترٍ لا تدري كيف وقع. ثم فوق كل ذلك: نعمة الإسلام والقرآن، وهي أمّ النعم وسرّ النور؛ من دونها تصبح النعم الأخرى جسدًا بلا روح.\n\nولأن الإنسان ينسى، ختمت الآية بقوله: ﴿إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ﴾. وكأن المعنى: ستقصّرون في الشكر لا محالة، وستعجزون عن العدّ، وربما تنسون وتغفلون؛ فربّكم يغفر تقصيركم ويرحمكم باستبقاء النعم عليكم، بل ويزيدها إذا شكرتموه. جاء في آية أخرى: ﴿لَئِن شَكَرْتُم لَأَزِيدَنَّكُمْ﴾؛ فالشكر قَيْدُ النِّعم الموجودة وصَيْدُ النعمِ المفقودة، كما يقول ابن القيم.\n\nولـ“الشكر” في لغة القرآن ثلاثة أركان:\n\n1. شكر القلب: أن تعتقد أن كل نعمة من الله وحده لا من ذكائك ولا من حيلتك.\n\n\n2. شكر اللسان: أن تُكْثِر من الحمد، وأن تَحدِّث بنعمة ربك على وجه الخضوع لا الفخر؛ تذكر المنعِم لا نفسك.\n\n\n3. شكر الجوارح: أن تضع النعمة في موضعها؛ علمك في نفع الناس، مالك في الصدقة والإنفاق، قوتك في نصرة الضعيف، وجاهك في قضاء الحوائج. لذلك قيل: “اعملوا آل داود شُكْرًا”؛ فالشكر عمل قبل أن يكون قولًا.\n\n\n\nومن بديع المناسبة أن سورة النحل تُسمّى سورة النِّعم؛ تسرد من أولها إلى آخرها صورًا من عطايا الله: خلق الإنسان، تسخير الدواب، إنزال المطر، إنبات الزرع، تعاقب الليل والنهار، ثم ذروة النعمة: الوحي والهدى. وكأن هذه الآية تأتي بعد العرض الطويل لتقول لك: هذا غيض من فيض، ولو جلست عُمْرَك تعدّ، ما وفيتَ لله جزءًا من ألف.\n\nانظر إلى الحكمة النفسية في الآية: الإنسان حين ينغمس في عَدِّ ما فاته يزداد حزنًا، وحين يتفكّر في ما أُعطي يَسكن قلبه. الشكر يبدّل زاوية النظر: بدلاً من “لماذا حُرِمت؟” تصبح “كم أعطيت؟”؛ وبدلًا من “متى يأتي؟” تصبح “كيف أحافظ؟”. لهذا قال ﷺ: “إنَّ الله ليرضى عن العبد أن يأكل الأكلة فيحمده عليها، أو يشرب الشربة فيحمده عليها” (رواه مسلم). حمدٌ على لقمة ماء وغرفة ماء! فكيف بسَترِ الأيام وطولِ الأعوام؟\n\nوللشكر أثرٌ في زيادة البركة واتصال الإمداد. ما أكثر من شَكَر فازداد، ومن كَفَر بالنِّعمة فانتُزِعت منه وهو لا يشعر. وقد رأيت وسمعت كيف تُفتح أبواب لمَن علِم أن مفتاحها كلمة “الحمد لله”، وكيف تُغلق طرقٌ أمام من أَسْكَرَه الغرور وقال: إنما أوتيته على علمٍ عندي.\n\nيا عزيزي القارئ، اجعل لك عادةً تُقيِّد بها النِّعَم:\n\nفي الصباح والمساء، عُد ثلاث نِعَمٍ مخصوصة؛ اذكرها باسمها، واشكر الله عليها، واستحضر أثرها في يومك.\n\nاقصد بنعمتك وجه الله: إن رزقك علمًا فأنفقه، وإن رزقك مالًا فطهِّره بالزكاة والصدقة، وإن رزقك وقتًا فاملأه بما يرضيه.\n\nإذا رأيت نعمةً عند غيرك، فَقُل: “اللهم بارك لهم وارزقني”؛ فالشكر يطرد الحسد ويجلب المزيد.\n\nوإذ زللتَ أو قصّرتَ، فاذكر خاتمة الآية: ﴿إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ﴾؛ تُبْ، واعترف، واشكر؛ يغفرْ ويَرحمْ ويَزدْ.\n\n\nهذه الآية، يا عزيزي، ليست دعوةً إلى عدٍّ مستحيل، بل دعوةٌ إلى وعيٍ دائم: أن ترى يد الله في تفاصيل يومك. فإذا رأيتها، لانَ قلبك، واطمأنّت روحك، وسهُل عليك الشكر؛ وإذا شكرتَ، زادك ربّك من فضله. وهكذا تدور الرحى: نِعَمٌ تستجلب الشكر، وشكرٌ يستجلب مزيد النِّعَم، وربٌّ يغفر التقصير ويرحم الضعف. فهل بعد هذا يُترك القلبُ لليأس أو للغفلة؟",
      "english_content": "“And if you should count the favor of Allah, you could not enumerate them. Indeed, Allah is Forgiving and Merciful.” [An-Nahl: 18]\n\nMy dear reader, this verse takes your hand and places you before an endless ocean: the ocean of Allah’s blessings upon you. It tells you that if you were to try to count Allah’s favors, one by one, you would never be able to; because in every moment you would discover new blessings sprouting from old ones, and goodness flowing from doors you never even noticed. Even the expression in the verse is in the singular — “the favor of Allah” — and the scholars said this singular form refers to the entire category of blessings: visible and hidden, worldly and spiritual, past, present, and future.\n\nIbn Kathir says: “Meaning, if you tried to count Allah’s blessings upon you, you would never be able to, nor would you have the strength to do so.” Al-Tabari explains: “No one can fully count Allah’s favors due to their abundance and constant renewal.” Al-Qurtubi expands: “His blessings upon His servants cannot be counted: in their bodies, minds, religion, and provisions — outward and inward.” And Al-Sa’di reminds us that many of the greatest blessings pass unnoticed because they are so familiar: the breath that enters and exits without cost, the heartbeat that never asks permission, Allah’s veil that covers our faults, and the guidance of faith that keeps balance within the soul.\n\nReflect, my dear reader: how many blessings are flowing in your body right now without you realizing? Eyes that see, ears that hear, a heart that beats in rhythm, an immune system fighting for you in silence, cells renewing themselves, wounds healing, a mind that can connect ideas and meanings. And how many blessings outside you? Family who comfort you, a friend who is sincere, sustenance arriving through paths you never planned, crises that Allah rescued you from with a covering you didn’t notice. And above all of that: the blessing of Islam and the Qur’an — the mother of all blessings, the light that gives meaning to every other gift.\n\nAnd because human beings will always fall short in gratitude, the verse ends: “Indeed, Allah is Forgiving and Merciful.” As if to say: you will fail to give thanks fully, you will be unable to count, you may even forget and neglect; yet your Lord forgives your shortcomings, continues His mercy upon you, and keeps His favors flowing. In another verse He promises: “If you are grateful, I will surely increase you.” Gratitude, then, is the chain that binds blessings you already have, and the net that catches blessings yet to come, as Ibn al-Qayyim beautifully said.\n\nThe Qur’an shows us that gratitude has three parts:\n\n1. Gratitude of the heart: to believe firmly that every blessing is from Allah, not from your intelligence or effort.\n\n\n2. Gratitude of the tongue: to speak words of praise, to acknowledge Allah’s favors without arrogance or self-claim.\n\n\n3. Gratitude of the limbs: to use the blessing in obedience — knowledge in teaching, wealth in charity, strength in helping, status in serving. This is why Allah said: “Work, O family of David, in gratitude” — for true gratitude is action.\n\n\n\nNotice also the wisdom: people who focus only on what they’ve lost drown in sadness, but those who reflect on what they’ve been given find peace. Gratitude shifts your perspective from “Why was I deprived?” to “How much have I been given?” and from “When will more come?” to “How do I preserve what I have?” The Prophet ﷺ said: “Indeed, Allah is pleased with the servant who eats a bite of food and thanks Him for it, or drinks a sip of water and thanks Him for it.” (Muslim). If thanks for a single bite or sip brings Allah’s pleasure, then what about years of protection, rivers of mercy, and countless gifts you cannot number?\n\nMy dear reader, make gratitude a daily practice:\n\nEach morning and evening, name three blessings specifically, feel their impact, and thank Allah for them.\n\nUse your blessings for good: knowledge to benefit others, money to purify through charity, health to serve.\n\nWhen you see blessings in others, say: “O Allah, bless them and grant me as well” — gratitude expels envy and invites increase.\n\nAnd when you fall short, remember the closing: “Indeed, Allah is Forgiving and Merciful.” Return, admit, and thank — and He will forgive, have mercy, and give more.\n\n\nThis verse, my dear reader, is not really about counting blessings — for that is impossible — but about living in constant awareness of the Giver. If you live with that awareness, your heart softens, your soul rests, and gratitude becomes natural. And when you give thanks, Allah promises more. Thus the cycle continues: blessings bring gratitude, gratitude brings more blessings, and Allah forgives and has mercy when you fall short. Could the heart, after realizing this, ever remain in despair or forgetfulness?"
    },
    {
      "id": 9,
      "title": "الشرح ٥-٦ / Al-Inshirah 5-6",
      "verse_text": "﴿فَإِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا ٥ إِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا ٦﴾ [الشرح: ٥-٦]",
      "content": "عزيزي القارئ، هذه الآيتان من أعمق ما يلمس قلب المؤمن، كلمات قصيرة لكنها تحمل معاني من الأمل والتفاؤل واليقين ما يزيل جبال الهموم عن قلبك. الله جل جلاله يكرر الحقيقة نفسها مرتين في سطرين متتالين، ليغرسها في قلبك فلا تشك فيها أبدًا: مع العسر يسر، بل إن العسر لا يأتي أبدًا إلا وهو مشدود برباط مع اليسر، كأنهما توأمان لا يفترقان.\n\nابن كثير رحمه الله قال: \"أي لن يغلب عسر يسرين\"، وأصلها ما رواه النبي ﷺ: «لن يغلب عسر يسرين»، أي أن الله يذكر العسر معرفًا بالألف واللام مرتين، فهو عسر واحد، بينما جاء \"يسرًا\" منكرًا مرتين، فهما يسران مختلفان. كأن الله يقول لك: مشقة واحدة سيتبعها يسران، ضيق واحد محاط بفسحتين. الطبري يفسرها بأن الله يعد المؤمن أن كل عسر لا بد أن يعقبه يسر عاجل أو آجل، في الدنيا أو في الآخرة. أما القرطبي فيضيف: \"في هذه الآية بشارة عظيمة، فما من شدة إلا ولها نهاية، وما من ضيق إلا ويفتح الله بعده بابًا من الفرج\".\n\nتأمل يا عزيزي القارئ هذا التكرار: ﴿فَإِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا﴾، ﴿إِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا﴾. التكرار هنا ليس تزيينًا بل تثبيتًا، كما يُقال للإنسان المرهق: اصبر، الفرج قريب، ثم يعاد عليه مرة أخرى: اصبر، الفرج قريب. والمعنى أن الله لا يرسل العسر منفردًا، بل يجعله دائمًا محاطًا باليسر. ولهذا قال بعض السلف: \"لو دخل العسر في جحر، لدخل عليه اليسر حتى يخرجه\".\n\nالآيات نزلت في سياق تطييب قلب النبي ﷺ بعد ما واجه من تكذيب قومه وثقل الرسالة وضيق صدره، فالله سبحانه يذكّره ويذكّرنا معه: إن المشاق ليست نهاية الطريق، بل هي جسور إلى الفرج. ألم يخرج النبي ﷺ من شعب أبي طالب بعد ثلاث سنين من الحصار والجوع إلى فتح مكة بعد سنوات؟ ألم يُخرج يوسف عليه السلام من الجب والسجن إلى عرش مصر؟ ألم يُغلق البحر أمام موسى ثم ينشق في لحظة فرج عجيب؟ كلها شواهد حيّة أن مع العسر يسرًا.\n\nوهنا درس مهم: أن اليسر ليس فقط شيئًا يأتي بعد العسر، بل هو يصاحبه، مع العسر يسر. ربما لا تراه بعينك في لحظته، لكن الله يجعل في قلبك سكينة، في رزقك بركة، في ألمك حكمة، في دموعك طهارة. فالعسر نفسه يجر بين طياته بذور اليسر.\n\nومن لطائف العلماء أنهم قالوا: العسر يعرف بالشدائد، واليسر يعرف برؤية فضل الله فيها. فإذا استشعرت أن الله معك في بلائك، صار البلاء نفسه يسرًا. ولهذا قال النبي ﷺ: «واعلم أن النصر مع الصبر، وأن الفرج مع الكرب، وأن مع العسر يسرًا» (رواه أحمد والترمذي).\n\nعزيزي القارئ، إذا أثقلت قلبك هموم الدنيا وضاقت بك الطرق، فضع هذه الآية أمام عينيك: ﴿إِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا﴾. لا تحسب أن الضيق دائم، ولا تظن أن الألم نهاية المطاف. الأيام تدور، والله يقلبها بين ليل ونهار، عسرك اليوم بداية يسرك غدًا، ودمعتك اليوم بذرة ابتسامتك غدًا. هذه ليست كلمات مواساة بشر، بل وعد رب البشر.\n\nفالآيتان تحملان رسالة صريحة: ثق بربك، اصبر على قضاءه، لا تيأس ولا تستعجل، فإن الذي قدّر العسر هو نفسه الذي ربط به اليسر. ومن كان الله وليّه فلا بد أن يرى الفرج عاجلًا أو آجلًا.",
      "english_content": "\"For indeed, with hardship [will be] ease (5) Indeed, with hardship [will be] ease (6)\". [Al-Inshirah: 5-6]\n\n\nMy dear reader, these two short verses carry a treasure of comfort that can lift the heaviest burdens off a weary heart. Allah, the Most Merciful, repeats the same truth twice in succession, not for ornament but for emphasis: with hardship comes ease, with hardship comes ease. It is as if He is engraving this reality deep inside your heart so that you never doubt it—hardship will never arrive alone; it always walks hand in hand with relief.\n\nIbn Kathir explained: “No single hardship will ever overpower two eases.” He referenced the Prophet’s ﷺ saying: “One hardship shall never overcome two eases.” Notice how “hardship” is mentioned with “al” (definite article) both times—it’s the same hardship. But “ease” is repeated in an indefinite form, meaning it’s two separate eases. One hardship, two eases surrounding it. Al-Tabari adds: every difficulty carries with it relief either sooner or later, in this world or in the Hereafter. Al-Qurtubi says: “This is a great glad tidings: no trial is permanent, no distress is forever, for Allah has decreed that ease must always follow difficulty.”\n\nReflect, dear reader, on how Allah repeats: “Indeed, with hardship comes ease. Indeed, with hardship comes ease.” This repetition is a divine reassurance. Like someone holding your hand in the darkest tunnel, whispering not once but twice: “Don’t worry, light is near, relief is near.” And indeed, the Companions said: “If hardship entered a hole, ease would follow it until it comes out.”\n\nThese verses were revealed to console the Prophet ﷺ after the heavy weight of rejection and hardship he bore in his mission. They remind him—and us—that hardship is not the end of the road but a bridge to victory. Did not the Prophet ﷺ emerge from the three years of boycott in the valley of Abu Talib into eventual triumph? Did not Yusuf (Joseph) come out from the well and the prison into the throne of Egypt? Did not the sea close before Moses only to split in miraculous deliverance? Every story testifies: with hardship comes ease.\n\nAnd here lies a subtle point: Allah did not say “after hardship” comes ease. He said “with hardship”. Meaning the relief is bound to the struggle, growing within it, though you might not see it yet. Sometimes the ease is inner—patience, strength, tranquility. Sometimes it is outer—open doors, solutions, blessings. But it is always there, carried inside the folds of the trial.\n\nThe Prophet ﷺ summarized this truth beautifully: “Know that victory comes with patience, relief comes with distress, and with hardship comes ease.” (Ahmad, al-Tirmidhi).\n\nSo, my dear reader, when sorrow weighs you down and life feels suffocating, remember these verses as Allah’s personal promise to you: With hardship comes ease. With hardship comes ease. Not once, but twice. Not to fill the page, but to fill your heart with certainty. Let this promise carry you through the storm until you see the dawn."
    },
    {
      "id": 10,
      "title": "إبراهيم ٧ / Ibrahim 7",
      "verse_text": "يقول الله تعالى: ﴿وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَئِن شَكَرۡتُمۡ لَأَزِيدَنَّكُمۡ وَلَئِن كَفَرۡتُمۡ إِنَّ عَذَابِي لَشَدِيدٞ﴾ [إبراهيم: ٧]",
      "content": "يا عزيزي القارئ، هذه الآية العظيمة تكشف لك سُنّة من سنن الله التي لا تتبدل ولا تتحول، سُنّة قائمة على الشكر والجحود. الله عز وجل يخاطب عباده بخطاب يملؤه الوعد والوعيد في نفس الوقت، ليقيم الحجة على القلوب ويضعها بين طريقين: طريق الامتنان والاعتراف بالنعمة، أو طريق الغفلة والجحود.\n\nابن كثير قال: “أي: أعلن ربكم وأعلم أنه لو شكرتموه على نعمه لأدامها عليكم وزادكم من فضله، وإن كفرتموها وسلبتم حقها، فإن عذابه شديد.” والطبري ذكر: “الشكر هنا هو العمل بالطاعة، لا مجرد القول، فمن استعمل نعمة الله في مرضاته فقد شكرها، ومن استعملها في معصيته فقد كفرها.” أما القرطبي فأكد: “هذه الآية أصل في وجوب الشكر على النعم، وأن الزيادة مقرونة بالشكر.”\n\nتأمل يا قارئي الحبيب: الله لا يطلب منك المستحيل، لا يريد منك أن تجلب رزقك بنفسك ولا أن تدفع الضر عنك بقوتك، بل يريد منك شيئًا بسيطًا لكنه عظيم: أن تعترف بنعمته وتشكره. شكر باللسان: “الحمد لله”، شكر بالقلب: أن ترى الفضل من الله لا من نفسك، وشكر بالجوارح: أن تستعمل النعمة في طاعته لا في معصيته.\n\nوالشكر مفتاح للزيادة، ليس زيادة في المال فقط، بل زيادة في الطمأنينة، في البركة، في القوة، في العلم، في الهداية. وربك وعد: “لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ”. وعد من ملك الملوك الذي لا يخلف وعده. وقد قال علي بن أبي طالب رضي الله عنه: “اذكروا النعم بالشكر، يزدكم الله من فضله.”\n\nثم يأتي المقابل: “وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ”. أي: إن جحدتم النعمة واستعملتموها في معصية، فإن عذاب الله شديد، ليس في الدنيا فقط، بل في الآخرة أعظم. وهنا يظهر العدل الإلهي: الشكر يجلب مزيدًا من الخير، والجحود يجلب العقوبة.\n\nيا عزيزي القارئ، اجعل هذه الآية شعار حياتك: كلما رأيت نعمة، قل: “الحمد لله”، وكلما استعملت نعمة، سل نفسك: “هل أستعملها فيما يرضي الله؟” واعلم أن الشكر ليس لحاجة الله، فهو الغني عنك، لكنه لحاجتك أنت، لأن الشكر يحفظ قلبك من الغرور، ولسانك من السخط، ويدك من الظلم، وروحك من القسوة.\n\nهذه الآية، ببساطتها، تضع بين يديك طريق السعادة في الدنيا والآخرة: أن تكون عبدًا شاكرًا، يزداد فضل الله عليه يومًا بعد يوم.",
      "english_content": "“And [remember] when your Lord proclaimed, ‘If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.’” [Ibrahim: 7]\n\nMy dear reader, this verse reveals to you one of the unchanging laws of Allah: the law of gratitude and ingratitude. Allah places the human heart between two paths—one that leads to more blessings, peace, and guidance, and one that leads to loss, hardness, and punishment.\n\nIbn Kathir explains: “That is, your Lord has declared that if you give thanks for His favors, He will grant you more of them, and if you deny them, He will punish you with a severe punishment.” Al-Tabari comments: “Gratitude here means obedience through deeds, not words alone. Whoever uses Allah’s blessings in His obedience has truly thanked Him, while whoever uses them in sin has denied them.” Al-Qurtubi adds: “This verse is foundational in proving that gratitude for blessings is obligatory, and that increase is tied to gratitude.”\n\nThink deeply, dear reader: Allah does not ask you for the impossible. He does not require you to provide your own sustenance or defend yourself with your own strength. He only asks something simple yet profound: that you acknowledge His blessings and thank Him. Gratitude with the tongue—by saying alhamdulillah (praise be to Allah). Gratitude with the heart—by knowing the favor is from Him, not from yourself. Gratitude with the limbs—by using the blessing in obedience, not in disobedience.\n\nAnd gratitude is the key to increase. Not only an increase in wealth, but also in tranquility, in blessing, in strength, in knowledge, and in guidance. For your Lord promised: “If you are grateful, I will surely increase you.” A promise from the King of kings, who never breaks His word. Ali ibn Abi Talib, may Allah be pleased with him, said: “Remember the blessings with gratitude, and Allah will increase you from His bounty.”\n\nBut on the other side, Allah warns: “But if you deny, indeed, My punishment is severe.” Denial here is not just verbal denial—it is to misuse the blessings, to act arrogantly, to turn away from Allah. Such a heart invites Allah’s punishment, both in this world and in the Hereafter.\n\nMy dear reader, let this verse be a life principle for you: whenever you see a blessing, say alhamdulillah. Whenever you use a blessing, ask yourself: Am I using this in a way that pleases Allah? Gratitude is not for Allah’s need—He is free of all needs—but for your own. Gratitude purifies your heart from arrogance, your tongue from complaint, your hand from injustice, and your soul from hardness.\n\nIn this single verse lies the key to happiness in this world and salvation in the next: be a thankful servant, and Allah will pour upon you blessings you never imagined."
    },
    {
      "id": 11,
      "title": "لقمان ١٦ / Luqman 16",
      "verse_text": "يقول الله تعالى: ﴿يَا بُنَيَّ إِنَّهَا إِن تَكُ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ فَتَكُن فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الأَرْضِ يَأْتِ بِهَا اللَّهُ ۚ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ﴾ [لقمان: ١٦]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية العظيمة جاءت في وصايا لقمان الحكيم لابنه، لتكون دستورًا يعلّم الأجيال أن الله سبحانه وتعالى مُطّلع على كل شيء، يعلم السر وأخفى، وأنه لا يغيب عن علمه مثقال ذرة.\n\nلقمان يخاطب ابنه بلطف ورحمة: ﴿يَا بُنَيَّ﴾، نداء الأب الحاني، الذي يريد الخير لولده، ليغرس في قلبه الوعي العميق بالله. ثم يضرب له مثلاً يقرب الفهم: لو أن هناك حبة صغيرة جدًا، مثقال خردل، لا تُرى بالعين المجردة، وكانت في داخل صخرة صماء، أو كانت مبعثرة في أرجاء السماوات الشاسعة، أو في أعماق الأرض المظلمة، فإن الله يأتي بها يوم القيامة ويحاسب عليها. لا يغيب عنه شيء، لا في الكون، ولا في خفايا النفس.\n\nابن كثير قال: “أي لو أن الأعمال التي يعملها العبد من خير أو شر بقدر حبة خردل، لجازاه الله بها.” والطبري قال: “معناه: لا يضيع الله شيئًا وإن صغر.” والقرطبي ذكر: “هذا تحذير من المعاصي وترغيب في الطاعات، فإن الله لا يخفى عليه شيء.” والسعدي لخص المعنى بقوله: “فلا يحتقر العبد من الأعمال شيئًا، فإن الله لا يخفى عليه مثقال ذرة.”\n\nيا عزيزي القارئ، هذه الآية تزرع في قلبك يقظة ومراقبة. فلا تظنن أن كلمة جارحة خرجت منك، أو نظرة خاطئة، أو ظلم صغير لن يُحسب. كما لا تظنن أن صدقة خفية، أو كلمة طيبة، أو دمعة من خشية الله ستضيع. كل شيء عند الله محفوظ، صغيرًا كان أو كبيرًا.\n\nومن تأملها استراح قلبه؛ لأنه يعلم أن الله عادل. ربما تعمل خيرًا ولا يراك أحد، لكن الله يراك. ربما تُظلم ولا تجد من ينصفك، لكن الله لن يترك حقك. ربما تحزن أن جهدك لا يُقدَّر عند الناس، لكن الله لا ينسى مثقال حبة خردل.\n\nهذه الآية رسالة عميقة: راقب نفسك، فالله مطلع عليك حيث لا يراك أحد، واحذر من صغائر الذنوب قبل كبائرها. وفي الوقت نفسه، لا تحقر من الخير شيئًا، فرب كلمة صادقة أو ابتسامة خالصة تكون أثقل عند الله من أعمال كثيرة.\n\nوكأن لقمان يهمس في أذن ولده – وفي أذنك أنت: يا بُني، عش وأنت على يقين أن الله يراك، يعلم كل خفاياك، ويحاسبك بعدله، ويجزيك بفضله. فاجعل حياتك كلها عملًا صالحًا، صغيرًا كان أو كبيرًا، فالله لطيف خبير، لا يغيب عنه شيء، ولا يضيع عنده شيء.",
      "english_content": "“O my son, indeed if it should be the weight of a mustard seed and it should be within a rock or [anywhere] in the heavens or in the earth, Allah will bring it forth. Indeed, Allah is Subtle and Acquainted.” [Luqman: 16]\n\nListen, my dear reader, this verse carries one of the most profound reminders in the Qur’an. It is part of the wise counsel of Luqman to his son, and through it Allah is teaching us all. Luqman speaks to his child with tenderness: “O my son”—a father’s gentle call filled with mercy and concern. He wants to plant in his son’s heart an awareness so deep that it shapes his entire life: the awareness that Allah sees everything, no matter how small, no matter where it is hidden.\n\nAllah gives an example: even if there were something as tiny as the weight of a mustard seed—so small that the human eye can barely see it—and it were lodged deep inside a rock, or scattered in the endless skies, or buried beneath the earth, Allah would bring it forth on the Day of Judgment. Nothing escapes Him, not a whisper of thought, not the smallest deed.\n\nIbn Kathir explains: “If a deed were as small as a mustard seed, Allah would recompense it.” Al-Tabari adds: “Nothing is lost with Allah, no matter how small.” Al-Qurtubi emphasizes: “This verse is a warning against sins and an encouragement for good deeds, for Allah overlooks nothing.” And Al-Sa‘di beautifully summarizes: “So do not belittle any deed, whether good or evil, for Allah will account for it.”\n\nMy dear reader, pause here and reflect. This verse teaches you that nothing in your life is overlooked. Perhaps you offered a smile to someone in distress, whispered a kind prayer for someone in need, or shed a quiet tear in the night out of fear of Allah. Maybe no one saw it, maybe no one valued it—but Allah did. And He will bring it forth, preserved, magnified, and turned into light for you on the Day of Judgment.\n\nAt the same time, it warns: never underestimate a small sin. A careless word, a fleeting glance, a hidden act of dishonesty—it is all recorded. Just as no act of goodness is lost, no act of wrongdoing disappears.\n\nThis verse, then, is a double-edged reminder: to fill your days with goodness, no matter how small, and to guard yourself even from minor slips, because Allah is Latif (Subtle) in His knowledge, perceiving what others cannot, and Khabeer (All-Acquainted) with everything hidden and apparent.\n\nIt is as though Luqman whispers not just to his son, but to you: live with the certainty that Allah sees you where no one else does. Let that certainty comfort you when you feel unrecognized in your efforts, and let it restrain you when you are tempted to sin in secret. For nothing is too small for Allah, and nothing is ever lost with Him."
    },
    {
      "id": 12,
      "title": "الأعلى ١٦-١٧ / Al-A‘la 16-17",
      "verse_text": "يقول الله تعالى: ﴿بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (١٦) وَالآخِرَةُ خَيْرٌ وَأَبْقَىٰ (١٧)﴾ [الأعلى: ١٦-١٧]",
      "content": "اسمع يا عزيزي القارئ، هذه الآيتان من سورة الأعلى تأتي لتضع بين يديك ميزانًا عجيبًا يكشف لك سرّ الصراع داخل قلبك: أيهما تُقدِّم؟ الدنيا أم الآخرة؟ يقول الله: ﴿بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا﴾، كأنها صرخة عتاب للإنسان، تُعرّي اختياره المتكرر أن يُقدّم الدنيا على الآخرة. كلمة \"تؤثرون\" تحمل معنى التفضيل والاختيار المتعمد، وكأن الله يخبرك: مشكلتكم أنكم تعطون الدنيا وزينتها الأولوية على حساب ما هو أبقى.\n\nلكن مباشرة يأتي التصحيح: ﴿وَالآخِرَةُ خَيْرٌ وَأَبْقَىٰ﴾. هنا يُرسم المشهد الحقيقي، أن الآخرة خير في نوعها، وأبقى في مدتها. خير لأنها متاع لا ينقطع، ولذة لا تنغّصها كدر، وسعادة لا يفسدها خوف الزوال. وأبقى لأنها أبدية لا تنتهي. بينما الدنيا مهما زُخرفت فهي فانية، قصيرة، مليئة بالمشقة والمنغصات.\n\nابن كثير يقول: “أي تختارون الدنيا على الآخرة، وأنتم تعلمون أن الآخرة خير وأبقى.” والطبري يفسر: “خير من الدنيا وأبقى ثوابًا ودوامًا.” والقرطبي يضيف: “الآخرة خالصة دائمة، والدنيا منقطعة زائلة.” والسعدي يلخص: “هذا هو مقتضى العقل: أن يؤثر العاقل ما هو خير وأبقى على ما هو أدنى وأفنى.”\n\nتأمل يا عزيزي القارئ، كيف أن الآيتين تخاطبان قلبك مباشرة: ما الذي يشدك في الدنيا فتؤثرها؟ مالٌ يتبخر، لذة تزول، مكانة تتغير، صحة تضمحل. كل شيء فيها مؤقت. بينما الآخرة تعرض عليك سعادة لا تنقطع، ونعيمًا لا يُخشى فناؤه. ومع ذلك، كم مرة نجد أنفسنا نركض وراء الدنيا كأنها الغاية!\n\nهذه الآيات ليست مجرد عتاب، بل هي دعوة للتصحيح. كأنها تقول لك: قف واسأل نفسك، ماذا تؤثر؟ ماذا تختار في قراراتك اليومية، في لحظة شهوة أو معصية، في ساعة عبادة أو تقصير؟ تذكّر أن كل اختيار صغير هو انعكاس لما تُؤثر: الدنيا أم الآخرة.\n\nولعل أجمل ما في الآيتين أنهما تكشفان لنا حب الله لعباده، لأنه لا يرضى أن تراهن حياتك على شيء زائل، بل يريد لك ما هو خير وأبقى. فالآيات دعوة للوعي، دعوة لتعيد ترتيب أولوياتك، دعوة أن تجعل الآخرة هي الهدف الأكبر، وتتعامل مع الدنيا على أنها معبر، لا دار إقامة.\n\nفتأمل يا عزيزي القارئ: من الحكمة أن تختار الأبقى على الفاني، ومن العقل أن تقدم الخير الذي لا ينقطع على المتاع الذي يذبل. وهكذا تكشف لك هاتان الآيتان حقيقة الوجود كله: أنك إما أن تُؤثر حياةً قصيرةً زائلة، أو حياةً خالدةً باقية، والاختيار بين يديك كل يوم.",
      "english_content": "“But you prefer the worldly life (16) While the Hereafter is better and more enduring.\" (17) [Al-A‘la: 16-17]\n\nListen, dear reader, these two verses from Surah Al-A‘la place before you a profound balance that reveals the secret struggle within the human heart: which do you prioritize—this world or the Hereafter? Allah says: “But you prefer the worldly life”—a gentle but piercing rebuke, exposing the human tendency to give priority to temporary pleasures over eternal gain. The word “prefer” implies a conscious choice, as though Allah is saying: your problem is that you knowingly choose what fades over what lasts.\n\nThen comes the divine correction: “While the Hereafter is better and more enduring.” Here the reality is laid bare. The Hereafter is better in quality—pure bliss, untouched by sorrow, unspoiled by fear of loss—and more enduring in duration, eternal and unending. The world, no matter how glittering, is fleeting, fragile, and riddled with hardship.\n\nIbn Kathir explains: “You choose the world over the Hereafter, even though the Hereafter is better and more lasting.” Al-Tabari adds: “It is better in reward and everlasting in duration.” Al-Qurtubi states: “The Hereafter is pure and eternal, while the world is temporary and vanishing.” And Al-Sa‘di summarizes: “Reason itself dictates that a wise person prefers what is better and more enduring over what is lesser and fading.”\n\nReflect, dear reader, how directly these verses speak to you. What is it in this life that makes you prefer it? Wealth that slips away, pleasures that fade, status that shifts, health that declines—everything in it is temporary. And yet, how often do we chase after the fleeting as though it were the goal? Meanwhile, the Hereafter offers happiness that never ends and joy that is never threatened.\n\nThese verses are not just a rebuke—they are an invitation. It is as though Allah is saying: pause, re-examine your choices. Each small decision in your daily life—whether in moments of desire, sin, worship, or discipline—reveals which you are preferring: the world or the Hereafter.\n\nAnd perhaps the most beautiful truth here is that Allah is showing His mercy. He doesn’t want you to gamble your life on something that will vanish, but rather to secure what is everlasting and infinitely better. The verses call you to wisdom, to reorder your priorities, to treat this world as a passage—not a destination.\n\nSo think, dear reader: wisdom is in choosing the enduring over the fleeting, and reason is in valuing what is everlasting over what perishes. These two verses lay bare the essence of existence: every day, you are choosing between a temporary life and an eternal one. The decision is yours."
    },
    {
      "id": 13,
      "title": "البقرة ٢٨٦ / Al-Baqarah 286",
      "verse_text": "يقول الله تعالى: ﴿لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ﴾",
      "content": "اسمع يا عزيزي القارئ، هذه الآية الكريمة من أعظم ما يسكب في قلبك الطمأنينة والراحة، فهي تضع قاعدة من قواعد الرحمة الإلهية التي لا تتغير: الله عز وجل لا يكلّفك بما يفوق طاقتك، ولا يفرض عليك ما لا تستطيع احتماله. كم مرة شعرت أن الأعباء أكبر منك؟ كم مرة غلبك شعور أنك لن تستطيع القيام بما طُلب منك؟ هنا يأتي الجواب من الله بنفسه: لا تقلق، ما دام التكليف جاء مني، فهو بالضرورة في حدود قدرتك.\n\nالآية ليست مجرد جملة، بل وعد رباني يرافقك في كل لحظة. كل أمرٍ فرضه الله، من صلاة وصيام وزكاة وحج، كل ابتلاء قدّره عليك من مصائب وأقدار، كلها وُضعت في نطاق \"وسعك\". وهذا \"الوسع\" ليس كما يراه الناس، بل كما يعرفه خالقك، المطلع على قلبك وقوتك وضعفك. فهو يعلم حدودك أكثر مما تعلمها أنت.\n\nابن كثير رحمه الله قال: \"أي لا يكلّف أحدًا فوق طاقته من فرائضه، بل بما يسّره وسهّله عليه، فلا يكلفهم ما لا يطيقون.\" والطبري قال: \"وسعها: طاقتها وما تحتمله.\" والقرطبي فسّرها فقال: \"هذه أرجى آية في كتاب الله، فيها بيان أن التكليف أبداً يكون بما يمكن أداؤه، وأن الحرج مرفوع.\" والسعدي قال: \"هذا من لطفه بعباده ورحمته بهم، فإنه لا يكلّفهم بما يشق عليهم مشقة خارجة عن طاقتهم.\"\n\nتأمل، يا عزيزي القارئ، كم تنسف هذه الآية كل شعور باليأس أو العجز أمام الدين أو أمام الابتلاءات. إذا أمرك الله بالصلاة خمس مرات، فهذا يعني أنك قادر. إذا أمرك بالصيام، فأنت تستطيع. إذا ابتلاك بفقد، أو مرض، أو همّ، أو ضيق رزق، فهو يعلم أن في داخلك قوة كافية لتجاوز ذلك. قد تظن أن قلبك سينكسر، لكنه يعلم أن قلبك سيلتئم به. قد تظن أن ظهرك سينحني، لكنه يعلم أن لديك ما يعينك على النهوض.\n\nولذلك كان السلف يعتبرون هذه الآية من أعظم آيات التسلية. يقولون: إن العبد لو تدبرها كفته ليطمئن أن رحمة الله سابقة على تكليفه. بل إن رسول الله ﷺ علّمنا أن ندعو في ختام هذه السورة العظيمة بالدعاء الذي يلي هذه الآية، حيث قال الله بعد ذكرها: ﴿رَبَّنَا لَا تُؤَاخِذۡنَا إِن نَّسِينَا أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَـٰفِرِينَ﴾.\n\nفكأن الله حين قال: ﴿لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَا﴾، أراد أن يهيئ قلبك لهذا الدعاء العظيم، ليؤكد لك أن رحمته لا تتركك أبدًا.\n\nتخيل، يا عزيزي القارئ، أنك تسير في طريق الحياة مثقلًا بالهموم، ثم يأتيك صوت ربك بهذا الوعد: \"لن أضع على ظهرك حملًا لا تستطيع حمله\". أي رحمة أوسع من هذا؟ أي حب أعظم من أن يراعي خالقك ضعفك ويقول لك: ما فرضته عليك، ما ابتليتك به، كله بميزان قدرتك.\n\nهذه الآية، إن استقرت في قلبك، بدّلت حزنك صبرًا، وخوفك ثقة، وشعورك بالضعف يقينًا أنك قوي بالله. إنها ليست آية عادية، بل رسالة تطمين إلهية: لا تيأس، لا تنهزم، لا تقل \"لا أستطيع\". لأن الله قد قال لك: \"أنت تستطيع، أنا أعلمك وأعلم قدرتك، ولن أكلّفك بما فوقها\".",
      "english_content": "“Allah does not burden a soul beyond its capacity.” [Al-Baqarah: 286]\n\nDear reader, this verse is one of the most comforting and hope-giving promises in the entire Qur’an. It lays down an unshakable principle of divine mercy: Allah will never place upon you a burden greater than what you can bear. Not in worship, not in trials, not in life itself.\n\nHow many times have you felt that the weight of your struggles was too heavy, that you could not continue? Here is Allah’s answer: if I decreed it, then you are capable of carrying it. And this capacity is not measured by what others think of you, nor even by what you assume of yourself. It is measured by the One who created you, who knows the deepest corners of your soul, your strengths, and your breaking points. He knows you better than you know yourself.\n\nIbn Kathir said: “This means Allah does not command a soul with what it cannot bear of obligations, but only what is within its ability and ease.” Al-Tabari explained: “Its capacity: what it can endure and sustain.” Al-Qurtubi called this “the most hopeful verse in the Qur’an,” because it proves that every obligation and every trial is always within reach of the believer. And As-Sa‘di said: “This is of Allah’s kindness to His servants and His mercy upon them, for He does not burden them with what would break them.”\n\nReflect, dear reader: this single line sweeps away despair. Your prayers, your fasting, your charity, your patience in hardship, none of it is beyond you. If He commanded you, you can do it. If He tested you, He already placed within you the strength to endure. You may think your heart will shatter, but He knows it will heal through Him. You may think your back will collapse, but He knows you can stand because He supports you.\n\nThe companions used to take this verse as one of the greatest consolations. They understood that Allah’s mercy precedes His command. And after this verse, Allah Himself taught us the famous supplication: “Our Lord, do not take us to account if we forget or fall into error. Our Lord, do not place upon us burdens like those You placed upon those before us. Our Lord, do not impose upon us what we cannot bear. Pardon us, forgive us, have mercy on us. You are our Protector, so grant us victory over the disbelieving people.”\n\nCan you feel the harmony? Allah assures you: I will not burden you beyond your capacity. Then He teaches you to ask: O Allah, do not place upon us what we cannot bear. And He responds: I have done so.\n\nImagine walking through life overwhelmed, and suddenly your Lord whispers into your heart: “I will never give you more than you can carry.” What mercy could be greater? What love could be deeper?\n\nThis verse, if it takes root in your heart, will transform your grief into patience, your weakness into strength, and your fear into trust. It is not simply a rule of divine law—it is a personal reassurance, a gentle hand on your shoulder: “Do not give up. Do not say ‘I can’t.’ You can, because I, your Lord, know your measure, and I will never burden you beyond it.”"
    },
    {
      "id": 14,
      "title": "المائدة ٨ / Al-Ma’idah 8",
      "verse_text": "يقول الله تعالى: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ﴾ [المائدة: ٨]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية من أعظم الآيات التي ترسم لك ملامح الرسالة الإلهية في التعامل مع الناس، سواء كانوا مؤمنين أو مخالفين لك في الدين أو حتى أعداءك. الله يخاطبك مباشرة: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ﴾، أي يا من رضيتم بالله ربًا وبالإسلام دينًا وبمحمد ﷺ نبيًا، كونوا قوّامين لله، أي قوموا بالحق خالصًا لوجهه، لا تميلوا لمصلحة أو هوى أو عصبية.\n\nثم يحدد لك المنهج: ﴿شُهَدَآءَ بِٱلۡقِسۡطِ﴾، أي كونوا شهداء بالعدل، تقولوا الحق ولو على أنفسكم وأقرب الناس إليكم. لا تجاملوا، ولا تظلموا، ولا تتركوا كلمة الحق تسقط من ألسنتكم خوفًا من أحد. العدل هنا ليس خيارًا، بل عبادة تتقرب بها إلى الله.\n\nويأتي التحذير العظيم: ﴿وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْ﴾. قد يظلمك قوم، قد يعادونك، قد يؤذونك، وهنا قد يدفعك الغضب والانتقام إلى أن تظلمهم. لكن الله يقول لك: لا، لا تجعل كرهك لهم يحرفك عن العدل. العدل واجب حتى مع من تكره، حتى مع من عادا الدين. قال ابن كثير: “أي لا يحملنكم بغض قوم على ترك العدل فيهم، بل استعملوا العدل في كل أحد.”\n\nثم يلخص المبدأ: ﴿ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰ﴾. يعني أن العدل ليس مجرد سلوك اجتماعي، بل هو طريقك إلى التقوى. كلما حكمت بالعدل، اقتربت من الله، وكلما ظلمت ابتعدت عنه. وقال السعدي: “فالعدل في الأعداء والمبغضين أقرب إلى خشية الله، لأنه يجاهد نفسه.”\n\nثم ختم الآية بتذكير يهز القلب: ﴿وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ﴾. أي مهما خفي على الناس ميل قلبك أو ظلمك، فإن الله خبير مطلع على أعمالك، يعلم خفايا نيتك وبواطن نفسك.\n\nفتأمل يا عزيزي القارئ، هذه ليست مجرد آية عن الحكم أو القضاء، بل رسالة لك في حياتك اليومية: في خلافاتك العائلية، في معاملاتك التجارية، في جدالاتك مع من يكرهك. قد يدفعك الحزن أو الغضب إلى أن تظلم، لكن الله يناديك: اعدل، فهو أقرب للتقوى.\n\nوهنا يظهر جمال الإسلام: دينك لا يطلب منك فقط أن تصلي وتصوم، بل أن تكون إنسانًا عادلًا رحيمًا، لا ينحرف قلبك عن الحق بسبب الكراهية. هذا هو ميزان الرسالة، وهذه هي الأخلاق التي تجعل المؤمن نورًا بين الناس.",
      "english_content": "“O you who have believed, be persistently standing firm for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness. And fear Allah; indeed, Allah is Acquainted with what you do.” [Al-Ma’idah: 8]\n\n\nDear reader, this verse is one of the greatest verses that outline for you the essence of the divine message in dealing with people—whether they are fellow believers, those who differ from you in faith, or even your enemies. Allah addresses you directly: “O you who have believed.” This is a call of honor, reminding you that you belong to Him. He then commands: “Be persistently standing firm for Allah.” That means, stand up for the truth sincerely for His sake, not swayed by desires, bias, or worldly interests.\n\nThen He lays down the method: “Witnesses in justice.” That is, your duty is to bear witness to the truth with fairness, even if it is against yourself, your family, or those you love. Justice is not a matter of convenience; it is an act of worship, a testimony that you are truly faithful to Allah.\n\nThen comes the powerful warning: “And do not let the hatred of a people prevent you from being just.” It is easy to be just with friends, but true faith is tested when you deal with those who oppose you or harm you. Anger, grief, or revenge may tempt you to injustice, but Allah says: Do not. Justice is owed to everyone—even those you dislike. Ibn Kathir said: “Do not let your enmity against a people lead you to abandon justice; rather, uphold justice with all.”\n\nThen Allah summarizes: “Be just; that is nearer to righteousness.” Justice is not only a social value; it is the heart of piety. Every act of justice draws you nearer to Allah, and every act of injustice distances you from Him. As As-Sa‘di explained: “Justice with enemies and those you dislike is closer to the fear of Allah, for it requires struggling against one’s own soul.”\n\nFinally, the verse closes with a reminder that pierces the heart: “And fear Allah; indeed, Allah is Acquainted with what you do.” People may never know your hidden intentions or the bias in your judgment, but Allah does. He knows when you bent the scale even slightly, when your tongue twisted the truth, when your heart leaned away from fairness. Nothing escapes Him.\n\nSo reflect, dear reader. This verse is not only about judges in courts or rulers in power—it is about you, every day of your life. In your arguments, in your family disputes, in your business dealings, even in your inner thoughts toward those who wrong you. Islam calls you not just to pray and fast, but to rise above yourself and uphold justice, because justice is the path to Allah.\n\nThis is the beauty of the message: your faith is not complete until you can treat even your enemy with fairness. And that, truly, is the closest path to righteousness."
    },
    {
      "id": 15,
      "title": "النحل ٩ / An-Nahl 9",
      "verse_text": "يقول الله تعالى: ﴿وَعَلَى ٱللَّهِ قَصْدُ ٱلسَّبِيلِ وَمِنْهَا جَآئِرٌۚ وَلَوْ شَآءَ لَهَدَىٰكُمْ أَجْمَعِينَ﴾ [النحل: ٩]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية تكشف لك عن جوهر الرسالة، وعن سر وجودك في هذه الدنيا. الله يقول: ﴿وَعَلَى ٱللَّهِ قَصْدُ ٱلسَّبِيلِ﴾، أي أن الله وحده هو الذي يبين الطريق القاصد المستقيم، طريق الحق الذي لا اعوجاج فيه، طريق الهداية الذي يوصل إلى رضوانه. فالهداية الحقيقية ليست من صنع بشر، ولا من فلسفة عقلية، وإنما هي عطية ربانية، يضعها الله بين يدي عباده في كتابه، وعلى لسان أنبيائه.\n\nلكن لاحظ قوله: ﴿وَمِنْهَا جَآئِرٌۚ﴾، أي أن هناك طرقًا أخرى منحرفة، مائلة عن الصراط، مليئة بالشبهات والشهوات، تزين للناس فتظنها هداية وهي في حقيقتها غواية. وهذه سنة الله في خلقه: أن يضع أمام الإنسان طريقين، طريق مستقيم يؤدي إلى الجنة، وطرق جائرة تؤدي إلى الهلاك.\n\nثم تأتي الجملة التي تحمل المعنى الأعمق: ﴿وَلَوْ شَآءَ لَهَدَىٰكُمْ أَجْمَعِينَ﴾. أي أن الله لو أراد لفرض عليكم الهداية جميعًا، لكنه جل جلاله شاء أن يبتليكم بالاختيار، ليظهر صدق من يطلب وجهه ممن يركض وراء هواه. الهداية ليست إكراهًا، بل امتحان، والله يعطي لكل إنسان إشارات وعلامات في حياته، ثم يترك له الخيار: أتسلك الصراط القاصد أم تميل مع الجائرين؟\n\nابن كثير قال: “على الله بيان الطريق المستقيم الموصل إليه، ومنها جائر عن الحق لا يوصل إلى الله.” والطبري قال: “معناه: على الله تقويم السبيل وتبيينه، والسبل منها الجائر وهو المائل عن القصد.” والسعدي لخصها بقوله: “الله بيّن سبيل الهدى، وترك سبل الغواية، فمن شاء اهتدى ومن شاء ضل.”\n\nفتأمل يا عزيزي القارئ: هذه الآية تعلمك أن الهداية لا تُطلب من غير الله، وأن كل طريق لا يقوم على وحيه فهو جائر. وتعلمك أيضًا أن وجود الضلال في الحياة ليس دليلًا على غياب الله، بل هو جزء من الامتحان الذي به يميز الله الخبيث من الطيب. والرسالة التي تحملها هذه الآية لك هي أن ترجع دائمًا إلى الطريق الذي رسمه الله، لأن الطرق الجائرة قد تبدو أسهل وأسرع، لكنها في النهاية مهلكة.",
      "english_content": "“And upon Allah is the direction of the [right] way, and among the paths are those deviating. And if He willed, He would have guided you all.” [An-Nahl: 9]\n\nDear reader, this verse uncovers the very heart of the divine message and the secret behind your existence in this world. Allah says: “And upon Allah is the direction of the [right] way”—meaning that it is Allah alone who clarifies and defines the straight path, the clear way of truth without crookedness, the path that leads to His pleasure. True guidance is not the product of human philosophy or mere intellect; it is a gift from the Lord of the heavens, placed before His servants in His Book and on the tongue of His prophets.\n\nBut then notice the next part: “and among the paths are those deviating.” This means there are other roads—crooked, misleading, painted with temptations and false appearances. They may seem attractive, but in reality, they lead far away from Allah. This is the divine law of life: two kinds of paths are always present before you—the straight one that leads to Paradise, and the deviant ones that end in ruin.\n\nThen comes the statement that carries profound meaning: “And if He willed, He would have guided you all.” In other words, Allah could have compelled everyone into guidance, but in His wisdom, He chose to test mankind by granting them the ability to choose. Guidance is not forced; it is a trial. Allah gives signs, reminders, and opportunities throughout your life, then leaves the decision to you: will you follow the straight way or incline toward the deviant ones?\n\nIbn Kathir explained: “Upon Allah is to make clear the straight path that leads to Him, but among the ways are those that are crooked and do not lead to Allah.” Al-Tabari said: “It means: upon Allah is to set straight and clarify the way, and among the ways are those that deviate from the straight.” As-Sa‘di summarized: “Allah clarified the path of guidance and left the paths of misguidance, so whoever wills, believes; and whoever wills, turns away.”\n\nReflect, dear reader: this verse teaches you that true guidance is sought only from Allah, and that every path not rooted in His revelation is crooked. It also reminds you that the presence of misguidance in life is not a sign of Allah’s absence, but part of the test by which He distinguishes the sincere from the careless.\n\nAnd the personal message it sends to you is this: return always to the straight way He has drawn, because the deviant paths may look easier, shorter, or more pleasurable—but they end in loss. The straight path is the only one that carries you safely to Him."
    },
    {
      "id": 16,
      "title": "النور ٣٠-٣١ / Al-Noor 30-31",
      "verse_text": "يقول الله تعالى: ﴿قُل لِّلْمُؤْمِنِينَ يَغُضُّوا۟ مِنۡ أَبۡصَـٰرِهِمۡ وَيَحۡفَظُوا۟ فُرُوجَهُمۡۚ ذَٰلِكَ أَزۡكَىٰ لَهُمۡۗ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا يَصۡنَعُونَ (٣٠) وَقُل لِّلْمُؤۡمِنَـٰتِ يَغۡضُضۡنَ مِنۡ أَبۡصَـٰرِهِنَّ وَيَحۡفَظۡنَ فُرُوجَهُنَّ (٣١)﴾ [النور: ٣٠-٣١]",
      "content": "يقول الإمام القرطبي رحمه الله: \"البصر هو البوابة الأكبر إلى القلب\". وهذه حقيقة عميقة، فالعين هي المدخل الأعظم لما يستقر في النفس من نور أو ظلمة. من حماها فقد حمى قلبه، ومن أطلقها فقد عرض قلبه لأن يتلوث. والقلب هو محل نظر الله كما قال النبي ﷺ: «إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم» (رواه مسلم).\n\nعزيزي القارئ، حين يأمرك الله بغض بصرك فهو لا يريد أن يحرمك من لذة، بل يريد أن يمنحك لذة أرقى وأبقى. من جرب غض البصر وداوم عليه ذاق العجب، ومن ذاق تلك الحلاوة لا يعود إلى ما كان عليه أبداً. فقد جاء في الحديث أن النبي ﷺ قال: «النظرة سهم من سهام إبليس مسموم، فمن تركها من مخافتي أبدلته إيماناً يجد حلاوته في قلبه» (رواه الحاكم وصححه الألباني).\n\nتأمل هذا الوعد: مجرد ترك نظرة محرمة يبدلها الله بحلاوة إيمان، وهذه الحلاوة أغلى من أي متعة وقتية. ولهذا قال بعض السلف: \"من غض بصره عن الحرام أطلق الله نور بصيرته\". إنك إن حفظت عينيك، حفظ الله قلبك، وإن تركت هواك، ملأ الله روحك بالسكينة.\n\nوالقرآن حين أمر المؤمنين والمؤمنات معاً بغض البصر وحفظ الفرج، ربط بين العين والقلب والجوارح، لأن البداية من النظرة، والنهاية قد تكون الوقوع في الفاحشة. فمن أغلق الباب من أوله حمى نفسه من السقوط. ولذلك قال الله: ﴿ذَٰلِكَ أَزۡكَىٰ لَهُمۡ﴾، أي أطهر وأنقى. الزكاة هنا تعني الطهارة والنماء، فمن غض بصره نما قلبه في الإيمان، ومن أطلقه نقص وتلوث.\n\nابن القيم رحمه الله قال: \"الصبر على غض البصر أيسر من الصبر على ألم ما بعده\". وهذا يبين أن مجاهدة لحظة واحدة تحميك من آلام طويلة قد تجرها المعصية. أما من انتصر على نفسه، فقد فتح له باب الحكمة وثبات الإيمان ونور القلب.\n\nوليس هذا مجرد كلام نظري، بل هو واقع يعيشه كل من صدق. من ترك شيئاً لله، عوضه الله خيراً منه. ومن ترك النظرة لله، عوضه الله بأنس قلبه، وحلاوة طاعته، ولذة قربه. وهل هناك أعظم من أن تشعر أن الله يراك وقد صرفت نظرك ابتغاء وجهه؟ تلك اللحظة يكتبها الله لك نوراً في قلبك وحماية في دينك.\n\nيا قارئ هذه الكلمات: اجعل غض البصر عهداً بينك وبين الله. كل مرة تجاهد فيها نفسك وتغض بصرك، فاعلم أنك ترتقي درجة عند ربك، وتغلق باباً للشيطان، وتفتح باباً للنور. ومن وجد هذا الطريق واستمر فيه، لن يرجع عنه أبداً إلا أن يشاء الله، لأن من ذاق طعم القرب من الله، يستحيل أن يستبدله بغيره.",
      "english_content": "“Tell the believing men to reduce [some] of their vision and guard their private parts. That is purer for them. Indeed, Allah is Acquainted with what they do. (30) And tell the believing women to reduce [some] of their vision and guard their private parts…” [Al-Noor: 30-31].\n\nDear reader, these verses are not mere prohibitions, they are gates to liberation of the heart. The eyes are the largest gate to the soul, as Imam al-Qurtubi said: “The gaze is the greatest gateway to the heart.” Whatever you allow through your eyes finds its way into your heart, shaping your desires, your peace, your struggles. To guard the eyes, then, is to guard the very sanctuary of the heart—the place upon which Allah looks. The Prophet ﷺ said: “Allah does not look at your forms or your wealth, but He looks at your hearts and your deeds” (Muslim).\n\nWhen Allah commands believers to lower their gaze, He is not depriving them of beauty, but guiding them to a higher, everlasting beauty—the sweetness of faith. The Prophet ﷺ said: “The glance is a poisoned arrow from the arrows of Iblis. Whoever leaves it out of fear of Me, I will replace it with faith whose sweetness he will taste in his heart” (al-Hakim, authenticated by al-Albani). Imagine, dear reader: a single act of restraint—averted eyes for the sake of Allah—transforms into a light in the heart, a sweetness deeper than any fleeting desire.\n\nThis command is addressed to men and women alike, because both share in the trial of the gaze. The Qur’an ties the eye to the heart and the heart to the limbs: the glance is the beginning, the fall into sin the possible end. Allah, in His mercy, shuts the door at the very start. He says: “That is purer for them.” Purity here means both protection from sin and growth in faith. Ibn al-Qayyim said: “Lowering the gaze leaves the heart illuminated, grants firmness, and plants the seed of wisdom.”\n\nPatience in lowering the gaze may feel heavy at first, but as Ibn al-Qayyim also reminded: “Patience in lowering the gaze is easier than patience over the bitterness that follows from letting it go.” One moment of self-control saves the heart from the long torment of guilt and the chains of desire.\n\nAnd here lies the beauty: whoever leaves something for Allah, Allah replaces it with better. If you close your eyes for Allah, He opens for you the vision of the heart, the joy of nearness, the serenity of His remembrance. And once someone tastes this nearness, they cannot turn back. As narrated in the traditions, those who truly find Allah never leave Him, for His closeness is sweeter than any temporary pleasure.\n\nSo, dear reader, take these verses not as restrictions, but as treasures. Every time you lower your gaze, you rise higher in the sight of Allah. Every act of restraint is a step into His mercy, a shield for your heart, and a light for your path. This is the secret of these verses: to free you from slavery to desire, and to lead you into the sweetness of true freedom—the freedom of belonging entirely to Allah."
    },
    {
      "id": 17,
      "title": "الفرقان ٦٣ / Al-Furqan 63",
      "verse_text": "يقول الله تعالى: ﴿وَعِبَادُ ٱلرَّحۡمَـٰنِ ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ هَوۡنٗا وَإِذَا خَاطَبَهُمُ ٱلۡجَـٰهِلُونَ قَالُواْ سَلَـٰمٗا﴾ [الفرقان: ٦٣]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية العظيمة تفتتح مقطعًا من أروع المقاطع في كتاب الله، حيث يصف الله \"عباد الرحمن\"، أي أولئك الذين نالوا شرف الانتساب إلى رحمته وكرامته. تأمل الاسم: لم يقل \"عباد الله\" فحسب، بل \"عباد الرحمن\"، ليدلّ على أن العلاقة بينهم وبين ربهم قائمة على الرحمة والعطف والحنان، فهم يعيشون في ظل رحمته ويعكسونها في سلوكهم وأخلاقهم.\n\nأول صفة لهم: ﴿ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ هَوۡنٗا﴾. أي أنهم يسيرون على الأرض بسكينة ووقار وتواضع، ليس في مشيتهم تكبّر ولا خيلاء، ولا تصنّع ولا مباهاة. قال الحسن البصري: “هم الذين لا يريدون أن يفسدوا في الأرض ولا أن يظلموا أحدًا.” وقال مجاهد: “الهَون: التواضع في غير ضعف.” فهم متواضعون لله وللناس، لكن ليسوا أذلّة ولا مهانين، بل أهل كرامة وعزّة، يجمعون بين التواضع والوقار.\n\nثم يصف تعاملهم مع الآخرين: ﴿وَإِذَا خَاطَبَهُمُ ٱلۡجَـٰهِلُونَ قَالُواْ سَلَـٰمٗا﴾. والجاهلون هنا لا يُقصد بهم الجهل العلمي فقط، بل الجهل الأخلاقي، الذين يؤذون بالكلمة، أو يستفزّون، أو يتجاوزون حدود الأدب. فكيف يرد عباد الرحمن؟ لا ينزلون إلى مستواهم، لا يردّون السيئة بالسيئة، بل يقولون: سلامًا. أي كلمة طيبة، أو ردًّا مسالمًا يرفعهم فوق السباب ويجنبهم الانحدار إلى المهاترات. قال ابن كثير: “أي لا يقابلون الجهل بمثله، ولكن يعفون ويصفحون.”\n\nوهنا، يا عزيزي القارئ، يعلّمك الله أن العظمة الحقيقية ليست في الانتصار على الناس باللسان أو القوة، بل في الانتصار على نفسك، في أن تكبح غضبك، وتضبط لسانك، وتتعامل مع السفهاء برقيّ لا يقدرون هم عليه. الإمام الطبري قال: “أي إذا جهل عليهم أهل الجهل، قالوا قولاً يسلمون فيه من الإثم، ويأمنون به أذى السفهاء.”\n\nهذه الآية ليست وصفًا عابرًا، بل هي منهج حياة. إنها تقول لك: إن كنت تريد أن تكون من عباد الرحمن، فابدأ بخطوات عملية: اجعل مشيتك في الأرض تواضعًا، لا غرورًا. واجعل ردودك على الاستفزازات حكمة وهدوءًا، لا غضبًا وانتقامًا.\n\nوالجميل أن هذه الآية جاءت في وسط سورة الفرقان، السورة التي ترد على حجج الكفار وتكشف عنادهم. وكأن الله يقول للمؤمنين: في وسط هذا الصخب والجدال، لا تفقدوا هدوءكم ولا تُفسدوا قلوبكم، بل كونوا عباد الرحمن الذين يترفعون عن سفه الجاهلين.\n\nتأمل يا عزيزي القارئ: حين تلتزم بهذا المنهج، فأنت لا تردّ الشر بالشر، بل تحوّل لحظة التوتر إلى فرصة للتقرب من الله. كل مرة تعفو، كل مرة تكظم غيظك، كل مرة ترد بالسلام، فأنت تكتب لنفسك مكانًا في سجل \"عباد الرحمن\".\n\nألا ترى أن هذه الآية تخاطب قلبك مباشرة؟ تقول لك: عظمتك ليست فيما يراك الناس به من قوة أو جاه، بل في هدوئك، في سكينتك، في سلامك. وهذه الصفة الأولى لعباد الرحمن، وكأنها الأساس الذي تُبنى عليه باقي صفاتهم في الآيات التالية.",
      "english_content": "“And the servants of the Most Merciful are those who walk upon the earth humbly, and when the ignorant address them, they say [words of] peace.” [Al-Furqan: 63]\n\nDear reader, this verse opens one of the most beautiful passages in the Qur’an, where Allah describes “the servants of the Most Merciful.” Notice how He uses this name—Ar-Rahman, the All-Merciful. He does not simply say “servants of Allah,” but “servants of the Most Merciful,” to remind you that their identity is tied to His mercy, and that they reflect this mercy in their character and conduct.\n\nThe very first quality mentioned is: “those who walk upon the earth humbly.” This humility does not mean weakness or humiliation; rather, it means dignity without arrogance, calmness without conceit. Their footsteps are steady, their presence marked by peace, not by noise or pride. Al-Hasan al-Basri said: “They do not seek to corrupt in the land nor to oppress anyone.” Mujahid explained: “It means humility without weakness.” They carry themselves with grace, combining humility with inner strength.\n\nThen comes the second trait: “and when the ignorant address them, they say [words of] peace.” The ignorant here are not only those who lack knowledge, but also those who are rude, hostile, or provocative. How do the servants of the Most Merciful respond? They do not lower themselves to the level of insults or retaliation. Instead, they respond with dignity, with calm words that protect them from sin and free them from conflict. Ibn Kathir explained: “They do not respond to ignorance with the same, but they forgive and overlook.”\n\nThis is a lesson, dear reader: greatness is not in silencing people with harsh words, nor in winning every argument, but in controlling your own anger, mastering your tongue, and walking away with peace. Al-Tabari said: “They answer with words that bring safety from sin and keep harm away from themselves.”\n\nThis verse is not just a description; it is a roadmap for life. It tells you: if you want to be among the servants of the Most Merciful, then start here—make your walk one of humility, and your responses one of peace.\n\nAnd notice the wisdom in placing this verse in the middle of Surah Al-Furqan, a chapter filled with the denials and objections of the disbelievers. It is as if Allah is saying: amid all this noise and hostility, the true believers remain calm, dignified, and merciful.\n\nReflect, dear reader: each time you restrain your anger, each time you respond to rudeness with peace, each time you choose dignity over retaliation—you are not just avoiding conflict; you are writing your name among “the servants of the Most Merciful.”\n\nThis verse speaks directly to your heart, telling you that true greatness lies not in force or pride, but in humility, calmness, and peace. That is the very foundation of belonging to the circle of Allah’s chosen servants."
    },
    {
      "id": 18,
      "title": "لقمان ١٧ / Luqman 17",
      "verse_text": "يقول الله تعالى: ﴿يَـٰبُنَيَّ أَقِمِ ٱلصَّلَوٰةَ وَأْمُرْ بِٱلْمَعْرُوفِ وَٱنْهَ عَنِ ٱلْمُنكَرِ وَٱصْبِرْ عَلَىٰ مَآ أَصَابَكَۖ إِنَّ ذَٰلِكَ مِنْ عَزْمِ ٱلْأُمُورِ﴾ [لقمان: ١٧]",
      "content": "",
      "english_content": "“O my son, establish prayer, enjoin what is right, forbid what is wrong, and be patient over what befalls you. Indeed, [all] that is of the matters [requiring] determination.” [Luqman: 17]\n\nDear reader, this verse is part of the timeless advice of Luqman the Wise to his son—a set of instructions that form a complete program for life, one that balances your relationship with Allah, with yourself, and with society.\n\nThe first command is: “Establish prayer.” Luqman does not simply say “pray,” but “establish” it, meaning perform it consistently, properly, and with presence of heart. Prayer here is not a ritual of empty movements; it is the pillar of faith, the connection between you and your Lord, the fountain from which peace and strength flow into your life.\n\nThen Luqman shifts from the personal to the communal: “Enjoin what is right and forbid what is wrong.” This means you are not meant to live in isolation, concerned only with yourself. Your faith carries a responsibility—to promote goodness, justice, and truth, and to resist corruption, oppression, and sin. Al-Tabari explained: “Al-ma‘ruf (the right) means obedience to Allah, and al-munkar (the wrong) means disobedience to Him.” So the mission of the believer is to spread obedience and restrain disobedience.\n\nBut such a mission does not come without cost. That is why Luqman continues: “And be patient over what befalls you.” Anyone who establishes prayer, speaks the truth, and stands against wrongdoing will inevitably face opposition, mockery, or even harm. Patience is therefore not optional; it is the essential provision for the believer’s journey.\n\nFinally, the verse seals the advice with: “Indeed, [all] that is of the matters [requiring] determination.” These are not trivial suggestions; they are among the weightiest and most noble responsibilities a believer can carry. Ibn Kathir said: “It means: establish prayer with its duties, call to good, forbid evil according to your ability, and be patient with whatever harm comes to you in this cause.” As-Sa‘di added: “This combines the rights of Allah and the rights of His servants in a single, comprehensive command.”\n\nReflect, dear reader: in this single verse you are handed the blueprint of a meaningful life. Worship Allah with devotion, serve people with goodness, restrain evil with courage, and bear difficulties with patience. This is not only a father’s advice to his son—it is Allah’s message to you, showing you what it means to live as His servant in a world of trials and responsibilities.\n\nThis verse speaks to your heart as if it were said directly to you: O my child, make prayer your anchor, make goodness your legacy, make patience your shield—and you will walk the path of determination that leads to Allah’s pleasure."
    },
    {
      "id": 19,
      "title": "محمد ٧ / Muhammad 7",
      "verse_text": "يقول الله تعالى: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَنصُرُواْ ٱللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ﴾ [محمد: ٧]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية الكريمة تحمل وعدًا عظيمًا من الله لعباده المؤمنين، وتضع أمامك قاعدة من أعظم قواعد الرسالة: النصر الحقيقي مرتبط بنصرة الله. قد تسأل: كيف ننصر الله وهو الغني عن العالمين؟ الجواب أن نصرة الله تكون بنصرة دينه، والتمسك بكتابه، واتباع رسوله ﷺ، والوقوف مع الحق في وجه الباطل.\n\nالله سبحانه يفتتح الآية بخطاب مباشر: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ﴾، وهو نداء شرف، يذكرك أنك تحمل هوية الإيمان، وأنك لست كغيرك من الناس. ثم يبين القاعدة: ﴿إِن تَنصُرُواْ ٱللَّهَ يَنصُرْكُمْ﴾، أي إن جعلتم همّكم نصرة دين الله، فإن الله سيتولى نصركم، يمدّكم بعونه وتوفيقه، ويقلب الموازين لصالحكم ولو اجتمع عليكم أهل الأرض.\n\nثم يزيد الوعد طمأنينة: ﴿وَيُثَبِّتْ أَقْدَامَكُمْ﴾، وهذا لا يعني فقط في ميدان القتال، بل في كل ميدان من ميادين الحياة. يثبت قدميك على طريق الحق، فلا تزيغ مع الشبهات، ولا تسقط أمام الشهوات، ولا تتراجع عند الفتن. التثبيت هو أعظم أنواع النصر، لأن العبرة ليست أن تبدأ الطريق، بل أن تبقى ثابتًا عليه حتى تلقى الله.\n\nابن كثير قال: “أي إن أقمتم دينه ونصرتم كتابه ورسوله، نصركم على أعدائكم وثبّتكم.” والطبري قال: “من نصر دين الله نصره الله على عدوه.” والسعدي لخصها بقوله: “هذه سنة الله: من قام بنصر دينه أعانه وثبّته.”\n\nفتأمل يا عزيزي القارئ: هذه ليست مجرد آية عن الحروب، بل رسالة شخصية لك. إذا نصرت الله في قلبك، فجعلته أعظم ما فيه، نصر الله قلبك بالسكينة. إذا نصرت الله في بيتك، فأقمت الصلاة فيه، نصر الله بيتك بالبركة. إذا نصرت الله في لسانك، فقلت الحق، نصر الله لسانك بالحكمة. فالنصر ليس فقط أن تنتصر على عدو خارجي، بل أن تنتصر على نفسك، وأن يثبتك الله على طاعته حتى الممات.\n\nهذه الآية تقول لك بوضوح: نصرتك من نصرتي، وعونك من عوني. فإذا أردت أن يثبت الله قدميك حين تزل أقدام كثيرة، فكن أنت من أنصار الله، وستجد وعده حقًا لا يتخلف.",
      "english_content": "“O you who have believed, if you support Allah, He will support you and plant firmly your feet.” [Muhammad: 7]\n\nDear reader, this verse carries one of the greatest promises of Allah to His believing servants and lays down a principle that defines the message of faith: true victory is tied to supporting Allah. You may ask: how can we support Allah, when He is free of all need? The answer is that supporting Allah means supporting His religion—upholding His Book, following His Messenger ﷺ, standing with the truth against falsehood, and living as a witness to His guidance in every aspect of life.\n\nAllah begins the verse with a noble address: “O you who have believed.” This is not just a call; it is a reminder of your identity. You are a believer, chosen to carry His light. Then He establishes the rule: “If you support Allah, He will support you.” Meaning, if you dedicate yourself to His cause, He will grant you His aid, His strength, and His protection. Even if all the powers of the world gather against you, the support of Allah outweighs them all.\n\nThen He adds: “and plant firmly your feet.” This is not only about physical battles; it applies to every arena of life. Allah will steady your heart in times of doubt, strengthen your will in moments of weakness, keep you firm on the path of truth when temptations and trials try to pull you away. The greatest victory is not in starting the journey but in remaining steadfast until the end.\n\nIbn Kathir said: “Meaning, if you establish His religion, He will grant you victory over your enemies and make you firm.” Al-Tabari explained: “Whoever supports the religion of Allah, Allah will support him against his enemy.” And As-Sa‘di summarized: “This is Allah’s law: whoever stands up to support His religion, He aids him and strengthens him.”\n\nReflect, dear reader: this verse is not confined to times of war. It is a personal message for you. If you support Allah in your heart—by making Him the greatest love—He will support your heart with peace. If you support Allah in your home—by establishing prayer within it—He will support your home with blessing. If you support Allah with your tongue—by speaking the truth—He will support your words with wisdom.\n\nVictory, then, is not only triumph over enemies outside; it is triumph over yourself, over your weaknesses, over the pull of sin. This verse tells you: your strength is tied to Him, your stability flows from Him. If you want your feet to remain firm when many others slip, then be among those who support Allah, and His promise of support will never fail you."
    },
    {
      "id": 20,
      "title": "الحجرات ١٢ / Al-Hujurat: 12",
      "verse_text": "يقول الله تعالى: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجْتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعْضَ ٱلظَّنِّ إِثْمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغْتَب بَّعْضُكُم بَعْضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ﴾ [الحجرات: ١٢]",
      "content": "اسمع يا عزيزي القارئ، هذه الآية من أعمق الآيات التي ترسم ملامح المجتمع الإيماني النظيف، المجتمع الذي يريده الله أن يكون مرآة لرحمته وعدله، بعيدًا عن الظنون السيئة والغيبة والتجسس. هي ليست فقط تعليمات اجتماعية، بل علاج لأمراض القلب التي تفسد العلاقات وتقتل الأخوة.\n\nيبدأ الله الخطاب بنداء الإيمان: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ﴾، ليذكرك أن ما سيأتي هو من مقتضيات إيمانك، فلا يكتمل إيمانك إلا بتطبيقه. ثم يقول: ﴿ٱجْتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ﴾. لماذا لم يقل \"اجتنبوا الظن\" كله؟ لأن بعض الظن حسن ومطلوب، مثل حسن الظن بالله أو حسن الظن بالمؤمنين عند الحاجة. لكن الكثير من الظن السيئ الذي يملأ القلوب تجاه الآخرين هو الذي يفسد العلاقات، فيحوّل القلوب إلى محاكم، والنفوس إلى سجّانين. لذلك حذّر الله منه وقال: ﴿إِنَّ بَعْضَ ٱلظَّنِّ إِثْمٞ﴾. أي أن جزءًا من هذه الظنون السيئة يتحول إلى ذنب عظيم، لأنه يزرع الكراهية ويهدم الثقة.\n\nثم يزيد البيان وضوحًا: ﴿وَلَا تَجَسَّسُواْ﴾. أي لا تبحثوا عن عورات بعضكم البعض. التجسس هو أن يتبع الإنسان أخطاء غيره ويترصّد زلاته. قال مجاهد: “خذوا ما ظهر ودعوا ما ستر الله.” فالمؤمن الحق ليس فضوليًا يتلذذ بسقوط الآخرين، بل رحيمًا يحب الستر.\n\nويأتي أعظم تحذير: ﴿وَلَا يَغْتَب بَّعْضُكُم بَعْضًا﴾. الغيبة هي أن تذكر أخاك بما يكره في غيابه. والقرآن لم يتركها كلمة عامة، بل صوّرها بمشهد يهز القلوب: ﴿أَيُحِبُّ أَحَدُكُمۡ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ﴾. تأمل هذا التشبيه: الغيبة ليست مجرد كلام، إنها كأنك تأكل لحم أخيك ميتًا، بلا دفاع ولا قدرة له على ردّك. ولذلك قال العلماء: التشبيه هنا ليس مجازًا عاديًا، بل تصوير لمدى بشاعة المعصية.\n\nثم يوجّه الله العلاج: ﴿وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ﴾. كأنه يقول لك: إذا وقعت في هذه المعاصي، فلا تيأس، باب التوبة مفتوح. والتقوى هنا هي الدواء: أن تراقب الله في خواطرك قبل كلماتك، وفي ظنونك قبل أفعالك.\n\nابن كثير قال: “ينهى الله عباده المؤمنين عن كثير من الظن، وهو التهمة والتخون للأهل والأقارب والناس في غير محله، لأن ذلك يوقع العداوة والبغضاء.” والطبري قال: “أي لا تجسسوا على عورات بعضكم، ولا يغتب بعضكم بعضًا، فإن الغيبة كأكل لحم الميت.” والقرطبي أضاف: “هذا التشبيه غاية في التقبيح، لأن لحم الميت مستقذر طبعا، فكيف إذا كان لحم أخيك؟”\n\nفتأمل يا عزيزي القارئ: هذه الآية ليست فقط قانونًا أخلاقيًا، بل هي درع يحمي قلبك ومجتمعك من التفكك. كم من العلاقات الزوجية انهارت بسبب الظنون! وكم من الصداقات فُسدت بسبب الغيبة! وكم من الأسر تمزقت بسبب التجسس! فجاء القرآن ليقول لك: قف، لا تدع قلبك يظن السوء، لا تدع أذنك تبحث عن عورات، لا تدع لسانك يأكل لحوم الناس.\n\nوكأن الآية تخاطبك أنت شخصيًا: إن أردت أن تعيش مرتاح البال، محاطًا بأخوة صادقة، فابدأ من هنا: طهّر قلبك من الظن، طهّر عينك من التجسس، طهّر لسانك من الغيبة. وستجد نفسك بين يدي الله في صف عباد الرحمن، نقيّ السريرة، طيب المعشر، محبوبًا عند الله والناس.",
      "english_content": "“O you who have believed, avoid much negative assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful.” [Al-Hujurat: 12]\n\nThis verse is one of the most profound instructions that shapes the moral fabric of an Islamic society. It begins with a direct call: “O you who have believed”—reminding you that what follows is not optional etiquette but a requirement of true faith. Allah warns against indulging in negative assumptions. Not all suspicion is sinful, but much of it is. Assumptions rooted in mistrust and negativity poison relationships, turning hearts into courts of judgment and sowing seeds of hatred. That is why Allah describes it as a sin, because suspicion often leads to backbiting, slander, and broken bonds.\n\nThe verse then prohibits spying: “Do not spy.” Spying means seeking out the faults and private matters of others. Islam teaches us to respect privacy and to cover one another’s flaws, not to dig them up. As Mujahid said, “Take what is apparent and leave what Allah has concealed.” A believer is not a fault-finder; rather, he is a source of mercy and forgiveness.\n\nThen comes the stern prohibition of backbiting: “Do not backbite each other.” The Qur’an does not leave the matter abstract but paints a shocking image: backbiting is like eating the flesh of your dead brother. Why such a vivid comparison? Because the dead cannot defend themselves, and likewise, when you speak ill of someone in their absence, you strip them of their dignity without them being able to respond. The imagery is deliberately horrifying, to make the believer recoil from the very thought of it.\n\nFinally, Allah closes with both a warning and hope: “And fear Allah; indeed, Allah is Accepting of repentance and Merciful.” If you have fallen into suspicion, spying, or backbiting, do not despair—Allah invites you back through repentance. The cure is taqwa: cultivating awareness of Allah in your thoughts, speech, and actions.\n\nIbn Kathir commented: “Allah forbids His believing servants from suspicion and accusation without reason, because that stirs hatred and animosity.” Al-Qurtubi added: “The likeness of eating dead flesh is the utmost form of detestation, for flesh is repulsive when alive, and more so when dead, and worse still when it is of your brother.”\n\nSo, this verse is not just a set of rules—it is a cure for the diseases of the heart. Suspicion destroys trust, spying violates privacy, and backbiting erodes love. Together, they unravel communities and families. The Qur’an offers you an alternative: purify your heart, restrain your tongue, and protect your brother’s honor as you would protect your own.\n\nIt is as if the verse speaks directly to you: if you desire peace in your soul and harmony in your society, begin by cleansing yourself of suspicion, abandoning the urge to pry into others’ affairs, and silencing the tongue from speaking ill. Then, you will live as one of the true servants of the Most Merciful, loved by Allah and beloved among people."
    },
    {
      "id": 21,
      "title": "الرحمن ١٣ / Ar-Rahman: 13",
      "verse_text": "يقول الله تعالى: ﴿فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ﴾ [الرحمن: ١٣]",
      "content": "هذه الآية العظيمة من سورة الرحمن تتكرر إحدى وثلاثين مرة في السورة، حتى قيل إنها بمثابة لازمة تتردد في سمع المؤمن، توقظه وتذكره في كل نعمة من نعم الله، وفي كل مشهد من مشاهد قدرته وعظمته. كلمة ﴿آلاء﴾ تعني النعم العظيمة، الظاهرة والباطنة، الدنيوية والأخروية، من خلق الإنسان وتسويته، إلى إنزال الماء وإنبات الأرض، إلى هداية القلب بالقرآن، إلى جزاء الجنة ونعيمها.\n\nجاءت الآية في صيغة السؤال الاستنكاري الموجه إلى الجن والإنس معاً: ﴿فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ﴾. أي: أيّ نعمة من نعم ربكما تستطيعان إنكارها أو جحودها؟ المعنى: لن تستطيعوا، فكل ما حولكم من آيات وعجائب هو دليل على فضل الله عليكم. هذا التكرار ليس عبثاً، بل هو تذكير مستمر يقطع الغفلة ويعيد الوعي في كل مرة تُذكر فيها نعمة أو مشهد من مشاهد القدرة.\n\nقال ابن كثير: \"يقول تعالى: فبأي نعم الله التي أنعمها عليكم تكذبان؟ أي لا تكذبان بشيء من ذلك.\" وقال القرطبي: \"إنما كررها ليقررهم بالاعتراف، ويعدد عليهم النعم بعددها.\" والرازي أشار إلى أن تكرارها مع كل نعمة فيه إشارة إلى أن نعم الله لا تنفصل بعضها عن بعض، بل هي شبكة مترابطة من الإحسان والفضل.\n\nإذا تدبر القارئ وجد أن السورة تبدأ بذكر تعليم القرآن، ثم خلق الإنسان، ثم توازن الكون، ثم الماء، والثمار، والجنان، والعقاب المعدّ للمكذبين، والنعيم المهيأ للمؤمنين. وفي كل مشهد يأتي هذا السؤال المزلزل: فبأي آلاء ربكما تكذبان؟ وكأن الآية تسألك أنت شخصياً: هل تستطيع أن تنكر هذه النعمة؟ هل تملك أن تجحد ما ترى من آثار قدرة الله؟\n\nالآية رسالة واضحة: أن طريق النجاة يبدأ بالاعتراف بالفضل، والشكر على النعم. الحزن يزول إذا تذكرت أن وراءك رباً لا يزال يغدق عليك النعم في كل نفس، والطمأنينة تأتي حين تعلم أن إنكار النعم لا يغيّر الواقع، بل يُنقص من قدر الإنسان، بينما الشكر يزيدها ويباركها.\n\nهذه الآية تجعل قلبك يلين، ولسانك يردد: بلى يا رب، لا نكذب بآلائك، كلها حق، وكلها فضل، وكلها رحمة. فهي ليست مجرد تذكير بالنعم الماضية، بل وعد بالاستمرار: فكما أنعم الله من قبل، فهو سيظل ينعم، إلى أن تلقاه.",
      "english_content": "“So which of the favors of your Lord would you deny?” [Ar-Rahman: 13]\n\nThis noble verse from Surat Ar-Rahman is repeated thirty-one times throughout the surah, and its repetition is not without purpose. It serves as a recurring refrain, constantly striking the ears and hearts of both humankind and jinn, awakening them to the countless blessings of Allah that surround them. The word “ālaa” refers to the magnificent favors of Allah, both visible and hidden, worldly and spiritual—ranging from the creation of man and the balance of the universe, to the revelation of the Qur’an, the sustenance of food and water, and the ultimate reward of Paradise.\n\nThe verse is expressed in the form of a rhetorical question: “So which of the favors of your Lord would you deny?” It is a question that cannot be answered with denial, for the reality of Allah’s favors is undeniable, enveloping every aspect of life. Ibn Kathir explains that the meaning is: “By which of Allah’s blessings can you both (humans and jinn) deny? Indeed, none of them.” Al-Qurtubi adds that its repetition is meant to confirm and press the acknowledgment of these favors, enumerating blessing after blessing. Ar-Razi noted that its constant recurrence after every description of a blessing shows how inseparable Allah’s favors are—interwoven in a network of mercy and grace.\n\nWhen one reflects deeply, it becomes clear that this verse is not only listing blessings, but is also shaking the soul from heedlessness. It reminds you, dear reader, that grief, worry, and despair shrink when you remember the ocean of favors Allah has surrounded you with. Every breath, every drop of water, every verse of guidance is a testimony of His mercy.\n\nThe verse also carries a subtle promise: just as Allah has filled your past with His generosity, He continues to shower you with His mercy now, and He will not withhold it in the future. Thus, the natural response of the believer is to bow in gratitude and say: “No, my Lord, we do not deny Your favors—every one of them is true, every one of them is a mercy, every one of them is a sign of Your greatness.”"
    },
    {
      "id": 22,
      "title": "الحشر ١٨ / Al-Hashr 18",
      "verse_text": "يقول الله تعالى: ﴿يَا أَيُّهَا ٱلَّذِينَ آمَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُوا۟ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ﴾ [الحشر: ١٨]",
      "content": "يا عزيزي القارئ، هذه الآية الكريمة من سورة الحشر تُلقي ضوءًا ساطعًا على حقيقة عميقة يغفل عنها الكثير من الناس: أن الحياة ليست رحلة عبثية، بل هي استعداد دائم للقاء الله واليوم الآخر.\n\nالله سبحانه يخاطب المؤمنين بقوله: ﴿يَا أَيُّهَا ٱلَّذِينَ آمَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ﴾، وكأنها دعوة متكررة يكررها ربك الرحيم على مسامعك لئلا تنساها. والتقوى هنا ليست مجرد كلمة، بل حالة وعي دائم، أن تكون حاضر القلب مع الله، خائفًا من غضبه، راجيًا رحمته، ملتزمًا بحدوده.\n\nثم تأتي الوصية العجيبة: ﴿وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ﴾. لاحظ كلمة \"غد\"، لم يقل الله \"للآخرة\" أو \"ليوم القيامة\"، بل قال \"غدًا\" ليقرب لك المشهد، كأن يوم القيامة ليس بعيدًا بل هو غدٌ قادم لا محالة. هذه الكلمة وحدها تهز القلب وتوقظه، لأنك حين تفكر في \"غدك\" فأنت تدرك أنه قريب جدًا. والآية تدعوك أن تُحاسب نفسك قبل أن تُحاسَب، أن تتفقد ما قدّمته من عمل، خيرًا كان أو شرًا.\n\nثم يعيد سبحانه الأمر مرة أخرى: ﴿وَٱتَّقُوا۟ ٱللَّهَ﴾. التكرار هنا ليس عبثًا، بل ليؤكد أن التقوى هي المفتاح، وهي الوسيلة الوحيدة للنجاة، فلا يكفي أن تحاسب نفسك دون أن تحصّن قلبك بتقوى الله.\n\nوختم الآية بقوله: ﴿إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ﴾. أي أن الله محيط بأعمالك كلها، ظاهرها وباطنها، يعلم ما تخفيه وما تُظهره، فلا تغترّ بمظاهر الطاعة إذا لم تصدق نيتك، ولا تستهين بصغائر الذنوب لأنها عند الله محسوبة.\n\nقال ابن كثير: \"أي حاسبوا أنفسكم قبل أن تُحاسَبوا، وانظروا ماذا ادخرتم لأنفسكم من الأعمال الصالحة ليوم معادكم وعرضكم على ربكم.\" وقال القرطبي: \"في هذه الآية دلالة على وجوب محاسبة النفس، وهو قول عمر رضي الله عنه: حاسبوا أنفسكم قبل أن تحاسبوا، وزنوا أعمالكم قبل أن توزن عليكم.\"\n\nفتأمل يا عزيزي القارئ، كيف أن هذه الآية تُحوِّلك من الانشغال بزينة الدنيا إلى التفكير في حقيقتك ومصيرك، فهي بمثابة جرس إنذار، ولكن بلطف ورحمة، لتذكرك بأن حياتك كلها ليست إلا رصيدًا تُودعه ليوم الحساب.\n\nقف مع نفسك الليلة واسأل: ماذا قدّمت لغد؟ ماذا سيستقبلك إذا وقفت بين يدي الله؟ هذه الأسئلة ليست لتُحزنك بل لتوقظك، لتمنحك فرصة أن تغيّر وتستدرك، فالباب ما زال مفتوحًا، والرحمة واسعة، لكن \"الغد\" أقرب مما تظن.",
      "english_content": "\"O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow – and fear Allah. Indeed, Allah is fully aware of what you do.\" [Al-Hashr: 18]\n\nMy dear reader, this verse from Surah Al-Hashr shines a piercing light upon a truth many overlook: life is not a random journey but a constant preparation for the Day you will meet Allah.\n\nAllah calls the believers, saying: “O you who have believed, fear Allah.” It is as though your Lord, the Most Merciful, is repeating this call over and over so that it never escapes your heart. Taqwa here is not just a word—it is a state of constant awareness, a vigilant heart that knows Allah is watching, that fears His displeasure and longs for His mercy, that keeps within His boundaries.\n\nThen comes the profound command: “And let every soul look to what it has put forth for tomorrow.” Notice, He did not say “for the Hereafter” or “for the Day of Resurrection.” He said “tomorrow,” as if to bring it near, to remind you that the Day of Judgment is not far away—it is as close as tomorrow itself. This single word is enough to shake the heart awake, because when you think of “tomorrow,” you know it is soon, and you cannot escape its arrival. The verse is a divine call to hold yourself accountable before you are held accountable, to examine your deeds—good and bad—before they are displayed before your Lord.\n\nThen, again, Allah repeats: “And fear Allah.” This repetition is not redundant—it emphasizes that taqwa is the key, the only shield that can protect you on that inevitable Day. Self-accounting without taqwa is empty; but with it, it becomes the path to safety.\n\nThe verse then closes with: “Indeed, Allah is fully aware of what you do.” Nothing is hidden from Him—your actions, your intentions, the whispers of your heart. Do not be deceived by outward appearances of piety if your inner state is corrupt, and do not belittle small sins, for they are all known to Allah.\n\nIbn Kathir explained: “Meaning, hold yourselves accountable before you are held accountable, and look at what you have prepared for your meeting with Allah.” Al-Qurtubi added: “This verse proves the necessity of self-reckoning. Umar (may Allah be pleased with him) said: Take account of yourselves before you are taken to account, and weigh your deeds before they are weighed for you.”\n\nSo reflect, my dear reader: this verse moves you from the distractions of worldly glitter to the truth of your soul’s destiny. It is a wake-up call—gentle yet firm—reminding you that your life is nothing but a deposit you are storing for the Day of Reckoning.\n\nPause tonight and ask yourself: What have I sent forth for tomorrow? What awaits me when I stand before Allah? These questions are not meant to sadden you but to awaken you, to give you the chance to change and to make amends while the door of mercy is still open. “Tomorrow” is nearer than you think."
    },
    {
      "id": 23,
      "title": "التغابن ١١ / At-Taghabun 11",
      "verse_text": "يقول الله تعالى: ﴿مَا أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ ٱللَّهِۗ وَمَن يُؤۡمِنۢ بِٱللَّهِ يَهۡدِ قَلۡبَهُۥۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ﴾ [التغابن: ١١]",
      "content": "عزيزي القارئ، هذه الآية العظيمة من سورة التغابن تحمل سرًّا من أسرار الطمأنينة وسط العواصف. يخبرك الله أن كل مصيبة، مهما صغرت أو عظمت، لم تقع إلا بإذنه سبحانه. ليست صدفة ولا عبثًا ولا ظلمًا من أحد غلب الله، بل هي بقدر مكتوب، بحكمة أرادها العزيز العليم. هذا اليقين وحده كفيل أن ينزع من قلبك الاضطراب، لأنك تدرك أن وراء البلاء عينًا ترى، وأذنًا تسمع، ورحمة تدبر.\n\nثم تأمل قوله: ﴿وَمَن يُؤۡمِنۢ بِٱللَّهِ يَهۡدِ قَلۡبَهُۥ﴾. لم يقل \"يهده في دينه\" أو \"يهده إلى الجنة\"، بل خصّ القلب، لأنه موطن الطمأنينة والقلق، مركز الحزن والفرح. قال ابن كثير: \"أي من أصابته مصيبة فعلم أنها بقدر الله، فسلّم ورضي، هدى الله قلبه وعوّضه يقينًا.\" والقرطبي قال: \"يهديه إلى اليقين حتى يعلم أن ما أصابه لم يكن ليخطئه، وما أخطأه لم يكن ليصيبه.\"\n\nإنها معادلة إيمانية عجيبة: كلما قوي إيمانك بالله، كلما قاد قلبك في طريق السكينة، حتى وأنت وسط الألم. وبهذا المعنى، كان السلف يرون البلاء نعمةً، لأنه يوقظ القلب ويعيده إلى الله. سعيد بن جبير رحمه الله قال: \"هي للمؤمن المصاب بالمصيبة، يعلم أنها من عند الله فيرضى ويسلم.\"\n\nثم ختمت الآية بقول الله: ﴿وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ﴾. لا يخفى عليه دمعة تنزل من عينك، ولا أنين يخرج من صدرك، ولا همّ يثقل قلبك. هو يعلم حجم البلاء الذي أصابك، ويعلم أيضًا طاقتك وقدرتك على احتماله. فهو الذي ابتلاك، وهو الذي وعدك أن يهدي قلبك إذا آمنت به ورضيت بقضائه.\n\nفتأمل يا عزيزي القارئ: الناس إذا أصابتهم المصيبة جزعوا أو ثاروا أو فقدوا صبرهم، أما المؤمن، فإنه يلجأ إلى الله ويستسلم لحكمه، فيُكافأ بهداية قلبه، وتلك الهداية هي الجائزة العظمى وسط البلاء. فالمصيبة التي تُخرجك من الغفلة وتقربك من الله ليست نقمة، بل رحمة خفية.\n\nقف لحظة واسأل نفسك: كم مرة مررت بمصيبة كنت تراها شقاءً، ثم بعد زمن اكتشفت أنها كانت رحمة خفية؟ كم مرة ضاقت بك الأرض ثم فتح الله لك أبوابًا لم تكن لتُفتح لولا ذلك البلاء؟ هذا هو معنى الآية: أن ترى يد الله في كل ما يجري عليك، وأن تؤمن أن وراء كل ألم حكمة، وأن قلبك سيظل مهديًا ما دمت تثق بربك.",
      "english_content": "\"No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things. [At-Taghabun: 11]\n\nDear reader, this profound verse from Surah At-Taghabun carries within it the secret of tranquility amidst life’s storms. Allah tells you that every calamity, whether small or great, does not occur except by His permission. It is not coincidence, nor chaos, nor injustice by anyone overpowering Allah—rather, it is a decree written with wisdom that the All-Powerful, All-Knowing has willed. This certainty alone is enough to remove turmoil from your heart, because you realize that behind the trial there is an eye that sees, an ear that hears, and a mercy that manages every detail.\n\nThen reflect on His words: “And whoever believes in Allah – He will guide his heart.” Notice that Allah specifically mentions the heart—not merely guidance in religion or to Paradise, but guidance of the heart itself, for it is the place where fear, peace, grief, and hope dwell. Ibn Kathir explained: “Whoever is struck by a calamity and knows it is by the decree of Allah, then surrenders and is content, Allah will guide his heart and replace his grief with certainty.” Al-Qurtubi added: “He guides him to certainty until he knows that what struck him could never have missed him, and what missed him could never have struck him.”\n\nIt is an amazing spiritual equation: the stronger your faith in Allah, the more your heart will be guided toward calmness, even while you are in the midst of pain. For this reason, the early generations sometimes saw affliction as a hidden blessing, because it woke their hearts and returned them to Allah. Sa‘id ibn Jubayr said: “It is for the believer who is afflicted with calamity, and he knows it is from Allah, so he accepts and surrenders, then Allah guides his heart.”\n\nAnd the verse ends with: “And Allah is Knowing of all things.” He is fully aware of every tear that falls from your eye, every sigh that escapes your chest, and every burden that weighs on your heart. He knows the size of the trial that has struck you, and He also knows your capacity and strength to endure it. It is He who decreed it for you, and it is He who promised to guide your heart if you believe and surrender.\n\nSo, dear reader, think deeply: when calamity strikes, many people despair, panic, or lose patience, but the believer turns back to Allah, accepts His decree, and in return Allah grants his heart guidance. That guidance is the greatest gift in the midst of trial. A calamity that brings you closer to Allah is not a punishment, but in reality a hidden mercy.\n\nPause and ask yourself: how many times have you faced a trial that seemed unbearable, but later you discovered it was in fact the key to blessings and doors you never imagined? How many times has the earth felt tight around you, only for Allah to open new ways because of that very hardship? This is the meaning of the verse: to see Allah’s hand in everything that befalls you, to believe that behind every pain lies wisdom, and to trust that your heart will remain guided as long as you place your faith in your Lord."
    }
  ]
}