{
  "hadiths": [
    {
      "id": 1,
      "name": "البخاري 3559",
      "hadith_text": "عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا قَالَ: «لَمْ يَكُنِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاحِشًا وَلَا مُتَفَحِّشًا، وَكَانَ يَقُولُ: إِنَّ مِنْ خِيَارِكُمْ أَحْسَنَكُمْ أَخْلَاقًا» [صحيح البخاري، رقم 3559]",
      "tafsir_ar": "عزيزي القارئ، هذا الحديث يفتح لنا بابًا عظيمًا لفهم شخصية خير البشر ﷺ، فهو يصفه أولًا بنفي ما لا يليق: «لَمْ يَكُنْ فَاحِشًا» أي لم يكن في كلامه أو أفعاله ما يخدش الحياء أو يجرح القلوب. الفاحش هو من يتعمد الألفاظ القبيحة أو الأفعال المبتذلة، والنبي ﷺ كان أرقى من ذلك، فكل كلمة تخرج من فيه الشريف كانت طاهرة، نقية، كالماء العذب على قلب عطشان.\n\nثم يقول: «ولا متفحشًا»، أي لم يكن حتى يتكلف الفحش أو يتصنعه. بعض الناس قد لا تكون طبيعتهم الفحش، لكن حين يغضبون أو يريدون أن يظهروا الشدة، يتصنعون كلمات بذيئة. أما الحبيب ﷺ، فكان نقيًّا في باطنه وظاهره، في رضاه وغضبه، في سرّه وعلانيته، لا يزيده الغضب إلا وقارًا، ولا يخرجه عن دائرة الحلم.\n\nثم نسمع جوهرة الحديث: «إِنَّ مِنْ خِيَارِكُمْ أَحْسَنَكُمْ أَخْلَاقًا». هنا يرفع النبي ﷺ معيار التفاضل بين الناس. لم يقل: من أغناكم، أو من أقواكم، أو من أشدكم سلطانًا، بل جعل ميزان الخير والفضيلة هو حسن الخلق. كأن الرسول ﷺ يخبرنا: أن طريق القرب منه، وطريق محبة الله، ليس بكثرة المال ولا بسطوة الجاه، وإنما بلين القلب، وكظم الغيظ، والرحمة، والصدق، والبشاشة، والوفاء.\n\nلو تأملت يا عزيزي القارئ، ستشعر أن الحديث هذا مثل مرآة ناصعة، تعكس لنا صورتنا الحقيقية. عندما تقرأ: \"إن من خياركم أحسنكم أخلاقًا\" تجد نفسك تسأل: أين أنا من هذا المقياس؟ هل أنا من خيار الناس؟ كيف أخلاقي مع أهلي، مع والديّ، مع أصحابي، مع من أختلف معهم؟\n\nالنبي ﷺ كان قدوة في كل خلق حسن كان يبتسم في وجوه أصحابه، حتى قال جرير بن عبد الله: \"ما رآني رسول الله ﷺ إلا تبسم في وجهي\".\nكان رحيمًا بالصغار، يحملهم ويلاعبهم، كان حليمًا على الجاهلين، يعفو ويصفح حتى عمن أساء إليه، كان وفيًا في وعوده، صادقًا في كلامه، لينًا في معشره، هذا الحديث ليس مجرد وصف للنبي ﷺ، بل دعوة عملية لنا أن نسير على خطاه. فحسن الخلق ليس أمرًا تجميليًا أو ثانويًا، بل هو لبّ الدين وروحه. كما جاء في حديث آخر: «ما من شيء أثقل في ميزان العبد يوم القيامة من حسن الخلق».\nإن حسن الخلق يجعل حياتك وحياة من حولك جنة صغيرة قبل جنة الآخرة. تخيل لو أن كل إنسان عامل غيره بالرفق، بالرحمة، بالكلمة الطيبة، كيف ستهدأ النفوس وتصفو القلوب.\nباختصار يا عزيزي القارئ، هذا الحديث يذكرك أن تكون مثل النبي ﷺ: طاهرًا في كلامك،رفيقًا في معاملاتك، صادقًا في أخلاقك، فبقدر ما تُحسن خلقك، بقدر ما تقترب من خيار الناس، بل وتقترب من رسول الله ﷺ في درجته، فقد قال: «إن أقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا».",
      "english": "Narrated Abdullah ibn Amr (may Allah be pleased with them both):\n\"The Prophet (ﷺ) was neither Fahish (obscene, indecent) nor Mutafahish (deliberately using foul speech). He used to say: 'The best among you are those who have the best manners and character.'\"\n(Sahih al-Bukhari, 3559)\n\nThis hadith paints for us a portrait of the Prophet Muhammad ﷺ in the purest light. It tells us first of what he was not: he was never fahish, never vulgar, never uttering words that would shame the tongue or stain the heart. His speech was as pure as flowing water, as gentle as a breeze that comforts a weary traveler.\n\nNor was he mutafahish—he never forced himself into ugliness. Some people may not naturally be foul, but when anger overtakes them, they put on a mask of harshness and deliberately use words that wound. The Prophet ﷺ was not like that; even in anger, his dignity remained, his patience glowed, and his mercy never left him.\n\nThen comes the heart of the hadith: \"The best among you are those who have the best manners and character.\" Here, the Prophet ﷺ resets the scale of greatness. Not wealth, not power, not lineage, but character is the true measure of worth. It is as if he is whispering across time: \"If you want to be among the best, refine your heart, refine your tongue, refine your dealings with others.\"\n\nWhen you read these words, you can almost feel them holding up a mirror. You are compelled to ask yourself: Where do I stand? Am I counted among the best by my character? How do I speak to my family, to my parents, to strangers, to those who oppose me?\n\nThe Prophet ﷺ himself lived this truth.\nHe smiled often, spreading light through his presence. He showed tenderness to children, carrying them, playing with them. He forgave those who wronged him, even those who sought to harm him. He was loyal in his promises, sincere in his words, soft in his company.\n\nThis hadith is not just a description—it is a call, an invitation. It tells you that to walk closer to the Prophet ﷺ, to sit nearer to him on the Day of Judgment, you must polish your character. For he said in another narration: \"The closest to me among you on the Day of Resurrection will be those of you who are best in character.\"\n\nGood character is not a small ornament to faith; it is its essence, its fragrance, its fruit. It is what turns homes into havens, friendships into blessings, and society into peace.\n\nSo when you read this hadith, let it be more than information—let it be a mirror and a map: a mirror that shows you where you are, and a map that guides you to where you can be—among the best, by the beauty of your character."
    }
  ]
}

