{
  "feelings": {
    "happy": {
      "name_ar": "سعيد",
      "name_en": "Happy",
      "icon": "fas fa-smile",
      "color": "#4CAF50",
      "verses": [
        {
          "id": 1,
          "title": "الحديد ١٢ / Al-Hadid 12",
          "verse_text": "﴿يَوْمَ تَرَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَـٰتِ يَسۡعَىٰ نُورُهُم بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَـٰنِهِم بُشۡرَىٰكُمُ ٱلۡيَوۡمَ جَنَّـٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِينَ فِيهَاۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ﴾ [الحديد: ١٢]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية الكريمة ترسم لوحة من أعظم مشاهد يوم القيامة، لحظة السعادة الكبرى التي تفوق كل سعادة عرفها البشر في الدنيا. يقول الله تعالى إنك سترى المؤمنين والمؤمنات يوم القيامة، والنور يفيض من أمامهم وعن أيمانهم، يضيء طريقهم في ظلمات ذلك اليوم العظيم."
        },
        {
          "id": 2,
          "title": "الأحقاف ١٤ / Al-Ahqaf 14",
          "verse_text": "﴿أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلۡجَنَّةِ خَـٰلِدِينَ فِيهَا جَزَآءًۢ بِمَا كَانُوا۟ يَعۡمَلُونَ﴾ [الأحقاف: ١٤]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية تأتي بعد أن ذكر الله حال المؤمنين الذين قالوا: ربنا الله ثم استقاموا، ما التفتوا لغيره ولا بدّلوا ولا انحرفوا. النتيجة التي يعلنها الله لهم هنا هي خلاصة السعادة والطمأنينة."
        }
      ]
    },
    "angry": {
      "name_ar": "الغضب",
      "name_en": "Angry",
      "icon": "fas fa-angry",
      "color": "#F44336",
      "verses": [
        {
          "id": 1,
          "title": "الشورى ٤٠ / Ash-Shura 40",
          "verse_text": "﴿وَجَزَآءُ سَيِّئَةٍ سَيِّئَةٞ مِّثۡلُهَاۖ فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِۚ إِنَّهُۥ لَا يُحِبُّ ٱلظَّـٰلِمِينَ﴾ [الشورى: ٤٠]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية تعلمك كيف تتعامل مع الغضب بحكمة. الله يقول إن من حقك أن تردّ السيئة بمثلها، لكن العفو والإصلاح أعظم أجراً عند الله. فعندما تغضب، تذكر أن العفو طريق إلى رضا الله."
        }
      ]
    },
    "sad": {
      "name_ar": "حزن",
      "name_en": "Sad",
      "icon": "fas fa-sad-tear",
      "color": "#2196F3",
      "verses": [
        {
          "id": 1,
          "title": "البقرة ١٥٥-١٥٦ / Al-Baqarah 155-156",
          "verse_text": "﴿وَلَنَبۡلُوَنَّكُم بِشَيۡءٍ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٍ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ ٱلَّذِينَ إِذَآ أَصَـٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ﴾ [البقرة: ١٥٥-١٥٦]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية تخاطب قلبك المحزون بلطف ورحمة. الله يخبرك أن الابتلاء سنة الحياة، وأن الحزن جزء من الامتحان. لكن الصابرين لهم بشارة عظيمة، فعندما تقول 'إنا لله وإنا إليه راجعون' تتحول مصيبتك إلى أجر."
        }
      ]
    },
    "alone": {
      "name_ar": "وحدة",
      "name_en": "Alone",
      "icon": "fas fa-user",
      "color": "#9C27B0",
      "verses": [
        {
          "id": 1,
          "title": "البقرة ١٨٦ / Al-Baqarah 186",
          "verse_text": "﴿وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ﴾ [البقرة: ١٨٦]",
          "content": "اسمع يا عزيزي القارئ، عندما تشعر بالوحدة، تذكر هذه الآية العظيمة. الله يقول لك: أنا قريب منك، أسمع دعاءك، أجيب نداءك. لست وحيداً أبداً، فالله معك في كل لحظة. ادعه واطلب منه، فهو أقرب إليك من حبل الوريد."
        }
      ]
    },
    "regret": {
      "name_ar": "الندم",
      "name_en": "Regret",
      "icon": "fas fa-heart-broken",
      "color": "#FF9800",
      "verses": [
        {
          "id": 1,
          "title": "الزمر ٥٣ / Az-Zumar 53",
          "verse_text": "﴿قُلۡ يَـٰعِبَادِيَ ٱلَّذِينَ أَسۡرَفُواْ عَلَىٰٓ أَنفُسِهِمۡ لَا تَقۡنَطُواْ مِن رَّحۡمَةِ ٱللَّهِۚ إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ﴾ [الزمر: ٥٣]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية نور لكل قلب نادم. مهما كانت ذنوبك، مهما بلغت أخطاؤك، الله يقول لك: لا تيأس من رحمتي. إن الله يغفر الذنوب جميعاً، فقط ارجع إليه بصدق وندم، وستجد باب التوبة مفتوحاً."
        }
      ]
    },
    "afraid": {
      "name_ar": "الخوف",
      "name_en": "Afraid",
      "icon": "fas fa-exclamation-triangle",
      "color": "#795548",
      "verses": [
        {
          "id": 1,
          "title": "البقرة ٦٢ / Al-Baqarah 62",
          "verse_text": "﴿إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَـٰلِحًا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ﴾ [البقرة: ٦٢]",
          "content": "اسمع يا عزيزي القارئ، هذه الآية تزيل الخوف من قلبك. الله يعدك أنه إذا آمنت به وعملت صالحاً، فلا خوف عليك في الدنيا ولا في الآخرة. هذا وعد من الله، والله لا يخلف الميعاد. فاطمئن وتوكل عليه."
        }
      ]
    },
    "lost": {
      "name_ar": "تائه",
      "name_en": "Lost",
      "icon": "fas fa-question-circle",
      "color": "#607D8B",
      "verses": [
        {
          "id": 1,
          "title": "الفاتحة ٦ / Al-Fatihah 6",
          "verse_text": "﴿ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ﴾ [الفاتحة: ٦]",
          "content": "اسمع يا عزيزي القارئ، عندما تشعر بالضياع والتيه، تذكر أن هذا الدعاء تقوله في كل صلاة. 'اهدنا الصراط المستقيم' - هذا طلب الهداية من الله. إذا كنت تائهاً، فاطلب من الله أن يهديك، وثق أنه سيدلك على الطريق الصحيح."
        }
      ]
    },
    "message": {
      "name_ar": "رسالة",
      "name_en": "Message",
      "icon": "fas fa-envelope-open-text",
      "color": "#E91E63",
      "verses": [
        {
          "id": 1,
          "title": "الإسراء ٩ / Al-Isra 9",
          "verse_text": "﴿إِنَّ هَـٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرًا كَبِيرًا﴾ [الإسراء: ٩]",
          "content": "اسمع يا عزيزي القارئ، هذه رسالة الله إليك من خلال القرآن. إن هذا القرآن يهديك للطريق الأقوم والأصح في الحياة. وإذا آمنت وعملت صالحاً، فلك أجر كبير عند الله. هذه هي الرسالة الخالدة التي تحتاجها في كل وقت."
        }
      ]
    }
  }
}
